{"id": "2511.15889", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15889", "abs": "https://arxiv.org/abs/2511.15889", "authors": ["Daniele Ravasio", "Bestem Abdulaziz", "Marcello Farina", "Andrea Ballarino"], "title": "Development of a velocity form for a class of RNNs, with application to offset-free nonlinear MPC design", "comment": "14 pages, 3 figures, under review", "summary": "This paper addresses the offset-free tracking problem for nonlinear systems described by a class of recurrent neural networks (RNNs). To compensate for constant disturbances and guarantee offset-free tracking in the presence of model-plant mismatches, we propose a novel reformulation of the RNN model in velocity form. Conditions based on linear matrix inequalities are then derived for the design of a nonlinear state observer and a nonlinear state-feedback controller, ensuring global or regional closed-loop stability of the origin of the velocity form dynamics. Moreover, to handle input and output constraints, a theoretically sound offset-free nonlinear model predictive control algorithm is developed. The algorithm exploits the velocity form model as the prediction model and the static controller as an auxiliary law for the definition of the terminal ingredients. Simulations on a pH-neutralisation process benchmark demonstrate the effectiveness of the proposed approach."}
{"id": "2511.15925", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15925", "abs": "https://arxiv.org/abs/2511.15925", "authors": ["Yashar Mousavi", "Mahsa Tavasoli", "Ibrahim Beklan Kucukdemiral", "Umit Cali", "Abdolhossein Sarrafzadeh", "Ali Karimoddini", "Afef Fekih"], "title": "Cyber-Resilient Data-Driven Event-Triggered Secure Control for Autonomous Vehicles Under False Data Injection Attacks", "comment": "14 pages, 8 figures", "summary": "This paper proposes a cyber-resilient secure control framework for autonomous vehicles (AVs) subject to false data injection (FDI) threats as actuator attacks. The framework integrates data-driven modeling, event-triggered communication, and fractional-order sliding mode control (FSMC) to enhance the resilience against adversarial interventions. A dynamic model decomposition (DMD)-based methodology is employed to extract the lateral dynamics from real-world data, eliminating the reliance on conventional mechanistic modeling. To optimize communication efficiency, an event-triggered transmission scheme is designed to reduce the redundant transmissions while ensuring system stability. Furthermore, an extended state observer (ESO) is developed for real-time estimation and mitigation of actuator attack effects. Theoretical stability analysis, conducted using Lyapunov methods and linear matrix inequality (LMI) formulations, guarantees exponential error convergence. Extensive simulations validate the proposed event-triggered secure control framework, demonstrating substantial improvements in attack mitigation, communication efficiency, and lateral tracking performance. The results show that the framework effectively counteracts actuator attacks while optimizing communication-resource utilization, making it highly suitable for safety-critical AV applications."}
{"id": "2511.15952", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15952", "abs": "https://arxiv.org/abs/2511.15952", "authors": ["Chengyu Li", "Saleh Faghfoorian", "Ivan Ruchkin"], "title": "What Does It Take to Get Guarantees? Systematizing Assumptions in Cyber-Physical Systems", "comment": null, "summary": "Formal guarantees for cyber-physical systems (CPS) rely on diverse assumptions. If satisfied, these assumptions enable the transfer of abstract guarantees into real-world assurances about the deployed CPS. Although assumptions are central to assured CPS, there is little systematic knowledge about what assumptions are made, what guarantees they support, and what it would take to specify them precisely. To fill this gap, we present a survey of assumptions and guarantees in the control, verification, and runtime assurance areas of CPS literature. From 104 papers over a 10-year span (2014-2024), we extracted 423 assumptions and 321 guarantees using grounded-theory coding. We also annotated the assumptions with 21 tags indicating elementary language features needed for specifications. Our analysis highlighted prevalent trends and gaps in CPS assumptions, particularly related to initialization, sensing, perception, neural components, and uncertainty. Our observations culminated in a call to action on reporting and testing CPS assumptions."}
{"id": "2511.16019", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16019", "abs": "https://arxiv.org/abs/2511.16019", "authors": ["Mengyun Xu", "Jie Fang", "Eui-Jin Kim", "Tony Z. Qiu", "Prateek Bansal"], "title": "Physics Informed Multi-task Joint Generative Learning for Arterial Vehicle Trajectory Reconstruction Considering Lane Changing Behavior", "comment": "29 pages, 14 figures, 2 tables. Submitted to Transportation Research Part C: Emerging Technologies. Preprint version", "summary": "Reconstructing complete traffic flow time-space diagrams from vehicle trajectories offer a comprehensive view on traffic dynamics at arterial intersections. However, obtaining full trajectories across networks is costly, and accurately inferring lane-changing (LC) and car-following behaviors in multi-lane environments remains challenging. This study proposes a generative framework for arterial vehicle trajectory reconstruction that jointly models lane-changing and car-following behaviors through physics-informed multi-task joint learning. The framework consists of a Lane-Change Generative Adversarial Network (LC-GAN) and a Trajectory-GAN. The LC-GAN models stochastic LC behavior from historical trajectories while considering physical conditions of arterial intersections, such as signal control, geometric configuration, and interactions with surrounding vehicles. The Trajectory-GAN then incorporates LC information from the LC-GAN with initial trajectories generated from physics-based car-following models, refining them in a data-driven manner to adapt to dynamic traffic conditions. The proposed framework is designed to reconstruct complete trajectories from only a small subset of connected vehicle (CV) trajectories; for example, even a single observed trajectory per lane, by incorporating partial trajectory information into the generative process. A multi-task joint learning facilitates synergistic interaction between the LC-GAN and Trajectory-GAN, allowing each component to serves as both auxiliary supervision and a physical condition for the other. Validation using two real-world trajectory datasets demonstrates that the framework outperforms conventional benchmark models in reconstructing complete time-space diagrams for multi-lane arterial intersections. This research advances the integration of trajectory-based sensing from CVs with physics-informed deep learning."}
{"id": "2511.15860", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15860", "abs": "https://arxiv.org/abs/2511.15860", "authors": ["Xusheng Zhu", "Kai-Kit Wong", "Boyi Tang", "Wen Chen", "Chan-Byoung Chae"], "title": "Fluid Reconfigurable Intelligent Surface (FRIS) Enabling Secure Wireless Communications", "comment": null, "summary": "The concept of fluid reconfigurable intelligent surface (FRIS) upgrades the conventional reconfigurable intelligent surface (RIS) paradigm by empowering its reflecting elements with positioning reconfigurability. This letter aims to investigate the use of FRIS to enhance physical-layer security in a system, in which a multi-antenna access point (AP) communicates with a legitimate user device in the presence of an eavesdropper. Unlike RIS with fixed-position elements, FRIS can dynamically select an optimal subset of elements from a larger array of candidate locations. We aim to maximize the secrecy rate by jointly optimizing the AP's transmit beamforming, the selection of FRIS activated elements, and their discrete phase shifts. The resulting problem is a challenging mixed-integer nonlinear program (MINLP), which is NP-hard. To address this, we propose an efficient algorithm based on an alternating optimization (AO) framework. Within this framework, the beamforming subproblem is optimally solved in closed form using the generalized eigenvalue method, while the combinatorial subproblem of joint element selection and discrete phase design is handled via the cross-entropy optimization (CEO) method. Simulation results show that the proposed FRIS design significantly outperforms the conventional RIS counterpart and other baselines, demonstrating the substantial security gains by element positioning as the new degree of freedom (DoF)."}
{"id": "2511.15710", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15710", "abs": "https://arxiv.org/abs/2511.15710", "authors": ["Md Main Uddin Hasan", "Milena Radenkovic"], "title": "Improving Resiliency of Vital Services in Flood-Affected Regions of Bangladesh Using Next-Generation Opportunistic DTN Edge Ad Hoc Networks", "comment": null, "summary": "Opportunistic routing architectures offer a resilient communication paradigm in environments where conventional networks fail due to disrupted infrastructure, dynamic node mobility, and intermittent connectivity conditions that commonly arise during large-scale disasters. In Bangladesh, recurring floods severely hinder communication systems, isolating affected populations and obstructing emergency response efforts. To address these challenges, there is a growing demand for intelligent and adaptive routing solutions capable of sustaining critical communication and services without relying on fixed infrastructure. This research presents AZIZA (Adaptive Zone-based Intelligent Fully Distributed Trust-Aware Routing Protocol), a next-generation opportunistic protocol designed to improve the resiliency of critical communication and services in disaster-prone and flood-affected regions. AZIZA supports adaptive data delivery for emergency alerts, sensor readings, and inter-zone coordination by integrating (1) zone-based forwarding to optimize localized transmission, (2) trust-aware logic to bypass uncooperative or malicious nodes, and (3) context-driven decision-making based on trust metrics, residual energy, and historical delivery patterns. AZIZA operates over lightweight, infrastructure-less edge ad hoc networks comprising mobile phones, UAVs, and ground vehicles acting as decentralized service relays. Simulation results using The Opportunistic Network Environment (ONE) Simulator configured with real-world mobility traces and flood data from Bangladesh demonstrate that AZIZA significantly outperforms benchmark approaches in delivery reliability, energy efficiency, and routing resilience. As a scalable and deployable framework, AZIZA advances the use of next-generation opportunistic routing in environments where traditional systems routinely collapse."}
{"id": "2511.15812", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15812", "abs": "https://arxiv.org/abs/2511.15812", "authors": ["Luke Dosiek", "Akaash Karn", "Frank Liu"], "title": "Rapid and Accurate Changepoint Detection of Power System Forced Oscillations", "comment": "Currently under review for the proceedings of the 2026 IEEE Power and Energy Society General Meeting (PESGM26)", "summary": "This paper describes a new approach for using changepoint detection (CPD) to estimate the starting and stopping times of a forced oscillation (FO) in measured power system data. As with a previous application of CPD to this problem, the pruned exact linear time (PELT) algorithm is used. However, instead of allowing PELT to automatically tune its penalty parameter, a method of manually providing it is presented that dramatically reduces computation time without sacrificing accuracy. Additionally, the new algorithm requires fewer input parameters and provides a formal, data-driven approach to setting the minimum FO segment length to consider as troublesome for an electromechanical mode meter. A low-order ARMAX representation of the minniWECC model is used to test the approach, where a 98\\% reduction in computation time is enjoyed with high estimation accuracy."}
{"id": "2511.15712", "categories": ["cs.CR", "cs.AI", "cs.DC"], "pdf": "https://arxiv.org/pdf/2511.15712", "abs": "https://arxiv.org/abs/2511.15712", "authors": ["Vivek Acharya"], "title": "Secure Autonomous Agent Payments: Verifying Authenticity and Intent in a Trustless Environment", "comment": "6 pages, 1 figure", "summary": "Artificial intelligence (AI) agents are increasingly capable of initiating financial transactions on behalf of users or other agents. This evolution introduces a fundamental challenge: verifying both the authenticity of an autonomous agent and the true intent behind its transactions in a decentralized, trustless environment. Traditional payment systems assume human authorization, but autonomous, agent-led payments remove that safeguard. This paper presents a blockchain-based framework that cryptographically authenticates and verifies the intent of every AI-initiated transaction. The proposed system leverages decentralized identity (DID) standards and verifiable credentials to establish agent identities, on-chain intent proofs to record user authorization, and zero-knowledge proofs (ZKPs) to preserve privacy while ensuring policy compliance. Additionally, secure execution environments (TEE-based attestations) guarantee the integrity of agent reasoning and execution. The hybrid on-chain/off-chain architecture provides an immutable audit trail linking user intent to payment outcome. Through qualitative analysis, the framework demonstrates strong resistance to impersonation, unauthorized transactions, and misalignment of intent. This work lays the foundation for secure, auditable, and intent-aware autonomous economic agents, enabling a future of verifiable trust and accountability in AI-driven financial ecosystems."}
{"id": "2511.15738", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15738", "abs": "https://arxiv.org/abs/2511.15738", "authors": ["Chao Yu", "Qixin Tan", "Jiaxuan Gao", "Shi Yu", "Hong Lu", "Xinting Yang", "Zelai Xu", "Yu Wang", "Yi Wu", "Eugene Vinitsky"], "title": "Extending Test-Time Scaling: A 3D Perspective with Context, Batch, and Turn", "comment": "44 pages, 12 figures", "summary": "Reasoning reinforcement learning (RL) has recently revealed a new scaling effect: test-time scaling. Thinking models such as R1 and o1 improve their reasoning accuracy at test time as the length of the reasoning context increases. However, compared with training-time scaling, test-time scaling is fundamentally limited by the limited context length of base models, which remains orders of magnitude smaller than the amount of tokens consumed during training. We revisit test-time enhancement techniques through the lens of scaling effect and introduce a unified framework of multi-dimensional test-time scaling to extend the capacity of test-time reasoning. Beyond conventional context-length scaling, we consider two additional dimensions: batch scaling, where accuracy improves with parallel sampling, and turn scaling, where iterative self-refinement enhances reasoning quality. Building on this perspective, we propose 3D test-time scaling, which integrates context, batch, and turn scaling. We show that: (1) each dimension demonstrates a test-time scaling effect, but with a bounded capacity; (2) combining all three dimensions substantially improves the reasoning performance of challenging testbeds, including IOI, IMO, and CPHO, and further benefits from human preference feedback; and (3) the human-in-the-loop framework naturally extends to a more open-ended domain, i.e., embodied learning, which enables the design of humanoid control behaviors."}
{"id": "2511.16066", "categories": ["eess.SY", "cs.NE"], "pdf": "https://arxiv.org/pdf/2511.16066", "abs": "https://arxiv.org/abs/2511.16066", "authors": ["Shreyan Banerjee", "Aasifa Rounak", "Vikram Pakrashi"], "title": "Bellman Memory Units: A neuromorphic framework for synaptic reinforcement learning with an evolving network topology", "comment": "11 pages, submitted to IEEE Transactions on Automatic Control", "summary": "Application of neuromorphic edge devices for control is limited by the constraints on gradient-free online learning and scalability of the hardware across control problems. This paper introduces a synaptic Q-learning algorithm for the control of the classical Cartpole, where the Bellman equations are incorporated at the synaptic level. This formulation enables the iterative evolution of the network topology, represented as a directed graph, throughout the training process. This is followed by a similar approach called neuromorphic Bellman Memory Units (BMU(s)), which are implemented with the Neural Engineering Framework on Intel's Loihi neuromorphic chip. Topology evolution, in conjunction with mixed-signal computation, leverages the optimization of the number of neurons and synapses that could be used to design spike-based reinforcement learning accelerators. The proposed architecture can potentially reduce resource utilization on board, aiding the manufacturing of compact application-specific neuromorphic ICs. Moreover, the on-chip learning introduced in this work and implemented on a neuromorphic chip can enable adaptation to unseen control scenarios."}
{"id": "2511.15838", "categories": ["cs.LG", "cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15838", "abs": "https://arxiv.org/abs/2511.15838", "authors": ["Meiyi Zhu", "Caili Guo", "Chunyan Feng", "Osvaldo Simeone"], "title": "Attention-Based Feature Online Conformal Prediction for Time Series", "comment": "25 pages, 24 figures", "summary": "Online conformal prediction (OCP) wraps around any pre-trained predictor to produce prediction sets with coverage guarantees that hold irrespective of temporal dependencies or distribution shifts. However, standard OCP faces two key limitations: it operates in the output space using simple nonconformity (NC) scores, and it treats all historical observations uniformly when estimating quantiles. This paper introduces attention-based feature OCP (AFOCP), which addresses both limitations through two key innovations. First, AFOCP operates in the feature space of pre-trained neural networks, leveraging learned representations to construct more compact prediction sets by concentrating on task-relevant information while suppressing nuisance variation. Second, AFOCP incorporates an attention mechanism that adaptively weights historical observations based on their relevance to the current test point, effectively handling non-stationarity and distribution shifts. We provide theoretical guarantees showing that AFOCP maintains long-term coverage while provably achieving smaller prediction intervals than standard OCP under mild regularity conditions. Extensive experiments on synthetic and real-world time series datasets demonstrate that AFOCP consistently reduces the size of prediction intervals by as much as $88\\%$ as compared to OCP, while maintaining target coverage levels, validating the benefits of both feature-space calibration and attention-based adaptive weighting."}
{"id": "2511.15861", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15861", "abs": "https://arxiv.org/abs/2511.15861", "authors": ["Arman Mollakhani", "Jerayu Tiamraj", "Shu-Jie Cao", "Dongning Guo"], "title": "Inter-Satellite Link Configuration for Fast Delivery in Low-Earth-Orbit Constellations", "comment": "To be presented at the IEEE 2026 Aerospace Conference", "summary": "End-to-end latency in large low-Earth-orbit (LEO) constellations is dominated by propagation delay, making total delay roughly proportional to the network diameter, the longest shortest path in hops. Current inter-satellite link (ISL) layouts have rarely been optimized to minimize network diameter while simultaneously satisfying physical and operational constraints, including maximum link distance, line-of-sight, per-satellite hardware limits, and long-term link viability over orbital periods. In this study, the selection and assignment of inter-plane ISLs is formulated as a diameter-minimization problem on a Starlink-inspired Walker-Delta constellation in which each satellite is equipped with two fixed intra-plane links and may activate up to two inter-plane links. Beginning with a feasible baseline, the topology is iteratively refined by a local-search procedure that replaces or reinforces links to shrink the diameter. The resulting ISL configuration meets all geometric and hardware limits, preserves link stability across multiple orbital periods, and yields a sparse, diameter-aware graph with potential for centralized routing capabilities. Simulations demonstrate that the proposed algorithm achieves low worst-case latency without compromising ISL stability, and the trade-off between hop count and long-term link stability is empirically measured for guidance of future LEO network deployments."}
{"id": "2511.15902", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15902", "abs": "https://arxiv.org/abs/2511.15902", "authors": ["Roman Dolgopolyi", "Antonis Chatzipanagiotou"], "title": "EEG Emotion Recognition Through Deep Learning", "comment": "This version corresponds to the original manuscript submitted to the 22nd EMCIS conference prior to peer review. The peer-reviewed and accepted version will appear in the Springer conference proceedings", "summary": "An advanced emotion classification model was developed using a CNN-Transformer architecture for emotion recognition from EEG brain wave signals, effectively distinguishing among three emotional states, positive, neutral and negative. The model achieved a testing accuracy of 91%, outperforming traditional models such as SVM, DNN, and Logistic Regression. Training was conducted on a custom dataset created by merging data from SEED, SEED-FRA, and SEED-GER repositories, comprising 1,455 samples with EEG recordings labeled according to emotional states. The combined dataset represents one of the largest and most culturally diverse collections available. Additionally, the model allows for the reduction of the requirements of the EEG apparatus, by leveraging only 5 electrodes of the 62. This reduction demonstrates the feasibility of deploying a more affordable consumer-grade EEG headset, thereby enabling accessible, at-home use, while also requiring less computational power. This advancement sets the groundwork for future exploration into mood changes induced by media content consumption, an area that remains underresearched. Integration into medical, wellness, and home-health platforms could enable continuous, passive emotional monitoring, particularly beneficial in clinical or caregiving settings where traditional behavioral cues, such as facial expressions or vocal tone, are diminished, restricted, or difficult to interpret, thus potentially transforming mental health diagnostics and interventions..."}
{"id": "2511.15730", "categories": ["cs.CR", "cs.CE", "cs.CY"], "pdf": "https://arxiv.org/pdf/2511.15730", "abs": "https://arxiv.org/abs/2511.15730", "authors": ["Kaeli Andrews", "Linh Ngo", "Md Amiruzzaman"], "title": "A Detailed Comparative Analysis of Blockchain Consensus Mechanisms", "comment": "15 Pages, 3 Figures, 2 Tables", "summary": "This paper presents a comprehensive comparative analysis of two dominant blockchain consensus mechanisms, Proof of Work (PoW) and Proof of Stake (PoS), evaluated across seven critical metrics: energy use, security, transaction speed, scalability, centralization risk, environmental impact, and transaction fees. Utilizing recent academic research and real-world blockchain data, the study highlights that PoW offers robust, time-tested security but suffers from high energy consumption, slower throughput, and centralization through mining pools. In contrast, PoS demonstrates improved scalability and efficiency, significantly reduced environmental impact, and more stable transaction fees, however it raises concerns over validator centralization and long-term security maturity. The findings underscore the trade-offs inherent in each mechanism and suggest hybrid designs may combine PoW's security with PoS's efficiency and sustainability. The study aims to inform future blockchain infrastructure development by striking a balance between decentralization, performance, and ecological responsibility."}
{"id": "2511.15743", "categories": ["cs.LG", "astro-ph.EP", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.15743", "abs": "https://arxiv.org/abs/2511.15743", "authors": ["Linnea M. Wolniewicz", "Halil S. Kelebek", "Simone Mestici", "Michael D. Vergalla", "Giacomo Acciarini", "Bala Poduval", "Olga Verkhoglyadova", "Madhulika Guhathakurta", "Thomas E. Berger", "Atılım Güneş Baydin", "Frank Soboczenski"], "title": "Connecting the Dots: A Machine Learning Ready Dataset for Ionospheric Forecasting Models", "comment": "8 pages, 2 figures, 2 tables. Accepted as a poster presentation in the Machine Learning for the Physical Sciences workshop at NeurIPS 2025", "summary": "Operational forecasting of the ionosphere remains a critical space weather challenge due to sparse observations, complex coupling across geospatial layers, and a growing need for timely, accurate predictions that support Global Navigation Satellite System (GNSS), communications, aviation safety, as well as satellite operations. As part of the 2025 NASA Heliolab, we present a curated, open-access dataset that integrates diverse ionospheric and heliospheric measurements into a coherent, machine learning-ready structure, designed specifically to support next-generation forecasting models and address gaps in current operational frameworks. Our workflow integrates a large selection of data sources comprising Solar Dynamic Observatory data, solar irradiance indices (F10.7), solar wind parameters (velocity and interplanetary magnetic field), geomagnetic activity indices (Kp, AE, SYM-H), and NASA JPL's Global Ionospheric Maps of Total Electron Content (GIM-TEC). We also implement geospatially sparse data such as the TEC derived from the World-Wide GNSS Receiver Network and crowdsourced Android smartphone measurements. This novel heterogeneous dataset is temporally and spatially aligned into a single, modular data structure that supports both physical and data-driven modeling. Leveraging this dataset, we train and benchmark several spatiotemporal machine learning architectures for forecasting vertical TEC under both quiet and geomagnetically active conditions. This work presents an extensive dataset and modeling pipeline that enables exploration of not only ionospheric dynamics but also broader Sun-Earth interactions, supporting both scientific inquiry and operational forecasting efforts."}
{"id": "2511.16093", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16093", "abs": "https://arxiv.org/abs/2511.16093", "authors": ["Xinyuan Liao", "Shaowei Chen", "Shuai Zhao"], "title": "Parallelizable Complex Neural Dynamics Models for PMSM Temperature Estimation with Hardware Acceleration", "comment": null, "summary": "Accurate and efficient thermal dynamics models of permanent magnet synchronous motors are vital to efficient thermal management strategies. Physics-informed methods combine model-based and data-driven methods, offering greater flexibility than model-based methods and superior explainability compared to data-driven methods. Nonetheless, there are still challenges in balancing real-time performance, estimation accuracy, and explainability. This paper presents a hardware-efficient complex neural dynamics model achieved through the linear decoupling, diagonalization, and reparameterization of the state-space model, introducing a novel paradigm for the physics-informed method that offers high explainability and accuracy in electric motor temperature estimation tasks. We validate this physics-informed method on an NVIDIA A800 GPU using the JAX machine learning framework, parallel prefix sum algorithm, and Compute Unified Device Architecture (CUDA) platform. We demonstrate its superior estimation accuracy and parallelizable hardware acceleration capabilities through experimental evaluation on a real electric motor."}
{"id": "2511.16352", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.16352", "abs": "https://arxiv.org/abs/2511.16352", "authors": ["Till-Yannic Müller", "Frederik Zumegen", "Reinhard Wiesmayr", "Emre Gönültaş", "Christoph Studer"], "title": "Neural Positioning Without External Reference", "comment": "Submitted to a journal", "summary": "Channel state information (CSI)-based user equipment (UE) positioning with neural networks -- referred to as neural positioning -- is a promising approach for accurate off-device UE localization. Most existing methods train their neural networks with ground-truth position labels obtained from external reference positioning systems, which requires costly hardware and renders label acquisition difficult in large areas. In this work, we propose a novel neural positioning pipeline that avoids the need for any external reference positioning system. Our approach trains the positioning network only using CSI acquired off-device and relative displacement commands executed on commercial off-the-shelf (COTS) robot platforms, such as robotic vacuum cleaners -- such an approach enables inexpensive training of accurate neural positioning functions over large areas. We evaluate our method in three real-world scenarios, ranging from small line-of-sight (LoS) areas to larger non-line-of-sight (NLoS) environments, using CSI measurements acquired in IEEE 802.11 Wi-Fi and 5G New Radio (NR) systems. Our experiments demonstrate that the proposed neural positioning pipeline achieves UE localization accuracies close to state-of-the-art methods that require externally acquired high-precision ground-truth position labels for training."}
{"id": "2511.16011", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16011", "abs": "https://arxiv.org/abs/2511.16011", "authors": ["Haotong Wang", "Jun Du", "Chunxiao Jiang", "Jintao Wang", "Mérouane Debbah", "Zhu Han"], "title": "Graph-Aware Temporal Encoder Based Service Migration and Resource Allocation in Satellite Networks", "comment": null, "summary": "The rapid expansion of latency-sensitive applications has sparked renewed interest in deploying edge computing capabilities aboard satellite constellations, aiming to achieve truly global and seamless service coverage. On one hand, it is essential to allocate the limited onboard computational and communication resources efficiently to serve geographically distributed users. On the other hand, the dynamic nature of satellite orbits necessitates effective service migration strategies to maintain service continuity and quality as the coverage areas of satellites evolve. We formulate this problem as a spatio-temporal Markov decision process, where satellites, ground users, and flight users are modeled as nodes in a time-varying graph. The node features incorporate queuing dynamics to characterize packet loss probabilities. To solve this problem, we propose a Graph-Aware Temporal Encoder (GATE) that jointly models spatial correlations and temporal dynamics. GATE uses a two-layer graph convolutional network to extract inter-satellite and user dependencies and a temporal convolutional network to capture their short-term evolution, producing unified spatio-temporal representations. The resulting spatial-temporal representations are passed into a Hybrid Proximal Policy Optimization (HPPO) framework. This framework features a multi-head actor that outputs both discrete service migration decisions and continuous resource allocation ratios, along with a critic for value estimation. We conduct extensive simulations involving both persistent and intermittent users distributed across real-world population centers."}
{"id": "2511.15947", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15947", "abs": "https://arxiv.org/abs/2511.15947", "authors": ["Jeongju Jee", "Jeffrey G. Andrews"], "title": "Integrated Coexistence for Satellite and Terrestrial Networks with Multistatic ISAC", "comment": null, "summary": "Tightly integrated low earth orbit (LEO) satellite communications and terrestrial integrated sensing and communication (ISAC) are expected to be key novel aspects of the 6G era. Spectrum sharing between satellite and terrestrial cellular networks may, however, cause severe interference. This paper introduces a cooperation framework for integrated coexistence between satellite and terrestrial networks where the terrestrial network also deploys multistatic ISAC. Unlike prior works that assume ideal channel state information (CSI) acquisition, the proposed approach develops a practical structure consisting of pre-optimization and refinement stages that leverages the predictability of satellite CSI. In addition, a co-design of terrestrial beamforming and satellite power allocation utilizing a weighted minimum mean-squared error algorithm is proposed, and a target-radar association method designed for multistatic ISAC is presented. Simulation results show that the proposed approach significantly enhances the performance of these integrated networks. Furthermore, it is confirmed that the overall performance approaches the interference-free benchmark as the number of spot beams and radar receivers increases, demonstrating the feasibility of spectral coexistence between the two networks."}
{"id": "2511.15744", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.15744", "abs": "https://arxiv.org/abs/2511.15744", "authors": ["Cristhian Kapelinski", "Douglas Lautert", "Beatriz Machado", "Diego Kreutz"], "title": "AnonLFI 2.0: Extensible Architecture for PII Pseudonymization in CSIRTs with OCR and Technical Recognizers", "comment": "4 pages, 1 figure, 2 tabels, submitted to ERRC/WRSeg 2025", "summary": "This work presents AnonLFI 2.0, a modular pseudonymization framework for CSIRTs that uses HMAC SHA256 to generate strong and reversible pseudonyms, preserves XML and JSON structures, and integrates OCR and technical recognizers for PII and security artifacts. In two case studies involving OCR applied to PDF documents and an OpenVAS XML report, the system achieved perfect precision and F1 scores of 76.5 and 92.13, demonstrating its effectiveness for securely preparing complex cybersecurity datasets."}
{"id": "2511.15767", "categories": ["cs.LG", "cs.AI", "cs.PL"], "pdf": "https://arxiv.org/pdf/2511.15767", "abs": "https://arxiv.org/abs/2511.15767", "authors": ["Bardia Nadimi", "Khashayar Filom", "Deming Chen", "Hao Zheng"], "title": "TB or Not TB: Coverage-Driven Direct Preference Optimization for Verilog Stimulus Generation", "comment": null, "summary": "With the rapid advancement of Large Language Models (LLMs), there is growing interest in applying them to hardware design and verification. Among these stages, design verification remains the most time-consuming and resource-intensive phase, where generating effective stimuli for the design under test (DUT) is both critical and labor-intensive. We present {\\it TB or not TB}, a framework for automated stimulus generation using LLMs fine-tuned through Coverage-Driven Direct Preference Optimization (CD-DPO). To enable preference-based training, we introduce PairaNet, a dataset derived from PyraNet that pairs high- and low-quality testbenches labeled using simulation-derived coverage metrics. The proposed CD-DPO method integrates quantitative coverage feedback directly into the optimization objective, guiding the model toward generating stimuli that maximize verification coverage. Experiments on the CVDP CID12 benchmark show that {\\it TB or not TB} outperforms both open-source and commercial baselines, achieving up to 77.27\\% improvement in code coverage, demonstrating the effectiveness of Coverage-driven preference optimization for LLM-based hardware verification."}
{"id": "2511.16235", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16235", "abs": "https://arxiv.org/abs/2511.16235", "authors": ["Robin Wroblowski", "Rodolphe Sepulchre"], "title": "Describing Functions and Phase Response Curves of Excitable Systems", "comment": "7 pages, 6 figures, submitted to European Control Conference 2026", "summary": "The describing function (DF) and phase response curve (PRC) are classical tools for the analysis of feedback oscillations and rhythmic behaviors, widely used across control engineering, biology, and neuroscience. These tools are known to have limitations in networks of relaxation oscillators and excitable systems. For this reason, the paper proposes a novel approach tailored to excitable systems. Our analysis focuses on the discrete-event operator mapping input trains of events to output trains of events. The methodology is illustrated on the excitability model of Hodgkin-Huxley. The proposed framework provides a basis for designing and analyzing central pattern generators in networks of excitable neurons, with direct relevance to neuromorphic control and neurophysiology."}
{"id": "2511.16063", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16063", "abs": "https://arxiv.org/abs/2511.16063", "authors": ["Jason Gerard", "Juan A. Fraire", "Sandra Céspedes"], "title": "Modeling Pointing, Acquisition, and Tracking Delays in Free-Space Optical Satellite Networks", "comment": "2025 IEEE International Conference on Wireless for Space and Extreme Environments (WiSEE) - STINT Workshop", "summary": "Free-space optical inter-satellite links (OISLs) enable high-capacity space communications but require precise Pointing, Acquisition, and Tracking (PAT) between links. Current scheduling approaches often overlook or oversimplify PAT delays, leading to inefficient contact planning and overestimated network capacities. We present a validated model for quantifying retargeting delays, defined as the delay-inducing portion of PAT before data transmission begins, encompassing coarse pointing, fine pointing, and the handover to tracking. The model is grounded in mission data from NASA TBIRD, LLCD, DSOC, and ESA's Lunar Optical Communication Terminal. We find that PAT delays exhibit multimodal distributions based on prior link geometry and scale nonlinearly with initial pointing uncertainty and optical beam width. Integrating these delay models into routing and scheduling algorithms will enable more accurate contact planning and higher utilization in optical networks. The proposed model provides a foundation for evaluating performance and designing algorithms for future large-scale optical satellite networks."}
{"id": "2511.16000", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16000", "abs": "https://arxiv.org/abs/2511.16000", "authors": ["Weijie Xiong", "Jingran Lin", "Zhiling Xiao", "Qiang Li", "Yuhan Zhang"], "title": "Joint Admission Control and Power Minimization in IRS-assisted Networks", "comment": null, "summary": "Joint admission control and power minimization are critical challenges in intelligent reflecting surface (IRS)-assisted networks. Traditional methods often rely on \\( l_1 \\)-norm approximations and alternating optimization (AO) techniques, which suffer from high computational complexity and lack robust convergence guarantees. To address these limitations, we propose a sigmoid-based approximation of the \\( l_0 \\)-norm AC indicator, enabling a more efficient and tractable reformulation of the problem. Additionally, we introduce a penalty dual decomposition (PDD) algorithm to jointly optimize beamforming and admission control, ensuring convergence to a stationary solution. This approach reduces computational complexity and supports distributed implementation. Moreover, it outperforms existing methods by achieving lower power consumption, accommodating more users, and reducing computational time."}
{"id": "2511.15745", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.15745", "abs": "https://arxiv.org/abs/2511.15745", "authors": ["Beatriz Machado", "Douglas Lautert", "Cristhian Kapelinski", "Diego Kreutz"], "title": "Structured Extraction of Vulnerabilities in OpenVAS and Tenable WAS Reports Using LLMs", "comment": "5 pages, 4 tables, 3 figures, submitted to ERRC/WRSeg 2025", "summary": "This paper proposes an automated LLM-based method to extract and structure vulnerabilities from OpenVAS and Tenable WAS scanner reports, converting unstructured data into a standardized format for risk management. In an evaluation using a report with 34 vulnerabilities, GPT-4.1 and DeepSeek achieved the highest similarity to the baseline (ROUGE-L greater than 0.7). The method demonstrates feasibility in transforming complex reports into usable datasets, enabling effective prioritization and future anonymization of sensitive data."}
{"id": "2511.15807", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15807", "abs": "https://arxiv.org/abs/2511.15807", "authors": ["Bhagyesh Kumar", "A S Aravinthakashan", "Akshat Satyanarayan", "Ishaan Gakhar", "Ujjwal Verma"], "title": "TopoReformer: Mitigating Adversarial Attacks Using Topological Purification in OCR Models", "comment": "Accepted at AAAI 2026 AI for CyberSecurity (AICS) Workshop", "summary": "Adversarially perturbed images of text can cause sophisticated OCR systems to produce misleading or incorrect transcriptions from seemingly invisible changes to humans. Some of these perturbations even survive physical capture, posing security risks to high-stakes applications such as document processing, license plate recognition, and automated compliance systems. Existing defenses, such as adversarial training, input preprocessing, or post-recognition correction, are often model-specific, computationally expensive, and affect performance on unperturbed inputs while remaining vulnerable to unseen or adaptive attacks. To address these challenges, TopoReformer is introduced, a model-agnostic reformation pipeline that mitigates adversarial perturbations while preserving the structural integrity of text images. Topology studies properties of shapes and spaces that remain unchanged under continuous deformations, focusing on global structures such as connectivity, holes, and loops rather than exact distance. Leveraging these topological features, TopoReformer employs a topological autoencoder to enforce manifold-level consistency in latent space and improve robustness without explicit gradient regularization. The proposed method is benchmarked on EMNIST, MNIST, against standard adversarial attacks (FGSM, PGD, Carlini-Wagner), adaptive attacks (EOT, BDPA), and an OCR-specific watermark attack (FAWA)."}
{"id": "2511.16253", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16253", "abs": "https://arxiv.org/abs/2511.16253", "authors": ["Abbas Tariverdi"], "title": "Robust Self-Triggered Control Approaches Optimizing Sensors Utilization with Asynchronous Measurements", "comment": "This research was conducted in 2017--2018. The literature review has not been updated and may not reflect subsequent or concurrent developments in the field", "summary": "Most control systems run on digital hardware with limited communication resources. This work develops self-triggered control for linear systems where sensors update independently (asynchronous measurements). The controller computes an optimal horizon at each sampling instant, selecting which sensor to read over the next several time steps to maximize inter-sample intervals while maintaining stability.\n  Two implementations address computational complexity. The online version solves an optimization problem at each update for theoretical optimality. The offline version precomputes optimal horizons using conic partitioning, reducing online computation to a lookup. Both guarantee exponential stability for unperturbed systems and global uniform ultimate boundedness for systems with bounded disturbances. Simulations demonstrate 59-74\\% reductions in sensor utilization compared to periodic sampling. The framework enables resource-efficient control in networked systems with communication constraints."}
{"id": "2511.16067", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16067", "abs": "https://arxiv.org/abs/2511.16067", "authors": ["Huan Lin", "Dakai Liu", "Lianghui Ding", "Lin Wang", "Feng Yang"], "title": "Bio-inspired Integrated Networking and Control for Large-Scale Swarm: A Hierarchical Co-design", "comment": "13 pages, 13figures", "summary": "Unmanned aerial vehicle (UAV) swarms encounter the challenge of high overhead due to both network management and formation control requirements. In this paper, we propose a Bio-inspired Integrated Networking and Control (BINC) scheme, enabling efficient formation management for swarms comprising thousands of UAVs. The scheme forms a two-layer hierarchical structure, where network clusters and formations share the same groups so that cross-cluster control is eliminated. For networking, we design a fused routing message together with control information to reduce overhead, and limit clusters' size to local two-hop topologies for fast command transmission. For controlling, we develop a hybrid bio-inspired control approach, including a pigeon-like leader-follower algorithm within formations under the consideration of cluster topology maintenance, and a starling-like algorithm among formations that helps to improve the ability of obstacle avoidance. We establish a simulation platform for UAV swarms with over 1000 nodes, and experimental results show that the proposed BINC scheme can achieve highly maneuverable swarm formation marching with significant reduction on communication overhead."}
{"id": "2511.16169", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16169", "abs": "https://arxiv.org/abs/2511.16169", "authors": ["Zijian Wang", "Xiaoyu Bao", "Chenhao Zhao", "Jihui Zhang", "Sizhi Ai", "Yuanqing Li"], "title": "UT-OSANet: A Multimodal Deep Learning model for Evaluating and Classifying Obstructive Sleep Apnea", "comment": "12 pages,8 figures", "summary": "Obstructive sleep apnea (OSA) is a highly prevalent sleep disorder that is associated with increased risks of cardiovascular morbidity and all-cause mortality. While existing diagnostic approaches can roughly classify OSA severity or detect isolated respiratory events, they lack the precision and comprehensiveness required for high resolution, event level diagnosis. Here, we present UT OSANet, a deep learning based model designed as a event level, multi scenario diagnostic tool for OSA. This model facilitates detailed identification of events associated with OSA, including apnea, hypopnea, oxygen desaturation, and arousal. Moreover, the model employs flexibly adjustable input modalities such as electroencephalography (EEG), airflow, and SpO 2. It utilizes a random masked modality combination training strategy, allowing it to comprehend cross-modal relationships while sustaining consistent performance across varying modality conditions. This model was trained and evaluated utilizing 9,021 polysomnography (PSG) recordings from five independent datasets. achieving sensitivities up to 0.93 and macro F1 scores of 0.84, 0.85 across home, clinical, and research scenarios. This model serves as an event-level, multi-scenario diagnostic instrument for real-world applications of OSA, while also establishing itself as a means to deepen the mechanistic comprehension of respiratory processes in sleep disorders and their extensive health implications."}
{"id": "2511.15759", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15759", "abs": "https://arxiv.org/abs/2511.15759", "authors": ["Badrinath Ramakrishnan", "Akshaya Balaji"], "title": "Securing AI Agents Against Prompt Injection Attacks", "comment": null, "summary": "Retrieval-augmented generation (RAG) systems have become widely used for enhancing large language model capabilities, but they introduce significant security vulnerabilities through prompt injection attacks. We present a comprehensive benchmark for evaluating prompt injection risks in RAG-enabled AI agents and propose a multi-layered defense framework. Our benchmark includes 847 adversarial test cases across five attack categories: direct injection, context manipulation, instruction override, data exfiltration, and cross-context contamination. We evaluate three defense mechanisms: content filtering with embedding-based anomaly detection, hierarchical system prompt guardrails, and multi-stage response verification, across seven state-of-the-art language models. Our combined framework reduces successful attack rates from 73.2% to 8.7% while maintaining 94.3% of baseline task performance. We release our benchmark dataset and defense implementation to support future research in AI agent security."}
{"id": "2511.15816", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.15816", "abs": "https://arxiv.org/abs/2511.15816", "authors": ["Mehryar Mohri", "Yutao Zhong"], "title": "Beyond Tsybakov: Model Margin Noise and $\\mathcal{H}$-Consistency Bounds", "comment": "ISAIM 2026", "summary": "We introduce a new low-noise condition for classification, the Model Margin Noise (MM noise) assumption, and derive enhanced $\\mathcal{H}$-consistency bounds under this condition. MM noise is weaker than Tsybakov noise condition: it is implied by Tsybakov noise condition but can hold even when Tsybakov fails, because it depends on the discrepancy between a given hypothesis and the Bayes-classifier rather than on the intrinsic distributional minimal margin (see Figure 1 for an illustration of an explicit example). This hypothesis-dependent assumption yields enhanced $\\mathcal{H}$-consistency bounds for both binary and multi-class classification. Our results extend the enhanced $\\mathcal{H}$-consistency bounds of Mao, Mohri, and Zhong (2025a) with the same favorable exponents but under a weaker assumption than the Tsybakov noise condition; they interpolate smoothly between linear and square-root regimes for intermediate noise levels. We also instantiate these bounds for common surrogate loss families and provide illustrative tables."}
{"id": "2511.16279", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16279", "abs": "https://arxiv.org/abs/2511.16279", "authors": ["Ziyue Li", "Guanglun Zhang", "Grant Ruan", "Haiwang Zhong", "Chongqing Kang"], "title": "Spatially Dependent Sampling of Component Failures for Power System Preventive Control Against Hurricane", "comment": null, "summary": "Preventive control is a crucial strategy for power system operation against impending natural hazards, and its effectiveness fundamentally relies on the realism of scenario generation. While most existing studies employ sequential Monte Carlo simulation and assume independent sampling of component failures, this oversimplification neglects the spatial correlations induced by meteorological factors such as hurricanes. In this paper, we identify and address the gap in modeling spatial dependence among component failures under extreme weather. We analyze how the mean, variance, and correlation structure of weather intensity random variables influence the correlation of component failures. To fill this gap, we propose a spatially dependent sampling method that enables joint sampling of multiple component failures by generating correlated meteorological intensity random variables. Comparative studies show that our approach captures long-tailed scenarios and reveals more extreme events than conventional methods. Furthermore, we evaluate the impact of scenario selection on preventive control performance. Our key findings are: (1) Strong spatial correlations in uncertain weather intensity consistently lead to interdependent component failures, regardless of mean value level; (2) The proposed method uncovers more high-severity scenarios that are missed by independent sampling; (3) Preventive control requires balancing load curtailment and over-generation costs under different scenario severities; (4) Ignoring failure correlations results in underestimating risk from high-severity events, undermining the robustness of preventive control strategies."}
{"id": "2511.16182", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16182", "abs": "https://arxiv.org/abs/2511.16182", "authors": ["Giuseppe Tomei", "Andrea Mayer", "Giuseppe Alcini", "Stefano Salsano"], "title": "Green Distributed AI Training: Orchestrating Compute Across Renewable-Powered Micro Datacenters", "comment": "Extended version of a paper submitted - v01 November 2025", "summary": "The accelerating expansion of AI workloads is colliding with an energy landscape increasingly dominated by intermittent renewable generation. While vast quantities of zero-carbon energy are routinely curtailed, today's centralized datacenter architectures remain poorly matched to this reality in both energy proportionality and geographic flexibility. This work envisions a shift toward a distributed fabric of renewable-powered micro-datacenters that dynamically follow the availability of surplus green energy through live workload migration.\n  At the core of this vision lies a formal feasibility-domain model that delineates when migratory AI computation is practically achievable. By explicitly linking checkpoint size, wide-area bandwidth, and renewable-window duration, the model reveals that migration is almost always energetically justified, and that time-not energy-is the dominant constraint shaping feasibility. This insight enables the design of a feasibility-aware orchestration framework that transforms migration from a best-effort heuristic into a principled control mechanism. Trace-driven evaluation shows that such orchestration can simultaneously reduce non-renewable energy use and improve performance stability, overcoming the tradeoffs of purely energy-driven strategies.\n  Beyond the immediate feasibility analysis, the extended version explores the architectural horizon of renewable-aware AI infrastructures. It examines the role of emerging ultra-efficient GPU-enabled edge platforms, anticipates integration with grid-level control and demand-response ecosystems, and outlines paths toward supporting partially migratable and distributed workloads. The work positions feasibility-aware migration as a foundational building block for a future computing paradigm in which AI execution becomes fluid, geographically adaptive, and aligned with renewable energy availability."}
{"id": "2511.16260", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16260", "abs": "https://arxiv.org/abs/2511.16260", "authors": ["Hao Wu", "Shanchi Wu", "Xinyuan Yao", "Rui Ni", "Chen Gong"], "title": "Low-Complexity Rydberg Array Reuse: Modeling and Receiver Design for Sparse Channels", "comment": null, "summary": "Rydberg atomic quantum receivers have been seen as novel radio frequency measurements and the high sensitivity to a large range of frequencies makes it attractive for communications reception. However, current implementations of Rydberg array antennas predominantly rely on simple stacking of multiple single-antenna units. While conceptually straightforward, this approach leads to substantial system bulkiness due to the unique requirements of atomic sensors, particularly the need for multiple spatially separated laser setups, rendering such designs both impractical for real-world applications and challenging to fabricate. This limitation underscores the critical need for developing multiplexed Rydberg sensor array architectures. In the domain of conventional RF array antennas, hybrid analog-digital beamforming has emerged as a pivotal architecture for large-scale millimeter-wave (mmWave) multiple-input multiple-output (MIMO) systems, as it substantially reduces the hardware complexity associated with fully-digital beamforming while closely approaching its performance. Drawing inspiration from this methodology, we conduct a systematic study in this work on the design principles, equivalent modeling, and precoding strategies for low-complexity multiplexed Rydberg array, an endeavor crucial to enabling practical and scalable quantum-enhanced communication systems."}
{"id": "2511.15837", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.15837", "abs": "https://arxiv.org/abs/2511.15837", "authors": ["Sai Sitharaman", "Hassan Karim", "Deepti Gupta", "Mudit Tyagi"], "title": "Scalable Privilege Analysis for Multi-Cloud Big Data Platforms: A Hypergraph Approach", "comment": null, "summary": "The rapid adoption of multi-cloud environments has amplified risks associated with privileged access mismanagement. Traditional Privileged Access Management (PAM) solutions based on Attribute-Based Access Control (ABAC) exhibit cubic O(n^3) complexity, rendering real-time privilege analysis intractable at enterprise scale. We present a novel PAM framework integrating NIST's Next Generation Access Control (NGAC) with hypergraph semantics to address this scalability crisis. Our approach leverages hypergraphs with labeled hyperedges to model complex, multi-dimensional privilege relationships, achieving sub-linear O(sqrt n) traversal complexity and O(nlogn) detection time-rigorously proven through formal complexity analysis. We introduce a 3-Dimensional Privilege Analysis framework encompassing Attack Surface, Attack Window, and Attack Identity to systematically identify privilege vulnerabilities. Experimental validation on AWS-based systems with 200-4000 users demonstrates 10x improvement over ABAC and 4x improvement over standard NGAC-DAG, enabling sub-second privilege detection at scale. Real-world use cases validate detection of privilege escalation chains, over-privileged users, and lateral movement pathways in multi-cloud infrastructures."}
{"id": "2511.15838", "categories": ["cs.LG", "cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15838", "abs": "https://arxiv.org/abs/2511.15838", "authors": ["Meiyi Zhu", "Caili Guo", "Chunyan Feng", "Osvaldo Simeone"], "title": "Attention-Based Feature Online Conformal Prediction for Time Series", "comment": "25 pages, 24 figures", "summary": "Online conformal prediction (OCP) wraps around any pre-trained predictor to produce prediction sets with coverage guarantees that hold irrespective of temporal dependencies or distribution shifts. However, standard OCP faces two key limitations: it operates in the output space using simple nonconformity (NC) scores, and it treats all historical observations uniformly when estimating quantiles. This paper introduces attention-based feature OCP (AFOCP), which addresses both limitations through two key innovations. First, AFOCP operates in the feature space of pre-trained neural networks, leveraging learned representations to construct more compact prediction sets by concentrating on task-relevant information while suppressing nuisance variation. Second, AFOCP incorporates an attention mechanism that adaptively weights historical observations based on their relevance to the current test point, effectively handling non-stationarity and distribution shifts. We provide theoretical guarantees showing that AFOCP maintains long-term coverage while provably achieving smaller prediction intervals than standard OCP under mild regularity conditions. Extensive experiments on synthetic and real-world time series datasets demonstrate that AFOCP consistently reduces the size of prediction intervals by as much as $88\\%$ as compared to OCP, while maintaining target coverage levels, validating the benefits of both feature-space calibration and attention-based adaptive weighting."}
{"id": "2511.16399", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16399", "abs": "https://arxiv.org/abs/2511.16399", "authors": ["Siddhesh Pimpale"], "title": "A Comprehensive Study on Cyber Attack Vectors in EV Traction Power Electronics", "comment": "15 pages, 3 Figures", "summary": "Electric vehicles (EVs) have drastically changed the auto industry and developed a new era of technologies where power electronics play the leading role in traction management, energy conversion and vehicle control processes. Nevertheless, this is a digital transformation, and the cyber-attack surface area has increased considerably, to the point that EV traction power electronics are becoming vulnerable to various cybersecurity risks. This paper is able to provide its expertise on possible cyber-attack vectors which can attack important parts of the traction, powertrain, including things like inverters, motor controllers, and communicated systems within the embedded bits. Using the (STRIDE) threat modeling framework, the research outlines and groups the vulnerabilities of the architecture and runs some attack simulations, such as the Denial of Service (DoS), spoofing, firmware manipulation, and data injection. The experiments prove the fact that a slight interruption in the control signal, the sensed data may lead to the severe working implications, such as unstable sensor values of the torque, abnormal voltage shifts, and entire system freezes. These results highlight the high priority on the need of injective embedded intrusion preventive mechanisms and secure design of firmware in EV powertrain electronics. In this paper, the author makes his contribution to the general body of knowledge that underpins the links existing between cyber security practices and the peculiar needs of automotive power electronics."}
{"id": "2511.16259", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16259", "abs": "https://arxiv.org/abs/2511.16259", "authors": ["Chiara Rubaltelli", "Marcello Morini", "Eugenio Moro", "Ilario Filippini"], "title": "Multi-Band Wireless Access-and-Backhaul (WAB) for 5G: Implementation and Experiments", "comment": null, "summary": "The growing demand for wireless capacity and coverage has driven research into new radio architectures and higher frequency bands. The recently standardized Wireless Access Backhaul (WAB) architecture represents a key evolution, enabling cost-effective network densification through wireless relaying. This paper presents the first experimental realization of a multi-band WAB testbed, combining an FR2 backhaul and an FR1 access link using open-source software and commercial off-the-shelf components. The proposed framework validates the feasibility of end-to-end WAB operation and demonstrates its ability to extend FR2 coverage while maintaining compatibility with legacy FR1 user equipment. Experimental campaigns conducted in vehicular and outdoor-to-indoor scenarios confirm that WAB effectively mitigates the limitations of FR2 links, particularly in uplink and Non-Line-of-Sight conditions. These results highlight WAB as a practical and scalable approach for next-generation wireless networks."}
{"id": "2511.16277", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16277", "abs": "https://arxiv.org/abs/2511.16277", "authors": ["Manjun Cui", "Ziqi Yan", "Yangfan He", "Zhichao Zhang"], "title": "Dynamic Multiple-Parameter Joint Time-Vertex Fractional Fourier Transform and its Intelligent Filtering Methods", "comment": null, "summary": "Dynamic graph signal processing provides a principled framework for analyzing time-varying data defined on irregular graph domains. However, existing joint time-vertex transforms such as the joint time-vertex fractional Fourier transform assign only one fractional order to the spatial domain and another one to the temporal domain, thereby restricting their capacity to model the complex and continuously varying dynamics of graph signals. To address this limitation, we propose a novel dynamic multiple-parameter joint time-vertex fractional Fourier transform (DMPJFRFT) framework, which introduces time-varying fractional parameters to achieve adaptive spectral modeling of dynamic graph structures. By assigning distinct fractional orders to each time step, the proposed transform enables dynamic and flexible representation of spatio-temporal signal evolution in the joint time-vertex spectral domain. Theoretical properties of the DMPJFRFT are systematically analyzed, and two filtering approaches: a gradient descent-based method and a neural network-based method, are developed for dynamic signal restoration. Experimental results on dynamic graph and video datasets demonstrate that the proposed framework effectively captures temporal topology variations and achieves superior performance in denoising and deblurring tasks compared with some state-of-the-art graph-based transforms and neural networks."}
{"id": "2511.15936", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.15936", "abs": "https://arxiv.org/abs/2511.15936", "authors": ["Jianting Zhang", "Sen Yang", "Alberto Sonnino", "Sebastián Loza", "Aniket Kate"], "title": "Lifefin: Escaping Mempool Explosions in DAG-based BFT", "comment": null, "summary": "Directed Acyclic Graph (DAG)-based Byzantine Fault-Tolerant (BFT) protocols have emerged as promising solutions for high-throughput blockchains. By decoupling data dissemination from transaction ordering and constructing a well-connected DAG in the mempool, these protocols enable zero-message ordering and implicit view changes. However, we identify a fundamental liveness vulnerability: an adversary can trigger mempool explosions to prevent transaction commitment, ultimately compromising the protocol's liveness.\n  In response, this work presents Lifefin, a generic and self-stabilizing protocol designed to integrate seamlessly with existing DAG-based BFT protocols and circumvent such vulnerabilities. Lifefin leverages the Agreement on Common Subset (ACS) mechanism, allowing nodes to escape mempool explosions by committing transactions with bounded resource usage even in adverse conditions. As a result, Lifefin imposes (almost) zero overhead in typical cases while effectively eliminating liveness vulnerabilities.\n  To demonstrate the effectiveness of Lifefin, we integrate it into two state-of-the-art DAG-based BFT protocols, Sailfish and Mysticeti, resulting in two enhanced variants: Sailfish-Lifefin and Mysticeti-Lifefin. We implement these variants and compare them with the original Sailfish and Mysticeti systems. Our evaluation demonstrates that Lifefin achieves comparable transaction throughput while introducing only minimal additional latency to resist similar attacks."}
{"id": "2511.15847", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15847", "abs": "https://arxiv.org/abs/2511.15847", "authors": ["Alexander Bakumenko", "Janine Hoelscher", "Hudson Smith"], "title": "Transparent Early ICU Mortality Prediction with Clinical Transformer and Per-Case Modality Attribution", "comment": null, "summary": "Early identification of intensive care patients at risk of in-hospital mortality enables timely intervention and efficient resource allocation. Despite high predictive performance, existing machine learning approaches lack transparency and robustness, limiting clinical adoption. We present a lightweight, transparent multimodal ensemble that fuses physiological time-series measurements with unstructured clinical notes from the first 48 hours of an ICU stay. A logistic regression model combines predictions from two modality-specific models: a bidirectional LSTM for vitals and a finetuned ClinicalModernBERT transformer for notes. This traceable architecture allows for multilevel interpretability: feature attributions within each modality and direct per-case modality attributions quantifying how vitals and notes influence each decision. On the MIMIC-III benchmark, our late-fusion ensemble improves discrimination over the best single model (AUPRC 0.565 vs. 0.526; AUROC 0.891 vs. 0.876) while maintaining well-calibrated predictions. The system remains robust through a calibrated fallback when a modality is missing. These results demonstrate competitive performance with reliable, auditable risk estimates and transparent, predictable operation, which together are crucial for clinical use."}
{"id": "2511.16413", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16413", "abs": "https://arxiv.org/abs/2511.16413", "authors": ["Anıl Erdinç Türetken", "Hakan Ersoy", "Aslihan Kartci"], "title": "Energy-Efficient and Actuator-Friendly Control Under Wave Disturbances: Model Reference vs. PID for Thruster Surge", "comment": null, "summary": "In this study, we compare a model reference control (MRC) strategy against conventional PID controllers (tuned via metaheuristic algorithms) for surge velocity control of a thruster-driven marine system, under combined wave disturbance and sensor noise. The goal is to evaluate not only tracking performance but also control energy usage and actuator stress. A high-order identified model of a Blue Robotics T200 thruster with a 2~kg vehicle is used, with an 8~N sinusoidal wave disturbance applied and white noise ( added to the speed measurement. Results show that the optimized MRC (MRC-R*) yields the lowest control energy and smoothest command among all controllers, while maintaining acceptable tracking. The IMC-based design performs closely. In contrast, PID controllers achieve comparable RMS tracking error but at the cost of excessive actuator activity and energy use, making them impractical in such scenarios. Future"}
{"id": "2511.16296", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16296", "abs": "https://arxiv.org/abs/2511.16296", "authors": ["Mariem Zayene", "Oussama Habachi", "Gerard Chalhoub"], "title": "Toward hyper-adaptive AI-enabled 6G networks for energy efficiency: techniques, classifications and tradeoffs", "comment": null, "summary": "Energy efficiency is shaping up to be one of the most challenging issues for 6G networks. The reason is fairly straightforward: Networks will need to meet extreme service demands while remaining sustainable and traditional optimization techniques are too limited. With users moving, traffic swinging unpredictably and services pulling in different directions, management has to be adaptive and AI may offer a way forward. This survey looks at how well AI-based methods actually deliver on that promise. We organize the review around practical use cases. For each use case, we examine how AI techniques contribute to feedback-driven adaptability and rapid decision-making under dynamic conditions. We then evaluate them against seven central dynamic aspects that we consider unavoidable in 6G. The survey also discusses crucial tradeoffs between energy efficiency and the remaining 6G main objectives such as latency, reliability, fairness and coverage, and finally identifies gaps and future research directions."}
{"id": "2511.16327", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16327", "abs": "https://arxiv.org/abs/2511.16327", "authors": ["Deqiao Gan", "Xiaoxia Xu", "Xiaohu Ge", "Yuanwei Liu"], "title": "Revealing computation-communication trade-off in Segmented Pinching Antenna System (PASS)", "comment": null, "summary": "A joint communication and computation (JCC) framework using segmented pinching antenna system (PASS) is proposed, where both the communication bit streams and computation data are simultaneously transmitted via uplink communications. The segmented PASS design is used to yield the tractable uplink transmission, and to mitigate large-scale path loss and in-waveguide loss. Based on three operating protocols, namely segment selection (SS), segment aggregation (SA), and segment multiplexing (SM), the joint transmit and receive beamforming problem is formulated: 1) The mean square error (MSE) minimization problem is formulated for computation-oriented cases. To address this problem, a low-complexity alternating optimization-minimum mean square error (AO-MMSE) algorithm is developed. This problem is decomposed into receiver-side and transmitter-side MSE subproblems that are iteratively optimized by MMSE receivers to obtain the closed-form solutions. It is mathematically proved that the segmented JCC-PASS framework significantly outperforms the conventional PASS for the average in-waveguide propagation gain. 2) The weighted sum rate (WSR) maximization problem is formulated for communication-oriented cases. To solve the decomposed receiver-side and transmitter-side MSE subproblems, the AO-weighted minimum mean square error (AO-WMMSE) algorithm is further developed. An auxiliary weight variable is introduced to linearize the WSR function and is alternatively optimized based on WMMSE to derive the closed-form solutions. Simulation results demonstrate that: i) The proposed JCC-PASS framework achieves up to 70.65% and 45.32% reductions in MSE compared with conventional MIMO and conventional PASS, and ii) it reaches 87.70% and 51.35% improvements in WSR compared with conventional MIMO and conventional PASS, respectively."}
{"id": "2511.15990", "categories": ["cs.CR", "cs.CY", "cs.DC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15990", "abs": "https://arxiv.org/abs/2511.15990", "authors": ["Osama Zafar", "Rosemarie Santa González", "Alfonso Morales", "Erman Ayday"], "title": "Digital Agriculture Sandbox for Collaborative Research", "comment": "Presents a privacy-preserving digital agriculture platform using federated learning, differential privacy, and secure data analysis to enable collaboration between farmers and researchers without exposing raw data. Demonstrates secure similarity search, model training, and risk-aware data sharing", "summary": "Digital agriculture is transforming the way we grow food by utilizing technology to make farming more efficient, sustainable, and productive. This modern approach to agriculture generates a wealth of valuable data that could help address global food challenges, but farmers are hesitant to share it due to privacy concerns. This limits the extent to which researchers can learn from this data to inform improvements in farming. This paper presents the Digital Agriculture Sandbox, a secure online platform that solves this problem. The platform enables farmers (with limited technical resources) and researchers to collaborate on analyzing farm data without exposing private information. We employ specialized techniques such as federated learning, differential privacy, and data analysis methods to safeguard the data while maintaining its utility for research purposes. The system enables farmers to identify similar farmers in a simplified manner without needing extensive technical knowledge or access to computational resources. Similarly, it enables researchers to learn from the data and build helpful tools without the sensitive information ever leaving the farmer's system. This creates a safe space where farmers feel comfortable sharing data, allowing researchers to make important discoveries. Our platform helps bridge the gap between maintaining farm data privacy and utilizing that data to address critical food and farming challenges worldwide."}
{"id": "2511.15854", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15854", "abs": "https://arxiv.org/abs/2511.15854", "authors": ["Steven Adams", "Elize Alwash", "Luca Laurenti"], "title": "discretize_distributions: Efficient Quantization of Gaussian Mixtures with Guarantees in Wasserstein Distance", "comment": null, "summary": "We present discretize_distributions, a Python package that efficiently constructs discrete approximations of Gaussian mixture distributions and provides guarantees on the approximation error in Wasserstein distance. The package implements state-of-the-art quantization methods for Gaussian mixture models and extends them to improve scalability. It further integrates complementary quantization strategies such as sigma-point methods and provides a modular interface that supports custom schemes and integration into control and verification pipelines for cyber-physical systems. We benchmark the package on various examples, including high-dimensional, large, and degenerate Gaussian mixtures, and demonstrate that discretize_distributions produces accurate approximations at low computational cost."}
{"id": "2511.16424", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16424", "abs": "https://arxiv.org/abs/2511.16424", "authors": ["Samuel Mallick", "Filippo Airaldi", "Azita Dabiri", "Bart De Schutter"], "title": "Second-Order MPC-Based Distributed Q-Learning", "comment": "6 pages, 2 figures, submitted to IFAC World Congress 2026", "summary": "The state of the art for model predictive control (MPC)-based distributed Q-learning is limited to first-order gradient updates of the MPC parameterization. In general, using secondorder information can significantly improve the speed of convergence for learning, allowing the use of higher learning rates without introducing instability. This work presents a second-order extension to MPC-based Q-learning with updates distributed across local agents, relying only on locally available information and neighbor-to-neighbor communication. In simulation the approach is demonstrated to significantly outperform first-order distributed Q-learning."}
{"id": "2511.16376", "categories": ["cs.NI", "math.PR"], "pdf": "https://arxiv.org/pdf/2511.16376", "abs": "https://arxiv.org/abs/2511.16376", "authors": ["Taki E. M. Abedesselam", "Fabio Giacomelli", "Francesco Pasquale", "Michele Salvi"], "title": "Payment-failure times for random Lightning paths", "comment": "To be published in Proceedings of the 7th Conference on Blockchain Research & Applications for Innovative Networks and Services (BRAINS 2025), IEEE, 2025", "summary": "We study a random process over graphs inspired by the way payments are executed in the Lightning Network, the main layer-two solution on top of Bitcoin. We first prove almost tight upper and lower bounds on the time it takes for a payment failure to occur, as a function of the number of nodes and the edge capacities, when the underlying graph is complete. Then, we show how such a random process is related to the edge-betweenness centrality measure and we prove upper and lower bounds for arbitrary graphs as a function of edge-betweenness and capacity. Finally, we validate our theoretical results by running extensive simulations over some classes of graphs, including snapshots of the real Lightning Network."}
{"id": "2511.16346", "categories": ["eess.SP", "cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16346", "abs": "https://arxiv.org/abs/2511.16346", "authors": ["Deniz Kasap", "Taraneh Aminosharieh Najafi", "Jérôme Paul Rémy Thevenot", "Jonathan Dan", "Stefano Albini", "David Atienza"], "title": "VersaPants: A Loose-Fitting Textile Capacitive Sensing System for Lower-Body Motion Capture", "comment": "14 pages, 8 figures", "summary": "We present VersaPants, the first loose-fitting, textile-based capacitive sensing system for lower-body motion capture, built on the open-hardware VersaSens platform. By integrating conductive textile patches and a compact acquisition unit into a pair of pants, the system reconstructs lower-body pose without compromising comfort. Unlike IMU-based systems that require user-specific fitting or camera-based methods that compromise privacy, our approach operates without fitting adjustments and preserves user privacy. VersaPants is a custom-designed smart garment featuring 6 capacitive channels per leg. We employ a lightweight Transformer-based deep learning model that maps capacitance signals to joint angles, enabling embedded implementation on edge platforms. To test our system, we collected approximately 3.7 hours of motion data from 11 participants performing 16 daily and exercise-based movements. The model achieves a mean per-joint position error (MPJPE) of 11.96 cm and a mean per-joint angle error (MPJAE) of 12.3 degrees across the hip, knee, and ankle joints, indicating the model's ability to generalize to unseen users and movements. A comparative analysis of existing textile-based deep learning architectures reveals that our model achieves competitive reconstruction performance with up to 22 times fewer parameters and 18 times fewer FLOPs, enabling real-time inference at 42 FPS on a commercial smartwatch without quantization. These results position VersaPants as a promising step toward scalable, comfortable, and embedded motion-capture solutions for fitness, healthcare, and wellbeing applications."}
{"id": "2511.15998", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15998", "abs": "https://arxiv.org/abs/2511.15998", "authors": ["Strahinja Janjuesvic", "Anna Baron Garcia", "Sohrob Kazerounian"], "title": "Hiding in the AI Traffic: Abusing MCP for LLM-Powered Agentic Red Teaming", "comment": "23 pages, 9 figures, 3 tables. Submitted as a full paper for review", "summary": "Generative AI is reshaping offensive cybersecurity by enabling autonomous red team agents that can plan, execute, and adapt during penetration tests. However, existing approaches face trade-offs between generality and specialization, and practical deployments reveal challenges such as hallucinations, context limitations, and ethical concerns. In this work, we introduce a novel command & control (C2) architecture leveraging the Model Context Protocol (MCP) to coordinate distributed, adaptive reconnaissance agents covertly across networks. Notably, we find that our architecture not only improves goal-directed behavior of the system as whole, but also eliminates key host and network artifacts that can be used to detect and prevent command & control behavior altogether. We begin with a comprehensive review of state-of-the-art generative red teaming methods, from fine-tuned specialist models to modular or agentic frameworks, analyzing their automation capabilities against task-specific accuracy. We then detail how our MCP-based C2 can overcome current limitations by enabling asynchronous, parallel operations and real-time intelligence sharing without periodic beaconing. We furthermore explore advanced adversarial capabilities of this architecture, its detection-evasion techniques, and address dual-use ethical implications, proposing defensive measures and controlled evaluation in lab settings. Experimental comparisons with traditional C2 show drastic reductions in manual effort and detection footprint. We conclude with future directions for integrating autonomous exploitation, defensive LLM agents, predictive evasive maneuvers, and multi-agent swarms. The proposed MCP-enabled C2 framework demonstrates a significant step toward realistic, AI-driven red team operations that can simulate advanced persistent threats while informing the development of next-generation defensive systems."}
{"id": "2511.15856", "categories": ["cs.LG", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2511.15856", "abs": "https://arxiv.org/abs/2511.15856", "authors": ["Peter Sharpe"], "title": "GLOBE: Accurate and Generalizable PDE Surrogates using Domain-Inspired Architectures and Equivariances", "comment": null, "summary": "We introduce GLOBE, a new neural surrogate for homogeneous PDEs that draws inductive bias from boundary-element methods and equivariant ML. GLOBE represents solutions as superpositions of learnable Green's-function-like kernels evaluated from boundary faces to targets, composed across multiscale branches and communication hyperlayers. The architecture is translation-, rotation-, and parity-equivariant; discretization-invariant in the fine-mesh limit; and units-invariant via rigorous nondimensionalization. An explicit far-field decay envelope stabilizes extrapolation, boundary-to-boundary hyperlayer communication mediates long-range coupling, and the all-to-all boundary-to-target evaluation yields a global receptive field that respects PDE information flow, even for elliptic PDEs.\n  On AirFRANS (steady incompressible RANS over NACA airfoils), GLOBE achieves substantial accuracy improvements. On the \"Full\" split, it reduces mean-squared error by roughly 200x on all fields relative to the dataset's reference baselines, and roughly 50x relative to the next-best-performing model. In the \"Scarce\" split, it achieves over 100x lower error on velocity and pressure fields and over 600x lower error on surface pressure than Transolver. Qualitative results show sharp near-wall gradients, coherent wakes, and limited errors under modest extrapolation in Reynolds number and angle of attack.\n  In addition to this accuracy, the model is quite compact (117k parameters), and fields can be evaluated at arbitrary points during inference. We also demonstrate the ability to train and predict with non-watertight meshes, which has strong practical implications.\n  These results show that rigorous physics- and domain-inspired inductive biases can achieve large gains in accuracy, generalizability, and practicality for ML-based PDE surrogates for industrial computer-aided engineering (CAE)."}
{"id": "2511.16425", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16425", "abs": "https://arxiv.org/abs/2511.16425", "authors": ["Ákos M. Bokor", "Tamás Dózsa", "Felix Biertümpfel", "Ádám Szabó"], "title": "Tube-Based Model Predictive Control with Random Fourier Features for Nonlinear Systems", "comment": "Submitted to IEEE IV 2026, The IEEE Intelligent Vehicles Symposium", "summary": "This paper presents a computationally efficient approach for robust Model Predictive Control of nonlinear systems by combining Random Fourier Features with tube-based MPC. Tube-based Model Predictive Control provides robust constraint satisfaction under bounded model uncertainties arising from approximation errors and external disturbances. The Random Fourier Features method approximates nonlinear system dynamics by solving a numerically tractable least-squares problem, thereby reducing the approximation error. We develop the integration of RFF-based residual learning with tube MPC and demonstrate its application to an autonomous vehicle path-tracking problem using a nonlinear bicycle model. Compared to the linear baseline, the proposed method reduces the tube size by approximately 50%, leading to less conservative behavior and resulting in around 70% smaller errors in the test scenario. Furthermore, the proposed method achieves real-time performance while maintaining provable robustness guarantees."}
{"id": "2511.15982", "categories": ["cs.LG", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15982", "abs": "https://arxiv.org/abs/2511.15982", "authors": ["Chukwunonso Henry Nwokoye", "Blessing Oluchi", "Sharna Waldron", "Peace Ezzeh"], "title": "Machine Learning Epidemic Predictions Using Agent-based Wireless Sensor Network Models", "comment": "8 pages", "summary": "The lack of epidemiological data in wireless sensor networks (WSNs) is a fundamental difficulty in constructing robust models to forecast and mitigate threats such as viruses and worms. Many studies have examined different epidemic models for WSNs, focusing on how malware infections spread given the network's specific properties, including energy limits and node mobility. In this study, an agent-based implementation of the susceptible-exposed-infected-recovered-vaccinated (SEIRV) mathematical model was employed for machine learning (ML) predictions. Using tools such as NetLogo's BehaviorSpace and Python, two epidemic synthetic datasets were generated and prepared for the application of several ML algorithms. Posed as a regression problem, the infected and recovered nodes were predicted, and the performance of these algorithms is compared using the error metrics of the train and test sets. The predictions performed well, with low error metrics and high R^2 values (0.997, 1.000, 0.999, 1.000), indicating an effective fit to the training set. The validation values were lower (0.992, 0.998, 0.971, and 0.999), as is typical when evaluating model performance on unseen data. Based on the recorded performances, support vector, linear, Lasso, Ridge, and ElasticNet regression were among the worst-performing algorithms, while Random Forest, XGBoost, Decision Trees, and k-nearest neighbors achieved the best results."}
{"id": "2511.16352", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.16352", "abs": "https://arxiv.org/abs/2511.16352", "authors": ["Till-Yannic Müller", "Frederik Zumegen", "Reinhard Wiesmayr", "Emre Gönültaş", "Christoph Studer"], "title": "Neural Positioning Without External Reference", "comment": "Submitted to a journal", "summary": "Channel state information (CSI)-based user equipment (UE) positioning with neural networks -- referred to as neural positioning -- is a promising approach for accurate off-device UE localization. Most existing methods train their neural networks with ground-truth position labels obtained from external reference positioning systems, which requires costly hardware and renders label acquisition difficult in large areas. In this work, we propose a novel neural positioning pipeline that avoids the need for any external reference positioning system. Our approach trains the positioning network only using CSI acquired off-device and relative displacement commands executed on commercial off-the-shelf (COTS) robot platforms, such as robotic vacuum cleaners -- such an approach enables inexpensive training of accurate neural positioning functions over large areas. We evaluate our method in three real-world scenarios, ranging from small line-of-sight (LoS) areas to larger non-line-of-sight (NLoS) environments, using CSI measurements acquired in IEEE 802.11 Wi-Fi and 5G New Radio (NR) systems. Our experiments demonstrate that the proposed neural positioning pipeline achieves UE localization accuracies close to state-of-the-art methods that require externally acquired high-precision ground-truth position labels for training."}
{"id": "2511.16034", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.16034", "abs": "https://arxiv.org/abs/2511.16034", "authors": ["Ashwin Poudel", "Utsav Poudel", "Dikshyanta Aryal", "Anuj Nepal", "Pranish Pathak", "Subramaniyaswamy V"], "title": "A Quantum-Secure and Blockchain-Integrated E-Voting Framework with Identity Validation", "comment": null, "summary": "The rapid growth of quantum computing poses a threat to the cryptographic foundations of digital systems, requiring the development of secure and scalable electronic voting (evoting) frameworks. We introduce a post-quantum-secure evoting architecture that integrates Falcon lattice-based digital signatures, biometric authentication via MobileNetV3 and AdaFace, and a permissioned blockchain for tamper-proof vote storage. Voter registration involves capturing facial embeddings, which are digitally signed using Falcon and stored on-chain to ensure integrity and non-repudiation. During voting, real-time biometric verification is performed using anti-spoofing techniques and cosine-similarity matching. The system demonstrates low latency and robust spoof detection, monitored through Prometheus and Grafana for real-time auditing. The average classification error rates (ACER) are below 3.5% on the CelebA Spoof dataset and under 8.2% on the Wild Face Anti-Spoofing (WFAS) dataset. Blockchain anchoring incurs minimal gas overhead, approximately 3.3% for registration and 0.15% for voting, supporting system efficiency, auditability, and transparency. The experimental results confirm the system's scalability, efficiency, and resilience under concurrent loads. This approach offers a unified solution to address key challenges in voter authentication, data integrity, and quantum-resilient security for digital systems."}
{"id": "2511.15898", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15898", "abs": "https://arxiv.org/abs/2511.15898", "authors": ["Rahul Krishna Thomas", "Arka Pal"], "title": "Global Resolution: Optimal Multi-Draft Speculative Sampling via Convex Minimization", "comment": null, "summary": "Speculative sampling reduces the latency of autoregressive decoding for target model LLMs without sacrificing inference quality, by using a cheap draft model to suggest a candidate token and a verification criterion to accept or resample this token. To improve acceptance and decoding efficiency, recent work has explored the multi-draft extension, where at each step $n$ draft tokens are generated, and the verification criterion is a distribution conditioned on these. When this criterion maximizes the probability of accepting some draft token, it is called the optimal transport (OT). However, finding the OT is difficult, as it is the solution of a linear program (OTLP) in over $V^n$ variables, with $V$ being the vocabulary size. Two recent theoretical works have reframed the OTLP in terms of importance sampling or subset selection. In this work, we prove that these formulations are equivalent to an exponentially large relaxed OTLP, so it remains infeasible to solve. Then, we reverse engineer subset selection to formulate the OTLP as a max-flow problem. With a novel application of polymatroid theory, we reduce the exponentially large OTLP to a convex optimization problem in at most $V$ variables. This allows us to devise an algorithm for optimal $n$-draft speculative sampling when the $n$ tokens are chosen i.i.d. from a single draft model, which can be tuned to arbitrary accuracy. Finally, we measure acceptance rates and algorithm runtimes for various $n$ and top-$k$ draft sampling settings. Our findings give the first multi-draft algorithm with 90% acceptance and under 100 ms of overhead per generated token with negligible deviation from the target model distribution."}
{"id": "2511.16469", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16469", "abs": "https://arxiv.org/abs/2511.16469", "authors": ["Weixuan Wang", "Alejandro I. Maass", "Dragan Nešić", "Ying Tan", "Romain Postoyan", "W. P. M. H. Heemels"], "title": "Observer Design for Singularly Perturbed Linear Networked Control Systems Subject to Measurement Noise", "comment": "9 pages, 2 figures, full version of the paper submitted to the IFAC World Congress", "summary": "This paper addresses the emulation-based observer design for linear networked control systems (NCS) operating at two time scales in the presence of measurement noise. The system is formulated as a hybrid singularly perturbed dynamical system, enabling the systematic use of singular perturbation techniques to derive explicit bounds on the maximum allowable transmission intervals (MATI) for both fast and slow communication channels. Under the resulting conditions, the proposed observer guarantees that the estimation error satisfies a global exponential derivative-input-to-state stability (DISS)-like property, where the ultimate bound scales proportionally with the magnitudes of the measurement noise and the time derivative of the control input. The effectiveness of the approach is illustrated through a numerical example."}
{"id": "2511.16369", "categories": ["eess.SP", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16369", "abs": "https://arxiv.org/abs/2511.16369", "authors": ["Jaron Fontaine", "Mohammad Cheraghinia", "John Strassner", "Adnan Shahid", "Eli De Poorter"], "title": "Reasoning Meets Representation: Envisioning Neuro-Symbolic Wireless Foundation Models", "comment": "Accepted at the 39th Conference on Neural Information Processing Systems (NeurIPS 2025) Workshop: AI and ML for Next-Generation Wireless Communications and Networking (AI4NextG)", "summary": "Recent advances in Wireless Physical Layer Foundation Models (WPFMs) promise a new paradigm of universal Radio Frequency (RF) representations. However, these models inherit critical limitations found in deep learning such as the lack of explainability, robustness, adaptability, and verifiable compliance with physical and regulatory constraints. In addition, the vision for an AI-native 6G network demands a level of intelligence that is deeply embedded into the systems and is trustworthy. In this vision paper, we argue that the neuro-symbolic paradigm, which integrates data-driven neural networks with rule- and logic-based symbolic reasoning, is essential for bridging this gap. We envision a novel Neuro-Symbolic framework that integrates universal RF embeddings with symbolic knowledge graphs and differentiable logic layers. This hybrid approach enables models to learn from large datasets while reasoning over explicit domain knowledge, enabling trustworthy, generalizable, and efficient wireless AI that can meet the demands of future networks."}
{"id": "2511.16369", "categories": ["eess.SP", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.16369", "abs": "https://arxiv.org/abs/2511.16369", "authors": ["Jaron Fontaine", "Mohammad Cheraghinia", "John Strassner", "Adnan Shahid", "Eli De Poorter"], "title": "Reasoning Meets Representation: Envisioning Neuro-Symbolic Wireless Foundation Models", "comment": "Accepted at the 39th Conference on Neural Information Processing Systems (NeurIPS 2025) Workshop: AI and ML for Next-Generation Wireless Communications and Networking (AI4NextG)", "summary": "Recent advances in Wireless Physical Layer Foundation Models (WPFMs) promise a new paradigm of universal Radio Frequency (RF) representations. However, these models inherit critical limitations found in deep learning such as the lack of explainability, robustness, adaptability, and verifiable compliance with physical and regulatory constraints. In addition, the vision for an AI-native 6G network demands a level of intelligence that is deeply embedded into the systems and is trustworthy. In this vision paper, we argue that the neuro-symbolic paradigm, which integrates data-driven neural networks with rule- and logic-based symbolic reasoning, is essential for bridging this gap. We envision a novel Neuro-Symbolic framework that integrates universal RF embeddings with symbolic knowledge graphs and differentiable logic layers. This hybrid approach enables models to learn from large datasets while reasoning over explicit domain knowledge, enabling trustworthy, generalizable, and efficient wireless AI that can meet the demands of future networks."}
{"id": "2511.16088", "categories": ["cs.CR", "cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2511.16088", "abs": "https://arxiv.org/abs/2511.16088", "authors": ["Vu Van Than"], "title": "Future-Back Threat Modeling: A Foresight-Driven Security Framework", "comment": null, "summary": "Traditional threat modeling remains reactive-focused on known TTPs and past incident data, while threat prediction and forecasting frameworks are often disconnected from operational or architectural artifacts. This creates a fundamental weakness: the most serious cyber threats often do not arise from what is known, but from what is assumed, overlooked, or not yet conceived, and frequently originate from the future, such as artificial intelligence, information warfare, and supply chain attacks, where adversaries continuously develop new exploits that can bypass defenses built on current knowledge. To address this mental gap, this paper introduces the theory and methodology of Future-Back Threat Modeling (FBTM). This predictive approach begins with envisioned future threat states and works backward to identify assumptions, gaps, blind spots, and vulnerabilities in the current defense architecture, providing a clearer and more accurate view of impending threats so that we can anticipate their emergence and shape the future we want through actions taken now. The proposed methodology further aims to reveal known unknowns and unknown unknowns, including tactics, techniques, and procedures that are emerging, anticipated, and plausible. This enhances the predictability of adversary behavior, particularly under future uncertainty, helping security leaders make informed decisions today that shape more resilient security postures for the future."}
{"id": "2511.15906", "categories": ["cs.LG", "q-bio.BM"], "pdf": "https://arxiv.org/pdf/2511.15906", "abs": "https://arxiv.org/abs/2511.15906", "authors": ["Matthieu Kirchmeyer", "Pedro O. Pinheiro", "Emma Willett", "Karolis Martinkus", "Joseph Kleinhenz", "Emily K. Makowski", "Andrew M. Watkins", "Vladimir Gligorijevic", "Richard Bonneau", "Saeed Saremi"], "title": "Unified all-atom molecule generation with neural fields", "comment": "NeurIPS 2025", "summary": "Generative models for structure-based drug design are often limited to a specific modality, restricting their broader applicability. To address this challenge, we introduce FuncBind, a framework based on computer vision to generate target-conditioned, all-atom molecules across atomic systems. FuncBind uses neural fields to represent molecules as continuous atomic densities and employs score-based generative models with modern architectures adapted from the computer vision literature. This modality-agnostic representation allows a single unified model to be trained on diverse atomic systems, from small to large molecules, and handle variable atom/residue counts, including non-canonical amino acids. FuncBind achieves competitive in silico performance in generating small molecules, macrocyclic peptides, and antibody complementarity-determining region loops, conditioned on target structures. FuncBind also generated in vitro novel antibody binders via de novo redesign of the complementarity-determining region H3 loop of two chosen co-crystal structures. As a final contribution, we introduce a new dataset and benchmark for structure-conditioned macrocyclic peptide generation. The code is available at https://github.com/prescient-design/funcbind."}
{"id": "2511.15812", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15812", "abs": "https://arxiv.org/abs/2511.15812", "authors": ["Luke Dosiek", "Akaash Karn", "Frank Liu"], "title": "Rapid and Accurate Changepoint Detection of Power System Forced Oscillations", "comment": "Currently under review for the proceedings of the 2026 IEEE Power and Energy Society General Meeting (PESGM26)", "summary": "This paper describes a new approach for using changepoint detection (CPD) to estimate the starting and stopping times of a forced oscillation (FO) in measured power system data. As with a previous application of CPD to this problem, the pruned exact linear time (PELT) algorithm is used. However, instead of allowing PELT to automatically tune its penalty parameter, a method of manually providing it is presented that dramatically reduces computation time without sacrificing accuracy. Additionally, the new algorithm requires fewer input parameters and provides a formal, data-driven approach to setting the minimum FO segment length to consider as troublesome for an electromechanical mode meter. A low-order ARMAX representation of the minniWECC model is used to test the approach, where a 98\\% reduction in computation time is enjoyed with high estimation accuracy."}
{"id": "2511.16472", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16472", "abs": "https://arxiv.org/abs/2511.16472", "authors": ["Niko Lindvall", "Mikko Heino", "Mikko Valkama"], "title": "3-20 GHz Wideband Tightly-Coupled Dual-Polarized Vivaldi Antenna Array", "comment": null, "summary": "Very wideband apertures are needed in positioning, sensing, spectrum monitoring, and modern spread spectrum, e.g., frequency hopping systems. Vivaldi antennas are one of the prominent choices for the aforementioned systems due to their natural wideband characteristics. Furthermore, tightly-coupled antenna arrays have been researched in the recent years to extend the lower band edge of compact arrays by taking advantage of the strong mutual coupling between the elements especially with dipole elements, but not with dual-polarized Vivaldi antennas. This paper presents a novel tightly-coupled dual-polarized antipodal Vivaldi antenna (TC-AVA) with -6 dB impedance bandwidth of 3 to 20 GHz. The tight coupling by overlapping the Vivaldi leaves is shown to extend the lower band edge from 3.75 to 3 GHz and 2.75 GHz, an improvement of 20% to 25% for both polarizations, compared with an isolated antipodal Vivaldi element."}
{"id": "2511.16110", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.16110", "abs": "https://arxiv.org/abs/2511.16110", "authors": ["Yijun Yang", "Lichao Wang", "Jianping Zhang", "Chi Harold Liu", "Lanqing Hong", "Qiang Xu"], "title": "Multi-Faceted Attack: Exposing Cross-Model Vulnerabilities in Defense-Equipped Vision-Language Models", "comment": "AAAI 2026 Oral", "summary": "The growing misuse of Vision-Language Models (VLMs) has led providers to deploy multiple safeguards, including alignment tuning, system prompts, and content moderation. However, the real-world robustness of these defenses against adversarial attacks remains underexplored. We introduce Multi-Faceted Attack (MFA), a framework that systematically exposes general safety vulnerabilities in leading defense-equipped VLMs such as GPT-4o, Gemini-Pro, and Llama-4. The core component of MFA is the Attention-Transfer Attack (ATA), which hides harmful instructions inside a meta task with competing objectives. We provide a theoretical perspective based on reward hacking to explain why this attack succeeds. To improve cross-model transferability, we further introduce a lightweight transfer-enhancement algorithm combined with a simple repetition strategy that jointly bypasses both input-level and output-level filters without model-specific fine-tuning. Empirically, we show that adversarial images optimized for one vision encoder transfer broadly to unseen VLMs, indicating that shared visual representations create a cross-model safety vulnerability. Overall, MFA achieves a 58.5% success rate and consistently outperforms existing methods. On state-of-the-art commercial models, MFA reaches a 52.8% success rate, surpassing the second-best attack by 34%. These results challenge the perceived robustness of current defense mechanisms and highlight persistent safety weaknesses in modern VLMs. Code: https://github.com/cure-lab/MultiFacetedAttack"}
{"id": "2511.15915", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.15915", "abs": "https://arxiv.org/abs/2511.15915", "authors": ["Genghan Zhang", "Shaowei Zhu", "Anjiang Wei", "Zhenyu Song", "Allen Nie", "Zhen Jia", "Nandita Vijaykumar", "Yida Wang", "Kunle Olukotun"], "title": "AccelOpt: A Self-Improving LLM Agentic System for AI Accelerator Kernel Optimization", "comment": null, "summary": "We present AccelOpt, a self-improving large language model (LLM) agentic system that autonomously optimizes kernels for emerging AI acclerators, eliminating the need for expert-provided hardware-specific optimization knowledge. AccelOpt explores the kernel optimization space through iterative generation, informed by an optimization memory that curates experiences and insights from previously encountered slow-fast kernel pairs. We build NKIBench, a new benchmark suite of AWS Trainium accelerator kernels with varying complexity extracted from real-world LLM workloads to evaluate the effectiveness of AccelOpt. Our evaluation confirms that AccelOpt's capability improves over time, boosting the average percentage of peak throughput from $49\\%$ to $61\\%$ on Trainium 1 and from $45\\%$ to $59\\%$ on Trainium 2 for NKIBench kernels. Moreover, AccelOpt is highly cost-effective: using open-source models, it matches the kernel improvements of Claude Sonnet 4 while being $26\\times$ cheaper."}
{"id": "2511.16297", "categories": ["cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16297", "abs": "https://arxiv.org/abs/2511.16297", "authors": ["Dean Brandner", "Sergio Lucia"], "title": "Optimizing Operation Recipes with Reinforcement Learning for Safe and Interpretable Control of Chemical Processes", "comment": "16 pages, 3 figures, Part of the workshop 'Machine Learning for Chemistry and Chemical Engineering (ML4CCE)' at the ECML24 conference: Link: https://ml4cce-ecml.com/", "summary": "Optimal operation of chemical processes is vital for energy, resource, and cost savings in chemical engineering. The problem of optimal operation can be tackled with reinforcement learning, but traditional reinforcement learning methods face challenges due to hard constraints related to quality and safety that must be strictly satisfied, and the large amount of required training data. Chemical processes often cannot provide sufficient experimental data, and while detailed dynamic models can be an alternative, their complexity makes it computationally intractable to generate the needed data. Optimal control methods, such as model predictive control, also struggle with the complexity of the underlying dynamic models. Consequently, many chemical processes rely on manually defined operation recipes combined with simple linear controllers, leading to suboptimal performance and limited flexibility.\n  In this work, we propose a novel approach that leverages expert knowledge embedded in operation recipes. By using reinforcement learning to optimize the parameters of these recipes and their underlying linear controllers, we achieve an optimized operation recipe. This method requires significantly less data, handles constraints more effectively, and is more interpretable than traditional reinforcement learning methods due to the structured nature of the recipes. We demonstrate the potential of our approach through simulation results of an industrial batch polymerization reactor, showing that it can approach the performance of optimal controllers while addressing the limitations of existing methods."}
{"id": "2511.16627", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16627", "abs": "https://arxiv.org/abs/2511.16627", "authors": ["Pengxin Li", "Yimin Zhou", "Jie Min", "Yirong Wang", "Wei Liang", "Wang Li"], "title": "TFCDiff: Robust ECG Denoising via Time-Frequency Complementary Diffusion", "comment": null, "summary": "Ambulatory electrocardiogram (ECG) readings are prone to mixed noise from physical activities, including baseline wander (BW), muscle artifact (MA), and electrode motion artifact (EM). Developing a method to remove such complex noise and reconstruct high-fidelity signals is clinically valuable for diagnostic accuracy. However, denoising of multi-beat ECG segments remains understudied and poses technical challenges. To address this, we propose Time-Frequency Complementary Diffusion (TFCDiff), a novel approach that operates in the Discrete Cosine Transform (DCT) domain and uses the DCT coefficients of noisy signals as conditioning input. To refine waveform details, we incorporate Temporal Feature Enhancement Mechanism (TFEM) to reinforce temporal representations and preserve key physiological information. Comparative experiments on a synthesized dataset demonstrate that TFCDiff achieves state-of-the-art performance across five evaluation metrics. Furthermore, TFCDiff shows superior generalization on the unseen SimEMG Database, outperforming all benchmark models. Notably, TFCDiff processes raw 10-second sequences and maintains robustness under flexible random mixed noise (fRMN), enabling plug-and-play deployment in wearable ECG monitors for high-motion scenarios. Source code is available at https://github.com/Miroircivil/TFCDiff."}
{"id": "2511.16192", "categories": ["cs.CR", "cs.ET", "cs.LG", "cs.SI"], "pdf": "https://arxiv.org/pdf/2511.16192", "abs": "https://arxiv.org/abs/2511.16192", "authors": ["Andrea Venturi", "Imanol Jerico-Yoldi", "Francesco Zola", "Raul Orduna"], "title": "ART: A Graph-based Framework for Investigating Illicit Activity in Monero via Address-Ring-Transaction Structures", "comment": "Paper accepted @ BLOCKCHAIN & CRYPTOCURRENCY CONFERENCE (B2C'2025)", "summary": "As Law Enforcement Agencies advance in cryptocurrency forensics, criminal actors aiming to conceal illicit fund movements increasingly turn to \"mixin\" services or privacy-based cryptocurrencies. Monero stands out as a leading choice due to its strong privacy preserving and untraceability properties, making conventional blockchain analysis ineffective. Understanding the behavior and operational patterns of criminal actors within Monero is therefore challenging and it is essential to support future investigative strategies and disrupt illicit activities. In this work, we propose a case study in which we leverage a novel graph-based methodology to extract structural and temporal patterns from Monero transactions linked to already discovered criminal activities. By building Address-Ring-Transaction graphs from flagged transactions, we extract structural and temporal features and use them to train Machine Learning models capable of detecting similar behavioral patterns that could highlight criminal modus operandi. This represents a first partial step toward developing analytical tools that support investigative efforts in privacy-preserving blockchain ecosystems"}
{"id": "2511.15927", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15927", "abs": "https://arxiv.org/abs/2511.15927", "authors": ["Vaibhav Singh", "Oleksiy Ostapenko", "Pierre-André Noël", "Torsten Scholak"], "title": "Breaking the Bottleneck with DiffuApriel: High-Throughput Diffusion LMs with Mamba Backbone", "comment": "9 pages, 4 figures", "summary": "Diffusion-based language models have recently emerged as a promising alternative to autoregressive generation, yet their reliance on Transformer backbones limits inference efficiency due to quadratic attention and KV-cache overhead. In this work, we introduce DiffuApriel, a masked diffusion language model built on a bidirectional Mamba backbone that combines the diffusion objective with linear-time sequence modeling. DiffuApriel matches the performance of Transformer-based diffusion models while achieving up to 4.4x higher inference throughput for long sequences with a 1.3B model. We further propose DiffuApriel-H, a hybrid variant that interleaves attention and mamba layers, offering up to 2.6x throughput improvement with balanced global and local context modeling. Our results demonstrate that bidirectional state-space architectures serve as strong denoisers in masked diffusion LMs, providing a practical and scalable foundation for faster, memory-efficient text generation."}
{"id": "2511.16346", "categories": ["eess.SP", "cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16346", "abs": "https://arxiv.org/abs/2511.16346", "authors": ["Deniz Kasap", "Taraneh Aminosharieh Najafi", "Jérôme Paul Rémy Thevenot", "Jonathan Dan", "Stefano Albini", "David Atienza"], "title": "VersaPants: A Loose-Fitting Textile Capacitive Sensing System for Lower-Body Motion Capture", "comment": "14 pages, 8 figures", "summary": "We present VersaPants, the first loose-fitting, textile-based capacitive sensing system for lower-body motion capture, built on the open-hardware VersaSens platform. By integrating conductive textile patches and a compact acquisition unit into a pair of pants, the system reconstructs lower-body pose without compromising comfort. Unlike IMU-based systems that require user-specific fitting or camera-based methods that compromise privacy, our approach operates without fitting adjustments and preserves user privacy. VersaPants is a custom-designed smart garment featuring 6 capacitive channels per leg. We employ a lightweight Transformer-based deep learning model that maps capacitance signals to joint angles, enabling embedded implementation on edge platforms. To test our system, we collected approximately 3.7 hours of motion data from 11 participants performing 16 daily and exercise-based movements. The model achieves a mean per-joint position error (MPJPE) of 11.96 cm and a mean per-joint angle error (MPJAE) of 12.3 degrees across the hip, knee, and ankle joints, indicating the model's ability to generalize to unseen users and movements. A comparative analysis of existing textile-based deep learning architectures reveals that our model achieves competitive reconstruction performance with up to 22 times fewer parameters and 18 times fewer FLOPs, enabling real-time inference at 42 FPS on a commercial smartwatch without quantization. These results position VersaPants as a promising step toward scalable, comfortable, and embedded motion-capture solutions for fitness, healthcare, and wellbeing applications."}
{"id": "2511.15838", "categories": ["cs.LG", "cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15838", "abs": "https://arxiv.org/abs/2511.15838", "authors": ["Meiyi Zhu", "Caili Guo", "Chunyan Feng", "Osvaldo Simeone"], "title": "Attention-Based Feature Online Conformal Prediction for Time Series", "comment": "25 pages, 24 figures", "summary": "Online conformal prediction (OCP) wraps around any pre-trained predictor to produce prediction sets with coverage guarantees that hold irrespective of temporal dependencies or distribution shifts. However, standard OCP faces two key limitations: it operates in the output space using simple nonconformity (NC) scores, and it treats all historical observations uniformly when estimating quantiles. This paper introduces attention-based feature OCP (AFOCP), which addresses both limitations through two key innovations. First, AFOCP operates in the feature space of pre-trained neural networks, leveraging learned representations to construct more compact prediction sets by concentrating on task-relevant information while suppressing nuisance variation. Second, AFOCP incorporates an attention mechanism that adaptively weights historical observations based on their relevance to the current test point, effectively handling non-stationarity and distribution shifts. We provide theoretical guarantees showing that AFOCP maintains long-term coverage while provably achieving smaller prediction intervals than standard OCP under mild regularity conditions. Extensive experiments on synthetic and real-world time series datasets demonstrate that AFOCP consistently reduces the size of prediction intervals by as much as $88\\%$ as compared to OCP, while maintaining target coverage levels, validating the benefits of both feature-space calibration and attention-based adaptive weighting."}
{"id": "2511.16209", "categories": ["cs.CR", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.16209", "abs": "https://arxiv.org/abs/2511.16209", "authors": ["Huseein Jawad", "Nicolas Brunel"], "title": "PSM: Prompt Sensitivity Minimization via LLM-Guided Black-Box Optimization", "comment": null, "summary": "System prompts are critical for guiding the behavior of Large Language Models (LLMs), yet they often contain proprietary logic or sensitive information, making them a prime target for extraction attacks. Adversarial queries can successfully elicit these hidden instructions, posing significant security and privacy risks. Existing defense mechanisms frequently rely on heuristics, incur substantial computational overhead, or are inapplicable to models accessed via black-box APIs. This paper introduces a novel framework for hardening system prompts through shield appending, a lightweight approach that adds a protective textual layer to the original prompt. Our core contribution is the formalization of prompt hardening as a utility-constrained optimization problem. We leverage an LLM-as-optimizer to search the space of possible SHIELDs, seeking to minimize a leakage metric derived from a suite of adversarial attacks, while simultaneously preserving task utility above a specified threshold, measured by semantic fidelity to baseline outputs. This black-box, optimization-driven methodology is lightweight and practical, requiring only API access to the target and optimizer LLMs. We demonstrate empirically that our optimized SHIELDs significantly reduce prompt leakage against a comprehensive set of extraction attacks, outperforming established baseline defenses without compromising the model's intended functionality. Our work presents a paradigm for developing robust, utility-aware defenses in the escalating landscape of LLM security. The code is made public on the following link: https://github.com/psm-defense/psm"}
{"id": "2511.15941", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15941", "abs": "https://arxiv.org/abs/2511.15941", "authors": ["David Bonet", "Marçal Comajoan Cara", "Alvaro Calafell", "Daniel Mas Montserrat", "Alexander G. Ioannidis"], "title": "iLTM: Integrated Large Tabular Model", "comment": null, "summary": "Tabular data underpins decisions across science, industry, and public services. Despite rapid progress, advances in deep learning have not fully carried over to the tabular domain, where gradient-boosted decision trees (GBDTs) remain a default choice in practice. We present iLTM, an integrated Large Tabular Model that unifies tree-derived embeddings, dimensionality-agnostic representations, a meta-trained hypernetwork, multilayer perceptrons (MLPs), and retrieval within a single architecture. Pretrained on more than 1,800 heterogeneous classification datasets, iLTM achieves consistently superior performance across tabular classification and regression tasks, from small datasets to large and high-dimensional tasks. After light fine-tuning, the meta-trained hypernetwork transfers to regression targets, matching or surpassing strong baselines. Extensive experiments show that iLTM outperforms well-tuned GBDTs and leading deep tabular models while requiring less task-specific tuning. By bridging the gap between tree-based and neural methods, iLTM offers a new framework for tabular foundation models for robust, adaptable, and scalable tabular learning."}
{"id": "2511.16560", "categories": ["cs.CR", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16560", "abs": "https://arxiv.org/abs/2511.16560", "authors": ["Tirthankar Sengupta", "Bishakh Chandra Ghosh", "Sandip Chakraborty", "Shamik Sural"], "title": "Auditable Ledger Snapshot for Non-Repudiable Cross-Blockchain Communication", "comment": null, "summary": "Blockchain interoperability is increasingly recognized as the centerpiece for robust interactions among decentralized services. Blockchain ledgers are generally tamper-proof and thus enforce non-repudiation for transactions recorded within the same network. However, such a guarantee does not hold for cross-blockchain transactions. When disruptions occur due to malicious activities or system failures within one blockchain network, foreign networks can take advantage by denying legitimate claims or mounting fraudulent liabilities against the defenseless network. In response, this paper introduces InterSnap, a novel blockchain snapshot archival methodology, for enabling auditability of crossblockchain transactions, enforcing non-repudiation. InterSnap introduces cross-chain transaction receipts that ensure their irrefutability. Snapshots of ledger data along with these receipts are utilized as non-repudiable proof of bilateral agreements among different networks. InterSnap enhances system resilience through a distributed snapshot generation process, need-based snapshot scheduling process, and archival storage and sharing via decentralized platforms. Through a prototype implementation based on Hyperledger Fabric, we conducted experiments using on-premise machines, AWS public cloud instances, as well as a private cloud infrastructure. We establish that InterSnap can recover from malicious attacks while preserving crosschain transaction receipts. Additionally, our proposed solution demonstrates adaptability to increasing loads while securely transferring snapshot archives with minimal overhead."}
{"id": "2511.16081", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16081", "abs": "https://arxiv.org/abs/2511.16081", "authors": ["Huseyin Goksu"], "title": "L-JacobiNet and S-JacobiNet: An Analysis of Adaptive Generalization, Stabilization, and Spectral Domain Trade-offs in GNNs", "comment": null, "summary": "Spectral GNNs, like ChebyNet, are limited by heterophily and over-smoothing due to their static, low-pass filter design. This work investigates the \"Adaptive Orthogonal Polynomial Filter\" (AOPF) class as a solution. We introduce two models operating in the [-1, 1] domain: 1) `L-JacobiNet`, the adaptive generalization of `ChebyNet` with learnable alpha, beta shape parameters, and 2) `S-JacobiNet`, a novel baseline representing a LayerNorm-stabilized static `ChebyNet`. Our analysis, comparing these models against AOPFs in the [0, infty) domain (e.g., `LaguerreNet`), reveals critical, previously unknown trade-offs. We find that the [0, infty) domain is superior for modeling heterophily, while the [-1, 1] domain (Jacobi) provides superior numerical stability at high K (K>20). Most significantly, we discover that `ChebyNet`'s main flaw is stabilization, not its static nature. Our static `S-JacobiNet` (ChebyNet+LayerNorm) outperforms the adaptive `L-JacobiNet` on 4 out of 5 benchmark datasets, identifying `S-JacobiNet` as a powerful, overlooked baseline and suggesting that adaptation in the [-1, 1] domain can lead to overfitting."}
{"id": "2511.16229", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16229", "abs": "https://arxiv.org/abs/2511.16229", "authors": ["Wei Zhao", "Zhe Li", "Yige Li", "Jun Sun"], "title": "Q-MLLM: Vector Quantization for Robust Multimodal Large Language Model Security", "comment": "Accepted by NDSS 2026", "summary": "Multimodal Large Language Models (MLLMs) have demonstrated impressive capabilities in cross-modal understanding, but remain vulnerable to adversarial attacks through visual inputs despite robust textual safety mechanisms. These vulnerabilities arise from two core weaknesses: the continuous nature of visual representations, which allows for gradient-based attacks, and the inadequate transfer of text-based safety mechanisms to visual content. We introduce Q-MLLM, a novel architecture that integrates two-level vector quantization to create a discrete bottleneck against adversarial attacks while preserving multimodal reasoning capabilities. By discretizing visual representations at both pixel-patch and semantic levels, Q-MLLM blocks attack pathways and bridges the cross-modal safety alignment gap. Our two-stage training methodology ensures robust learning while maintaining model utility. Experiments demonstrate that Q-MLLM achieves significantly better defense success rate against both jailbreak attacks and toxic image attacks than existing approaches. Notably, Q-MLLM achieves perfect defense success rate (100\\%) against jailbreak attacks except in one arguable case, while maintaining competitive performance on multiple utility benchmarks with minimal inference overhead. This work establishes vector quantization as an effective defense mechanism for secure multimodal AI systems without requiring expensive safety-specific fine-tuning or detection overhead. Code is available at https://github.com/Amadeuszhao/QMLLM."}
{"id": "2511.15965", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15965", "abs": "https://arxiv.org/abs/2511.15965", "authors": ["Luning Sun", "José L. Safanelli", "Jonathan Sanderman", "Katerina Georgiou", "Colby Brungard", "Kanchan Grover", "Bryan G. Hopkins", "Shusen Liu", "Timo Bremer"], "title": "Self-supervised and Multi-fidelity Learning for Extended Predictive Soil Spectroscopy", "comment": "49 pages, 9 figures, submitted to Geoderma", "summary": "We propose a self-supervised machine learning (SSML) framework for multi-fidelity learning and extended predictive soil spectroscopy based on latent space embeddings. A self-supervised representation was pretrained with the large MIR spectral library and the Variational Autoencoder algorithm to obtain a compressed latent space for generating spectral embeddings. At this stage, only unlabeled spectral data were used, allowing us to leverage the full spectral database and the availability of scan repeats for augmented training. We also leveraged and froze the trained MIR decoder for a spectrum conversion task by plugging it into a NIR encoder to learn the mapping between NIR and MIR spectra in an attempt to leverage the predictive capabilities contained in the large MIR library with a low cost portable NIR scanner. This was achieved by using a smaller subset of the KSSL library with paired NIR and MIR spectra. Downstream machine learning models were then trained to map between original spectra, predicted spectra, and latent space embeddings for nine soil properties. The performance of was evaluated independently of the KSSL training data using a gold-standard test set, along with regression goodness-of-fit metrics. Compared to baseline models, the proposed SSML and its embeddings yielded similar or better accuracy in all soil properties prediction tasks. Predictions derived from the spectrum conversion (NIR to MIR) task did not match the performance of the original MIR spectra but were similar or superior to predictive performance of NIR-only models, suggesting the unified spectral latent space can effectively leverage the larger and more diverse MIR dataset for prediction of soil properties not well represented in current NIR libraries."}
{"id": "2511.16629", "categories": ["cs.LG", "cs.AI", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16629", "abs": "https://arxiv.org/abs/2511.16629", "authors": ["Shihab Ahmed", "El Houcine Bergou", "Aritra Dutta", "Yue Wang"], "title": "Stabilizing Policy Gradient Methods via Reward Profiling", "comment": null, "summary": "Policy gradient methods, which have been extensively studied in the last decade, offer an effective and efficient framework for reinforcement learning problems. However, their performances can often be unsatisfactory, suffering from unreliable reward improvements and slow convergence, due to high variance in gradient estimations. In this paper, we propose a universal reward profiling framework that can be seamlessly integrated with any policy gradient algorithm, where we selectively update the policy based on high-confidence performance estimations. We theoretically justify that our technique will not slow down the convergence of the baseline policy gradient methods, but with high probability, will result in stable and monotonic improvements of their performance. Empirically, on eight continuous-control benchmarks (Box2D and MuJoCo/PyBullet), our profiling yields up to 1.5x faster convergence to near-optimal returns, up to 1.75x reduction in return variance on some setups. Our profiling approach offers a general, theoretically grounded path to more reliable and efficient policy learning in complex environments."}
{"id": "2511.16101", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16101", "abs": "https://arxiv.org/abs/2511.16101", "authors": ["Huseyin Goksu"], "title": "HybSpecNet: A Critical Analysis of Architectural Instability in Hybrid-Domain Spectral GNNs", "comment": null, "summary": "Spectral Graph Neural Networks offer a principled approach to graph filtering but face a fundamental \"Stability-vs-Adaptivity\" trade-off. This trade-off is dictated by the choice of spectral domain. Filters in the finite [-1, 1] domain (e.g., ChebyNet) are numerically stable at high polynomial degrees (K) but are static and low-pass, causing them to fail on heterophilic graphs. Conversely, filters in the semi-infinite [0, infty) domain (e.g., KrawtchoukNet) are highly adaptive and achieve SOTA results on heterophily by learning non-low-pass responses. However, as we demonstrate, these adaptive filters can also suffer from numerical instability, leading to catastrophic performance collapse at high K. In this paper, we propose to resolve this trade-off by designing a hybrid-domain GNN, HybSpecNet, which combines a stable `ChebyNet` branch with an adaptive `KrawtchoukNet` branch. We first demonstrate that a \"naive\" hybrid architecture, which fuses the branches via concatenation, successfully unifies performance at low K, achieving strong results on both homophilic and heterophilic benchmarks. However, we then prove that this naive architecture fails the stability test. Our K-ablation experiments show that this architecture catastrophically collapses at K=25, exactly mirroring the collapse of its unstable `KrawtchoukNet` branch. We identify this critical finding as \"Instability Poisoning,\" where `NaN`/`Inf` gradients from the adaptive branch destroy the training of the model. Finally, we propose and validate an advanced architecture that uses \"Late Fusion\" to completely isolate the gradient pathways. We demonstrate that this successfully solves the instability problem, remaining perfectly stable up to K=30 while retaining its SOTA performance across all graph types. This work identifies a critical architectural pitfall in hybrid GNN design and provides the robust architectural solution."}
{"id": "2511.16278", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16278", "abs": "https://arxiv.org/abs/2511.16278", "authors": ["Zhen Sun", "Zongmin Zhang", "Deqi Liang", "Han Sun", "Yule Liu", "Yun Shen", "Xiangshan Gao", "Yilong Yang", "Shuai Liu", "Yutao Yue", "Xinlei He"], "title": "\"To Survive, I Must Defect\": Jailbreaking LLMs via the Game-Theory Scenarios", "comment": "20 pages", "summary": "As LLMs become more common, non-expert users can pose risks, prompting extensive research into jailbreak attacks. However, most existing black-box jailbreak attacks rely on hand-crafted heuristics or narrow search spaces, which limit scalability. Compared with prior attacks, we propose Game-Theory Attack (GTA), an scalable black-box jailbreak framework. Concretely, we formalize the attacker's interaction against safety-aligned LLMs as a finite-horizon, early-stoppable sequential stochastic game, and reparameterize the LLM's randomized outputs via quantal response. Building on this, we introduce a behavioral conjecture \"template-over-safety flip\": by reshaping the LLM's effective objective through game-theoretic scenarios, the originally safety preference may become maximizing scenario payoffs within the template, which weakens safety constraints in specific contexts. We validate this mechanism with classical game such as the disclosure variant of the Prisoner's Dilemma, and we further introduce an Attacker Agent that adaptively escalates pressure to increase the ASR. Experiments across multiple protocols and datasets show that GTA achieves over 95% ASR on LLMs such as Deepseek-R1, while maintaining efficiency. Ablations over components, decoding, multilingual settings, and the Agent's core model confirm effectiveness and generalization. Moreover, scenario scaling studies further establish scalability. GTA also attains high ASR on other game-theoretic scenarios, and one-shot LLM-generated variants that keep the model mechanism fixed while varying background achieve comparable ASR. Paired with a Harmful-Words Detection Agent that performs word-level insertions, GTA maintains high ASR while lowering detection under prompt-guard models. Beyond benchmarks, GTA jailbreaks real-world LLM applications and reports a longitudinal safety monitoring of popular HuggingFace LLMs."}
{"id": "2511.15982", "categories": ["cs.LG", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15982", "abs": "https://arxiv.org/abs/2511.15982", "authors": ["Chukwunonso Henry Nwokoye", "Blessing Oluchi", "Sharna Waldron", "Peace Ezzeh"], "title": "Machine Learning Epidemic Predictions Using Agent-based Wireless Sensor Network Models", "comment": "8 pages", "summary": "The lack of epidemiological data in wireless sensor networks (WSNs) is a fundamental difficulty in constructing robust models to forecast and mitigate threats such as viruses and worms. Many studies have examined different epidemic models for WSNs, focusing on how malware infections spread given the network's specific properties, including energy limits and node mobility. In this study, an agent-based implementation of the susceptible-exposed-infected-recovered-vaccinated (SEIRV) mathematical model was employed for machine learning (ML) predictions. Using tools such as NetLogo's BehaviorSpace and Python, two epidemic synthetic datasets were generated and prepared for the application of several ML algorithms. Posed as a regression problem, the infected and recovered nodes were predicted, and the performance of these algorithms is compared using the error metrics of the train and test sets. The predictions performed well, with low error metrics and high R^2 values (0.997, 1.000, 0.999, 1.000), indicating an effective fit to the training set. The validation values were lower (0.992, 0.998, 0.971, and 0.999), as is typical when evaluating model performance on unseen data. Based on the recorded performances, support vector, linear, Lasso, Ridge, and ElasticNet regression were among the worst-performing algorithms, while Random Forest, XGBoost, Decision Trees, and k-nearest neighbors achieved the best results."}
{"id": "2511.16316", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.16316", "abs": "https://arxiv.org/abs/2511.16316", "authors": ["Musa Furkan Keskin", "Muralikrishnan Srinivasan", "Onur Gunlu", "Hui Chen", "Panagiotis Papadimitratos", "Magnus Almgren", "Zhongxia Simon He", "Henk Wymeersch"], "title": "Multi-Domain Security for 6G ISAC: Challenges and Opportunities in Transportation", "comment": null, "summary": "Integrated sensing and communication (ISAC) will be central to 6G-enabled transportation, providing both seamless connectivity and high-precision sensing. However, this tight integration exposes attack points not encountered in pure sensing and communication systems. In this article, we identify unique ISAC-induced security challenges and opportunities in three interrelated domains: cyber-physical (where manipulation of sensors and actuators can mislead perception and control), physical-layer (where over-the-air signals are vulnerable to spoofing and jamming) and protocol (where complex cryptographic protocols cannot detect lower-layer attacks). Building on these insights, we put forward a multi-domain security vision for 6G transportation and propose an integrated security framework that unifies protection across domains."}
{"id": "2511.15983", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15983", "abs": "https://arxiv.org/abs/2511.15983", "authors": ["Siqiao Mu", "Diego Klabjan"], "title": "Descend or Rewind? Stochastic Gradient Descent Unlearning", "comment": null, "summary": "Machine unlearning algorithms aim to remove the impact of selected training data from a model without the computational expenses of retraining from scratch. Two such algorithms are ``Descent-to-Delete\" (D2D) and ``Rewind-to-Delete\" (R2D), full-batch gradient descent algorithms that are easy to implement and satisfy provable unlearning guarantees. In particular, the stochastic version of D2D is widely implemented as the ``finetuning\" unlearning baseline, despite lacking theoretical backing on nonconvex functions. In this work, we prove $(ε, δ)$ certified unlearning guarantees for stochastic R2D and D2D for strongly convex, convex, and nonconvex loss functions, by analyzing unlearning through the lens of disturbed or biased gradient systems, which may be contracting, semi-contracting, or expansive respectively. Our argument relies on optimally coupling the random behavior of the unlearning and retraining trajectories, resulting in a probabilistic sensitivity bound that can be combined with a novel relaxed Gaussian mechanism to achieve $(ε, δ)$ unlearning. We determine that D2D can yield tighter guarantees for strongly convex functions compared to R2D by relying on contraction to a unique global minimum. However, unlike D2D, R2D can achieve unlearning in the convex and nonconvex setting because it draws the unlearned model closer to the retrained model by reversing the accumulated disturbances."}
{"id": "2511.16347", "categories": ["cs.CR", "cs.CY", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.16347", "abs": "https://arxiv.org/abs/2511.16347", "authors": ["Chunyang Li", "Zifeng Kang", "Junwei Zhang", "Zhuo Ma", "Anda Cheng", "Xinghua Li", "Jianfeng Ma"], "title": "The Shawshank Redemption of Embodied AI: Understanding and Benchmarking Indirect Environmental Jailbreaks", "comment": null, "summary": "The adoption of Vision-Language Models (VLMs) in embodied AI agents, while being effective, brings safety concerns such as jailbreaking. Prior work have explored the possibility of directly jailbreaking the embodied agents through elaborated multi-modal prompts. However, no prior work has studied or even reported indirect jailbreaks in embodied AI, where a black-box attacker induces a jailbreak without issuing direct prompts to the embodied agent. In this paper, we propose, for the first time, indirect environmental jailbreak (IEJ), a novel attack to jailbreak embodied AI via indirect prompt injected into the environment, such as malicious instructions written on a wall. Our key insight is that embodied AI does not ''think twice'' about the instructions provided by the environment -- a blind trust that attackers can exploit to jailbreak the embodied agent. We further design and implement open-source prototypes of two fully-automated frameworks: SHAWSHANK, the first automatic attack generation framework for the proposed attack IEJ; and SHAWSHANK-FORGE, the first automatic benchmark generation framework for IEJ. Then, using SHAWSHANK-FORGE, we automatically construct SHAWSHANK-BENCH, the first benchmark for indirectly jailbreaking embodied agents. Together, our two frameworks and one benchmark answer the questions of what content can be used for malicious IEJ instructions, where they should be placed, and how IEJ can be systematically evaluated. Evaluation results show that SHAWSHANK outperforms eleven existing methods across 3,957 task-scene combinations and compromises all six tested VLMs. Furthermore, current defenses only partially mitigate our attack, and we have responsibly disclosed our findings to all affected VLM vendors."}
{"id": "2511.16006", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16006", "abs": "https://arxiv.org/abs/2511.16006", "authors": ["Yiling Liu", "Juncheng Dong", "Chen Fu", "Wei Shi", "Ziyang Jiang", "Zhigang Hua", "David Carlson"], "title": "Synergizing Deconfounding and Temporal Generalization For Time-series Counterfactual Outcome Estimation", "comment": null, "summary": "Estimating counterfactual outcomes from time-series observations is crucial for effective decision-making, e.g. when to administer a life-saving treatment, yet remains significantly challenging because (i) the counterfactual trajectory is never observed and (ii) confounders evolve with time and distort estimation at every step. To address these challenges, we propose a novel framework that synergistically integrates two complementary approaches: Sub-treatment Group Alignment (SGA) and Random Temporal Masking (RTM). Instead of the coarse practice of aligning marginal distributions of the treatments in latent space, SGA uses iterative treatment-agnostic clustering to identify fine-grained sub-treatment groups. Aligning these fine-grained groups achieves improved distributional matching, thus leading to more effective deconfounding. We theoretically demonstrate that SGA optimizes a tighter upper bound on counterfactual risk and empirically verify its deconfounding efficacy. RTM promotes temporal generalization by randomly replacing input covariates with Gaussian noises during training. This encourages the model to rely less on potentially noisy or spuriously correlated covariates at the current step and more on stable historical patterns, thereby improving its ability to generalize across time and better preserve underlying causal relationships. Our experiments demonstrate that while applying SGA and RTM individually improves counterfactual outcome estimation, their synergistic combination consistently achieves state-of-the-art performance. This success comes from their distinct yet complementary roles: RTM enhances temporal generalization and robustness across time steps, while SGA improves deconfounding at each specific time point."}
{"id": "2511.16560", "categories": ["cs.CR", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16560", "abs": "https://arxiv.org/abs/2511.16560", "authors": ["Tirthankar Sengupta", "Bishakh Chandra Ghosh", "Sandip Chakraborty", "Shamik Sural"], "title": "Auditable Ledger Snapshot for Non-Repudiable Cross-Blockchain Communication", "comment": null, "summary": "Blockchain interoperability is increasingly recognized as the centerpiece for robust interactions among decentralized services. Blockchain ledgers are generally tamper-proof and thus enforce non-repudiation for transactions recorded within the same network. However, such a guarantee does not hold for cross-blockchain transactions. When disruptions occur due to malicious activities or system failures within one blockchain network, foreign networks can take advantage by denying legitimate claims or mounting fraudulent liabilities against the defenseless network. In response, this paper introduces InterSnap, a novel blockchain snapshot archival methodology, for enabling auditability of crossblockchain transactions, enforcing non-repudiation. InterSnap introduces cross-chain transaction receipts that ensure their irrefutability. Snapshots of ledger data along with these receipts are utilized as non-repudiable proof of bilateral agreements among different networks. InterSnap enhances system resilience through a distributed snapshot generation process, need-based snapshot scheduling process, and archival storage and sharing via decentralized platforms. Through a prototype implementation based on Hyperledger Fabric, we conducted experiments using on-premise machines, AWS public cloud instances, as well as a private cloud infrastructure. We establish that InterSnap can recover from malicious attacks while preserving crosschain transaction receipts. Additionally, our proposed solution demonstrates adaptability to increasing loads while securely transferring snapshot archives with minimal overhead."}
{"id": "2511.16013", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16013", "abs": "https://arxiv.org/abs/2511.16013", "authors": ["Shuo Wang", "Mengfan Teng", "Yun Cheng", "Lothar Thiele", "Olga Saukh", "Shuangshuang He", "Yuanting Zhang", "Jiang Zhang", "Gangfeng Zhang", "Xingyuan Yuan", "Jingfang Fan"], "title": "Physics-Guided Inductive Spatiotemporal Kriging for PM2.5 with Satellite Gradient Constraints", "comment": null, "summary": "High-resolution mapping of fine particulate matter (PM2.5) is a cornerstone of sustainable urbanism but remains critically hindered by the spatial sparsity of ground monitoring networks. While traditional data-driven methods attempt to bridge this gap using satellite Aerosol Optical Depth (AOD), they often suffer from severe, non-random data missingness (e.g., due to cloud cover or nighttime) and inversion biases. To overcome these limitations, this study proposes the Spatiotemporal Physics-Guided Inference Network (SPIN), a novel framework designed for inductive spatiotemporal kriging. Unlike conventional approaches, SPIN synergistically integrates domain knowledge into deep learning by explicitly modeling physical advection and diffusion processes via parallel graph kernels. Crucially, we introduce a paradigm-shifting training strategy: rather than using error-prone AOD as a direct input, we repurpose it as a spatial gradient constraint within the loss function. This allows the model to learn structural pollution patterns from satellite data while remaining robust to data voids. Validated in the highly polluted Beijing-Tianjin-Hebei and Surrounding Areas (BTHSA), SPIN achieves a new state-of-the-art with a Mean Absolute Error (MAE) of 9.52 ug/m^3, effectively generating continuous, physically plausible pollution fields even in unmonitored areas. This work provides a robust, low-cost, and all-weather solution for fine-grained environmental management."}
{"id": "2511.16604", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.16604", "abs": "https://arxiv.org/abs/2511.16604", "authors": ["Kabbo Jit Deb", "Md. Azizul Hakim", "Md Shamse Tabrej"], "title": "Systematically Deconstructing APVD Steganography and its Payload with a Unified Deep Learning Paradigm", "comment": null, "summary": "In the era of digital communication, steganography allows covert embedding of data within media files. Adaptive Pixel Value Differencing (APVD) is a steganographic method valued for its high embedding capacity and invisibility, posing challenges for traditional steganalysis. This paper proposes a deep learning-based approach for detecting APVD steganography and performing reverse steganalysis, which reconstructs the hidden payload. We present a Convolutional Neural Network (CNN) with an attention mechanism and two output heads for simultaneous stego detection and payload recovery. Trained and validated on 10,000 images from the BOSSbase and UCID datasets, our model achieves a detection accuracy of 96.2 percent. It also reconstructs embedded payloads with up to 93.6 percent recovery at lower embedding densities. Results indicate a strong inverse relationship between payload size and recovery accuracy. This study reveals a vulnerability in adaptive steganography and provides a tool for digital forensic analysis, while encouraging reassessment of data security in the age of AI-driven techniques."}
{"id": "2511.16016", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16016", "abs": "https://arxiv.org/abs/2511.16016", "authors": ["Juncheng Dong", "Yiling Liu", "Ahmed Aloui", "Vahid Tarokh", "David Carlson"], "title": "CARE: Turning LLMs Into Causal Reasoning Expert", "comment": null, "summary": "Large language models (LLMs) have recently demonstrated impressive capabilities across a range of reasoning and generation tasks. However, research studies have shown that LLMs lack the ability to identify causal relationships, a fundamental cornerstone of human intelligence. We first conduct an exploratory investigation of LLMs' behavior when asked to perform a causal-discovery task and find that they mostly rely on the semantic meaning of variable names, ignoring the observation data. This is unsurprising, given that LLMs were never trained to process structural datasets. To first tackle this challenge, we prompt the LLMs with the outputs of established causal discovery algorithms designed for observational datasets. These algorithm outputs effectively serve as the sufficient statistics of the observation data. However, quite surprisingly, we find that prompting the LLMs with these sufficient statistics decreases the LLMs' performance in causal discovery. To address this current limitation, we propose CARE, a framework that enhances LLMs' causal-reasoning ability by teaching them to effectively utilize the outputs of established causal-discovery algorithms through supervised fine-tuning. Experimental results show that a finetuned Qwen2.5-1.5B model produced by CARE significantly outperforms both traditional causal-discovery algorithms and state-of-the-art LLMs with over a thousand times more parameters, demonstrating effective utilization of its own knowledge and the external algorithmic clues."}
{"id": "2511.16377", "categories": ["cs.LG", "cs.CR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.16377", "abs": "https://arxiv.org/abs/2511.16377", "authors": ["Hrad Ghoukasian", "Shahab Asoodeh"], "title": "Optimal Fairness under Local Differential Privacy", "comment": "21 pages, 6 figures, 2 tables", "summary": "We investigate how to optimally design local differential privacy (LDP) mechanisms that reduce data unfairness and thereby improve fairness in downstream classification. We first derive a closed-form optimal mechanism for binary sensitive attributes and then develop a tractable optimization framework that yields the corresponding optimal mechanism for multi-valued attributes. As a theoretical contribution, we establish that for discrimination-accuracy optimal classifiers, reducing data unfairness necessarily leads to lower classification unfairness, thus providing a direct link between privacy-aware pre-processing and classification fairness. Empirically, we demonstrate that our approach consistently outperforms existing LDP mechanisms in reducing data unfairness across diverse datasets and fairness metrics, while maintaining accuracy close to that of non-private models. Moreover, compared with leading pre-processing and post-processing fairness methods, our mechanism achieves a more favorable accuracy-fairness trade-off while simultaneously preserving the privacy of sensitive attributes. Taken together, these results highlight LDP as a principled and effective pre-processing fairness intervention technique."}
{"id": "2511.16027", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16027", "abs": "https://arxiv.org/abs/2511.16027", "authors": ["Yang Wu", "Yifan Zhang", "Zhenxing Liang", "Jian Cheng"], "title": "HGCN2SP: Hierarchical Graph Convolutional Network for Two-Stage Stochastic Programming", "comment": "17 pages, 4 figures", "summary": "Two-stage Stochastic Programming (2SP) is a standard framework for modeling decision-making problems under uncertainty. While numerous methods exist, solving such problems with many scenarios remains challenging. Selecting representative scenarios is a practical method for accelerating solutions. However, current approaches typically rely on clustering or Monte Carlo sampling, failing to integrate scenario information deeply and overlooking the significant impact of the scenario order on solving time. To address these issues, we develop HGCN2SP, a novel model with a hierarchical graph designed for 2SP problems, encoding each scenario and modeling their relationships hierarchically. The model is trained in a reinforcement learning paradigm to utilize the feedback of the solver. The policy network is equipped with a hierarchical graph convolutional network for feature encoding and an attention-based decoder for scenario selection in proper order. Evaluation of two classic 2SP problems demonstrates that HGCN2SP provides high-quality decisions in a short computational time. Furthermore, HGCN2SP exhibits remarkable generalization capabilities in handling large-scale instances, even with a substantial number of variables or scenarios that were unseen during the training phase."}
{"id": "2511.16043", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16043", "abs": "https://arxiv.org/abs/2511.16043", "authors": ["Peng Xia", "Kaide Zeng", "Jiaqi Liu", "Can Qin", "Fang Wu", "Yiyang Zhou", "Caiming Xiong", "Huaxiu Yao"], "title": "Agent0: Unleashing Self-Evolving Agents from Zero Data via Tool-Integrated Reasoning", "comment": null, "summary": "Large Language Model (LLM) Agents, often trained with Reinforcement Learning (RL), are constrained by a dependency on human-curated data, limiting scalability and tethering AI to human knowledge. Existing self-evolution frameworks offer an alternative but are typically restricted by the model's inherent capabilities and single-round interactions, hindering the development of complex curricula involving tool use or dynamic reasoning. We introduce Agent0, a fully autonomous framework that evolves high-performing agents without external data through multi-step co-evolution and seamless tool integration. Agent0 establishes a symbiotic competition between two agents initialized from the same base LLM: a curriculum agent that proposes increasingly challenging frontier tasks, and an executor agent that learns to solve them. We integrate external tools to enhance the executor's problem-solving capacity; this improvement, in turn, pressures the curriculum agent to construct more complex, tool-aware tasks. Through this iterative process, Agent0 establishes a self-reinforcing cycle that continuously produces high-quality curricula. Empirically, Agent0 substantially boosts reasoning capabilities, improving the Qwen3-8B-Base model by 18% on mathematical reasoning and 24% on general reasoning benchmarks. Code is available at https://github.com/aiming-lab/Agent0."}
{"id": "2511.16061", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16061", "abs": "https://arxiv.org/abs/2511.16061", "authors": ["Alex Ning", "Vainateya Rangaraju"], "title": "Change-of-Basis Pruning via Rotational Invariance", "comment": "14 pages, 5 figures", "summary": "Structured pruning removes entire neurons or channels, but its effectiveness depends on how importance is distributed across the representation space. Change-of-basis (CoB) pruning addresses this challenge by applying orthogonal linear transformations that concentrate importance within certain dimensions. However, many standard deep learning architectures are not inherently invariant to such transformations. To enable compatibility, we introduce two-subspace radial activations (TSRAs): an activation family that is invariant to orthogonal linear transformations applied independently within its two activation subspaces. This invariance allows CoB transformations to be merged into surrounding weights without incurring extra parameters. We position this work as a proof-of-concept that a rotationally invariant design may offer a principled approach towards change-of-basis pruning. We do not provide an analysis of multiple TSRA candidates nor do we explore weight initialization for any TSRAs. These limitations, combined with other necessary modifications we make to permit rotational invariance, result in a slight accuracy drop of $4.52\\%$ compared to a ReLU-based control. However, using activation-magnitude importance, VGG-16 implementing our CoB+TSRA framework shows encouraging results on CIFAR-10. Under fixed-ratio structured pruning, CoB improves accuracy over a TSRA baseline at all pruning ratios and extends reliable pruning frontier from roughly $30\\%$ to $70\\%$ of parameters without post-prune fine tuning. Under threshold-based pruning strategies, CoB prunes $90-96\\%$ of parameters while maintaining $1-6\\%$ accuracy drop after fine-tuning. Together, these results indicate that rotationally invariant architectures may offer a promising path towards CoB pruning."}
{"id": "2511.16062", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16062", "abs": "https://arxiv.org/abs/2511.16062", "authors": ["Yoonhyuk Choi", "Chong-Kwon Kim"], "title": "Gauge-Equivariant Graph Networks via Self-Interference Cancellation", "comment": null, "summary": "Graph Neural Networks (GNNs) excel on homophilous graphs but often fail under heterophily due to self-reinforcing and phase-inconsistent signals. We propose a Gauge-Equivariant Graph Network with Self-Interference Cancellation (GESC), which replaces additive aggregation with a projection-based interference mechanism. Unlike prior magnetic or gauge-equivariant GNNs that typically focus on phase handling in spectral filtering while largely relying on scalar weighting, GESC introduces a $\\mathrm{U}(1)$ phase connection followed by a rank-1 projection that attenuates self-parallel components before attention. A sign- and phase-aware gate further regulates neighbor influence, attenuating components aligned with current node states and acting as a local notch on low-frequency modes. Across diverse graph benchmarks, our method consistently outperforms recent state-of-the-art models while offering a unified, interference-aware view of message passing. Our code is available at \\href{here}{https://anonymous.4open.science/r/GESC-1B22}."}
{"id": "2511.16069", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16069", "abs": "https://arxiv.org/abs/2511.16069", "authors": ["Junchao Zhou", "Junkang Liu", "Fanhua Shang"], "title": "ILoRA: Federated Learning with Low-Rank Adaptation for Heterogeneous Client Aggregation", "comment": null, "summary": "Federated Learning with Low-Rank Adaptation (LoRA) faces three critical challenges under client heterogeneity: (1) Initialization-Induced Instability due to random initialization misaligning client subspaces; (2) Rank Incompatibility and Aggregation Error when averaging LoRA parameters of different ranks, which biases the global model; and (3) exacerbated Client Drift under Non-IID Data, impairing generalization. To address these challenges, we propose ILoRA, a unified framework that integrates three core innovations: a QR-based orthonormal initialization to ensure all clients start in a coherent subspace; a Concatenated QR Aggregation mechanism that fuses heterogeneous-rank updates via concatenation and decomposition, preserving information while maintaining dimension alignment; and an AdamW optimizer with rank-aware control variates to correct local updates and mitigate client drift. Supported by theoretical convergence guarantees, extensive experiments on vision and NLP benchmarks demonstrate that ILoRA consistently achieves superior accuracy and convergence stability compared to existing federated LoRA methods."}
{"id": "2511.16073", "categories": ["cs.LG", "cs.AI", "cs.MA"], "pdf": "https://arxiv.org/pdf/2511.16073", "abs": "https://arxiv.org/abs/2511.16073", "authors": ["Shreyansh Jain", "Madhav Singhvi", "Shreya Rahul Jain", "Pranav S", "Dishaa Lokesh", "Naren Chittibabu", "Akash Anandhan"], "title": "A Mathematical Framework for Custom Reward Functions in Job Application Evaluation using Reinforcement Learning", "comment": "13 pages, 4 figures, 2 equations, 3 Tables", "summary": "Conventional Applicant Tracking Systems (ATS) tend to be inflexible keyword-matchers, and deny gifted candidates a role due to a few minor semantic mismatches. This article describes a new two-step process to design a more refined resume evaluation model based on a small language model (<600M parameters) that is finetuned using GRPO on a custom reward function. To begin with, Supervised Fine-Tuning (SFT) was used to build a solid baseline model. Second, this SFT model was also optimized with the help of Reinforcement Learning (RL) through GRPO under the guidance of a new, multi-component reward function that can holistically assess candidates beyond simple keyword matching. We indicate that the RL application presents a critical problem of reward hacking due to the initial experiments of aggressive penalties, which produces faulty, excessively negative model behaviors. We have overcome this challenge by refining the reward function repeatedly and training hyperparameters into a stable \"gentle polishing process\" of the reward function. Our resulting GRPO-polished model demonstrates significant real-world efficacy, achieving a final accuracy of 91% on unseen test data. The model shows a strong ability to correctly identify qualified candidates (recall of 0.85 for the 'SELECTED' class) while also showing exceptional precision (1.0), confirming its reliability. These results indicate that a properly executed, two-step fine-tuning procedure can indeed effectively refine a small language model to be able to conduct fine-tuned and human-like candidate scoring, overcoming the drawbacks of both traditional ATS and naive RL usage."}
{"id": "2511.16081", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16081", "abs": "https://arxiv.org/abs/2511.16081", "authors": ["Huseyin Goksu"], "title": "L-JacobiNet and S-JacobiNet: An Analysis of Adaptive Generalization, Stabilization, and Spectral Domain Trade-offs in GNNs", "comment": null, "summary": "Spectral GNNs, like ChebyNet, are limited by heterophily and over-smoothing due to their static, low-pass filter design. This work investigates the \"Adaptive Orthogonal Polynomial Filter\" (AOPF) class as a solution. We introduce two models operating in the [-1, 1] domain: 1) `L-JacobiNet`, the adaptive generalization of `ChebyNet` with learnable alpha, beta shape parameters, and 2) `S-JacobiNet`, a novel baseline representing a LayerNorm-stabilized static `ChebyNet`. Our analysis, comparing these models against AOPFs in the [0, infty) domain (e.g., `LaguerreNet`), reveals critical, previously unknown trade-offs. We find that the [0, infty) domain is superior for modeling heterophily, while the [-1, 1] domain (Jacobi) provides superior numerical stability at high K (K>20). Most significantly, we discover that `ChebyNet`'s main flaw is stabilization, not its static nature. Our static `S-JacobiNet` (ChebyNet+LayerNorm) outperforms the adaptive `L-JacobiNet` on 4 out of 5 benchmark datasets, identifying `S-JacobiNet` as a powerful, overlooked baseline and suggesting that adaptation in the [-1, 1] domain can lead to overfitting."}
{"id": "2511.16087", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16087", "abs": "https://arxiv.org/abs/2511.16087", "authors": ["Vincent Fan", "Regina Barzilay"], "title": "AssayMatch: Learning to Select Data for Molecular Activity Models", "comment": null, "summary": "The performance of machine learning models in drug discovery is highly dependent on the quality and consistency of the underlying training data. Due to limitations in dataset sizes, many models are trained by aggregating bioactivity data from diverse sources, including public databases such as ChEMBL. However, this approach often introduces significant noise due to variability in experimental protocols. We introduce AssayMatch, a framework for data selection that builds smaller, more homogenous training sets attuned to the test set of interest. AssayMatch leverages data attribution methods to quantify the contribution of each training assay to model performance. These attribution scores are used to finetune language embeddings of text-based assay descriptions to capture not just semantic similarity, but also the compatibility between assays. Unlike existing data attribution methods, our approach enables data selection for a test set with unknown labels, mirroring real-world drug discovery campaigns where the activities of candidate molecules are not known in advance. At test time, embeddings finetuned with AssayMatch are used to rank all available training data. We demonstrate that models trained on data selected by AssayMatch are able to surpass the performance of the model trained on the complete dataset, highlighting its ability to effectively filter out harmful or noisy experiments. We perform experiments on two common machine learning architectures and see increased prediction capability over a strong language-only baseline for 9/12 model-target pairs. AssayMatch provides a data-driven mechanism to curate higher-quality datasets, reducing noise from incompatible experiments and improving the predictive power and data efficiency of models for drug discovery. AssayMatch is available at https://github.com/Ozymandias314/AssayMatch."}
{"id": "2511.16090", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16090", "abs": "https://arxiv.org/abs/2511.16090", "authors": ["Haohui Chen", "Zhiyong Chen", "Aoxiang Liu", "Wentuo Fang"], "title": "Mitigating Estimation Bias with Representation Learning in TD Error-Driven Regularization", "comment": null, "summary": "Deterministic policy gradient algorithms for continuous control suffer from value estimation biases that degrade performance. While double critics reduce such biases, the exploration potential of double actors remains underexplored. Building on temporal-difference error-driven regularization (TDDR), a double actor-critic framework, this work introduces enhanced methods to achieve flexible bias control and stronger representation learning. We propose three convex combination strategies, symmetric and asymmetric, that balance pessimistic estimates to mitigate overestimation and optimistic exploration via double actors to alleviate underestimation. A single hyperparameter governs this mechanism, enabling tunable control across the bias spectrum. To further improve performance, we integrate augmented state and action representations into the actor and critic networks. Extensive experiments show that our approach consistently outperforms benchmarks, demonstrating the value of tunable bias and revealing that both overestimation and underestimation can be exploited differently depending on the environment."}
{"id": "2511.16101", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.16101", "abs": "https://arxiv.org/abs/2511.16101", "authors": ["Huseyin Goksu"], "title": "HybSpecNet: A Critical Analysis of Architectural Instability in Hybrid-Domain Spectral GNNs", "comment": null, "summary": "Spectral Graph Neural Networks offer a principled approach to graph filtering but face a fundamental \"Stability-vs-Adaptivity\" trade-off. This trade-off is dictated by the choice of spectral domain. Filters in the finite [-1, 1] domain (e.g., ChebyNet) are numerically stable at high polynomial degrees (K) but are static and low-pass, causing them to fail on heterophilic graphs. Conversely, filters in the semi-infinite [0, infty) domain (e.g., KrawtchoukNet) are highly adaptive and achieve SOTA results on heterophily by learning non-low-pass responses. However, as we demonstrate, these adaptive filters can also suffer from numerical instability, leading to catastrophic performance collapse at high K. In this paper, we propose to resolve this trade-off by designing a hybrid-domain GNN, HybSpecNet, which combines a stable `ChebyNet` branch with an adaptive `KrawtchoukNet` branch. We first demonstrate that a \"naive\" hybrid architecture, which fuses the branches via concatenation, successfully unifies performance at low K, achieving strong results on both homophilic and heterophilic benchmarks. However, we then prove that this naive architecture fails the stability test. Our K-ablation experiments show that this architecture catastrophically collapses at K=25, exactly mirroring the collapse of its unstable `KrawtchoukNet` branch. We identify this critical finding as \"Instability Poisoning,\" where `NaN`/`Inf` gradients from the adaptive branch destroy the training of the model. Finally, we propose and validate an advanced architecture that uses \"Late Fusion\" to completely isolate the gradient pathways. We demonstrate that this successfully solves the instability problem, remaining perfectly stable up to K=30 while retaining its SOTA performance across all graph types. This work identifies a critical architectural pitfall in hybrid GNN design and provides the robust architectural solution."}
{"id": "2511.16105", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16105", "abs": "https://arxiv.org/abs/2511.16105", "authors": ["Yuanbo Tang", "Yan Tang", "Zixuan Zhang", "Zihui Zhao", "Yang Li"], "title": "Pathlet Variational Auto-Encoder for Robust Trajectory Generation", "comment": null, "summary": "Trajectory generation has recently drawn growing interest in privacy-preserving urban mobility studies and location-based service applications. Although many studies have used deep learning or generative AI methods to model trajectories and have achieved promising results, the robustness and interpretability of such models are largely unexplored. This limits the application of trajectory generation algorithms on noisy real-world data and their trustworthiness in downstream tasks. To address this issue, we exploit the regular structure in urban trajectories and propose a deep generative model based on the pathlet representation, which encode trajectories with binary vectors associated with a learned dictionary of trajectory segments. Specifically, we introduce a probabilistic graphical model to describe the trajectory generation process, which includes a Variational Autoencoder (VAE) component and a linear decoder component. During training, the model can simultaneously learn the latent embedding of pathlet representations and the pathlet dictionary that captures mobility patterns in the trajectory dataset. The conditional version of our model can also be used to generate customized trajectories based on temporal and spatial constraints.\n  Our model can effectively learn data distribution even using noisy data, achieving relative improvements of $35.4\\%$ and $26.3\\%$ over strong baselines on two real-world trajectory datasets. Moreover, the generated trajectories can be conveniently utilized for multiple downstream tasks, including trajectory prediction and data denoising. Lastly, the framework design offers a significant efficiency advantage, saving $64.8\\%$ of the time and $56.5\\%$ of GPU memory compared to previous approaches."}
{"id": "2511.16132", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16132", "abs": "https://arxiv.org/abs/2511.16132", "authors": ["Paula Joy B. Martinez", "Jose Marie Antonio Miñoza", "Sebastian C. Ibañez"], "title": "An Interpretability-Guided Framework for Responsible Synthetic Data Generation in Emotional Text", "comment": null, "summary": "Emotion recognition from social media is critical for understanding public sentiment, but accessing training data has become prohibitively expensive due to escalating API costs and platform restrictions. We introduce an interpretability-guided framework where Shapley Additive Explanations (SHAP) provide principled guidance for LLM-based synthetic data generation. With sufficient seed data, SHAP-guided approach matches real data performance, significantly outperforms naïve generation, and substantially improves classification for underrepresented emotion classes. However, our linguistic analysis reveals that synthetic text exhibits reduced vocabulary richness and fewer personal or temporally complex expressions than authentic posts. This work provides both a practical framework for responsible synthetic data generation and a critical perspective on its limitations, underscoring that the future of trustworthy AI depends on navigating the trade-offs between synthetic utility and real-world authenticity."}
{"id": "2511.16145", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16145", "abs": "https://arxiv.org/abs/2511.16145", "authors": ["Zhijie Zhong", "Zhiwen Yu", "Kaixiang Yang", "C. L. Philip Chen"], "title": "Labels Matter More Than Models: Quantifying the Benefit of Supervised Time Series Anomaly Detection", "comment": "16 pages, 14 figures, 7 tables. Under review", "summary": "Time series anomaly detection (TSAD) is a critical data mining task often constrained by label scarcity. Consequently, current research predominantly focuses on Unsupervised Time-series Anomaly Detection (UTAD), relying on complex architectures to model normal data distributions. However, this approach often overlooks the significant performance gains available from limited anomaly labels achievable in practical scenarios. This paper challenges the premise that architectural complexity is the optimal path for TSAD. We conduct the first methodical comparison between supervised and unsupervised paradigms and introduce STAND, a streamlined supervised baseline. Extensive experiments on five public datasets demonstrate that: (1) Labels matter more than models: under a limited labeling budget, simple supervised models significantly outperform complex state-of-the-art unsupervised methods; (2) Supervision yields higher returns: the performance gain from minimal supervision far exceeds that from architectural innovations; and (3) Practicality: STAND exhibits superior prediction consistency and anomaly localization compared to unsupervised counterparts. These findings advocate for a data-centric shift in TSAD research, emphasizing label utilization over purely algorithmic complexity. The code is publicly available at https://github.com/EmorZz1G/STAND."}
{"id": "2511.16148", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16148", "abs": "https://arxiv.org/abs/2511.16148", "authors": ["Perceval Beja-Battais", "Alain Grossetête", "Nicolas Vayatis"], "title": "Enhancing Nuclear Reactor Core Simulation through Data-Based Surrogate Models", "comment": null, "summary": "In recent years, there has been an increasing need for Nuclear Power Plants (NPPs) to improve flexibility in order to match the rapid growth of renewable energies. The Operator Assistance Predictive System (OAPS) developed by Framatome addresses this problem through Model Predictive Control (MPC). In this work, we aim to improve MPC methods through data-driven simulation schemes. Thus, from a set of nonlinear stiff ordinary differential equations (ODEs), this paper introduces two surrogate models acting as alternative simulation schemes to enhance nuclear reactor core simulation. We show that both data-driven and physics-informed models can rapidly integrate complex dynamics, with a very low computational time (up to 1000x time reduction)."}
{"id": "2511.16164", "categories": ["cs.LG", "stat.AP"], "pdf": "https://arxiv.org/pdf/2511.16164", "abs": "https://arxiv.org/abs/2511.16164", "authors": ["Eloi Lindas", "Yannig Goude", "Philippe Ciais"], "title": "Achieving Skilled and Reliable Daily Probabilistic Forecasts of Wind Power at Subseasonal-to-Seasonal Timescales over France", "comment": null, "summary": "Accurate and reliable wind power forecasts are crucial for grid stability, balancing supply and demand, and market risk management. Even though short-term weather forecasts have been thoroughly used to provide short-term renewable power predictions, forecasts involving longer prediction horizons still need investigations. Despite the recent progress in subseasonal-to-seasonal weather probabilistic forecasting, their use for wind power prediction usually involves both temporal and spatial aggregation achieve reasonable skill. In this study, we present a forecasting pipeline enabling to transform ECMWF subseasonal-to-seasonal weather forecasts into wind power forecasts for lead times ranging from 1 day to 46 days at daily resolution. This framework also include post-processing of the resulting power ensembles to account for the biases and lack of dispersion of the weather forecasts. We show that our method is able to outperform a climatological baseline by 50 % in terms of both Continuous Ranked Probability Skill Score and Ensemble Mean Squared Error while also providing near perfect calibration of the forecasts for lead times ranging from 15 to 46 days."}
{"id": "2511.16191", "categories": ["cs.LG", "cs.SI"], "pdf": "https://arxiv.org/pdf/2511.16191", "abs": "https://arxiv.org/abs/2511.16191", "authors": ["Xiaotong Zhan", "Xi Cheng"], "title": "CausalMamba: Interpretable State Space Modeling for Temporal Rumor Causality", "comment": "Preprint. 9 pages, 3 figures, 2 tables. Code and implementation details available at: https://github.com/XiaotongZhan/Causal_Mamba", "summary": "Rumor detection on social media remains a challenging task due to the complex propagation dynamics and the limited interpretability of existing models. While recent neural architectures capture content and structural features, they often fail to reveal the underlying causal mechanisms of misinformation spread. We propose CausalMamba, a novel framework that integrates Mamba-based sequence modeling, graph convolutional networks (GCNs), and differentiable causal discovery via NOTEARS. CausalMamba learns joint representations of temporal tweet sequences and reply structures, while uncovering latent causal graphs to identify influential nodes within each propagation chain. Experiments on the Twitter15 dataset show that our model achieves competitive classification performance compared to strong baselines, and uniquely enables counterfactual intervention analysis. Qualitative results demonstrate that removing top-ranked causal nodes significantly alters graph connectivity, offering interpretable insights into rumor dynamics. Our framework provides a unified approach for rumor classification and influence analysis, paving the way for more explainable and actionable misinformation detection systems."}
{"id": "2511.16194", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16194", "abs": "https://arxiv.org/abs/2511.16194", "authors": ["Antonios Antoniadis", "Ali Shahheidar", "Golnoosh Shahkarami", "Abolfazl Soltani"], "title": "A Switching Framework for Online Interval Scheduling with Predictions", "comment": "This paper will appear in AAAI 2026", "summary": "We study online interval scheduling in the irrevocable setting, where each interval must be immediately accepted or rejected upon arrival. The objective is to maximize the total length of accepted intervals while ensuring that no two accepted intervals overlap. We consider this problem in a learning-augmented setting, where the algorithm has access to (machine-learned) predictions. The goal is to design algorithms that leverage these predictions to improve performance while maintaining robust guarantees in the presence of prediction errors.\n  Our main contribution is the SemiTrust-and-Switch framework, which provides a unified approach for combining prediction-based and classical interval scheduling algorithms. This framework applies to both deterministic and randomized algorithms and captures the trade-off between consistency (performance under accurate predictions) and robustness (performance under adversarial inputs). Moreover, we provide lower bounds, proving the tightness of this framework in particular settings.\n  We further design a randomized algorithm that smoothly interpolates between prediction-based and robust algorithms. This algorithm achieves both robustness and smoothness--its performance degrades gracefully with the quality of the prediction."}
{"id": "2511.16204", "categories": ["cs.LG", "stat.ME"], "pdf": "https://arxiv.org/pdf/2511.16204", "abs": "https://arxiv.org/abs/2511.16204", "authors": ["Andrea Iommi", "Antonio Mastropietro", "Riccardo Guidotti", "Anna Monreale", "Salvatore Ruggieri"], "title": "Causal Synthetic Data Generation in Recruitment", "comment": "Published. Conference: AEQUITAS 2025: Workshop on Fairness and Bias in AI | co-located with ECAI 2025, Bologna, Italy", "summary": "The importance of Synthetic Data Generation (SDG) has increased significantly in domains where data quality is poor or access is limited due to privacy and regulatory constraints. One such domain is recruitment, where publicly available datasets are scarce due to the sensitive nature of information typically found in curricula vitae, such as gender, disability status, or age. %\nThis lack of accessible, representative data presents a significant obstacle to the development of fair and transparent machine learning models, particularly ranking algorithms that require large volumes of data to effectively learn how to recommend candidates. In the absence of such data, these models are prone to poor generalisation and may fail to perform reliably in real-world scenarios. %\nRecent advances in Causal Generative Models (CGMs) offer a promising solution. CGMs enable the generation of synthetic datasets that preserve the underlying causal relationships within the data, providing greater control over fairness and interpretability in the data generation process. %\nIn this study, we present a specialised SDG method involving two CGMs: one modelling job offers and the other modelling curricula. Each model is structured according to a causal graph informed by domain expertise. We use these models to generate synthetic datasets and evaluate the fairness of candidate rankings under controlled scenarios that introduce specific biases."}
{"id": "2511.16207", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16207", "abs": "https://arxiv.org/abs/2511.16207", "authors": ["Farah Alsafadi", "Alexandra Akins", "Xu Wu"], "title": "Towards Overcoming Data Scarcity in Nuclear Energy: A Study on Critical Heat Flux with Physics-consistent Conditional Diffusion Model", "comment": null, "summary": "Deep generative modeling provides a powerful pathway to overcome data scarcity in energy-related applications where experimental data are often limited, costly, or difficult to obtain. By learning the underlying probability distribution of the training dataset, deep generative models, such as the diffusion model (DM), can generate high-fidelity synthetic samples that statistically resemble the training data. Such synthetic data generation can significantly enrich the size and diversity of the available training data, and more importantly, improve the robustness of downstream machine learning models in predictive tasks. The objective of this paper is to investigate the effectiveness of DM for overcoming data scarcity in nuclear energy applications. By leveraging a public dataset on critical heat flux (CHF) that cover a wide range of commercial nuclear reactor operational conditions, we developed a DM that can generate an arbitrary amount of synthetic samples for augmenting of the CHF dataset. Since a vanilla DM can only generate samples randomly, we also developed a conditional DM capable of generating targeted CHF data under user-specified thermal-hydraulic conditions. The performance of the DM was evaluated based on their ability to capture empirical feature distributions and pair-wise correlations, as well as to maintain physical consistency. The results showed that both the DM and conditional DM can successfully generate realistic and physics-consistent CHF data. Furthermore, uncertainty quantification was performed to establish confidence in the generated data. The results demonstrated that the conditional DM is highly effective in augmenting CHF data while maintaining acceptable levels of uncertainty."}
{"id": "2511.16218", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16218", "abs": "https://arxiv.org/abs/2511.16218", "authors": ["Joana Reuss", "Ekaterina Gikalo", "Marco Körner"], "title": "Mind the Gap: Bridging Prior Shift in Realistic Few-Shot Crop-Type Classification", "comment": "7 pages, 4 figures", "summary": "Real-world agricultural distributions often suffer from severe class imbalance, typically following a long-tailed distribution. Labeled datasets for crop-type classification are inherently scarce and remain costly to obtain. When working with such limited data, training sets are frequently constructed to be artificially balanced -- in particular in the case of few-shot learning -- failing to reflect real-world conditions. This mismatch induces a shift between training and test label distributions, degrading real-world generalization. To address this, we propose Dirichlet Prior Augmentation (DirPA), a novel method that simulates an unknown label distribution skew of the target domain proactively during model training. Specifically, we model the real-world distribution as Dirichlet-distributed random variables, effectively performing a prior augmentation during few-shot learning. Our experiments show that DirPA successfully shifts the decision boundary and stabilizes the training process by acting as a dynamic feature regularizer."}
{"id": "2511.16225", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16225", "abs": "https://arxiv.org/abs/2511.16225", "authors": ["Victor Croisfelt", "João Henrique Inacio de Souza", "Shashi Raj Pandey", "Beatriz Soret", "Petar Popovski"], "title": "Real-Time Inference for Distributed Multimodal Systems under Communication Delay Uncertainty", "comment": "6 pages, 3 figures, submitted to IEEE ICC 2026", "summary": "Connected cyber-physical systems perform inference based on real-time inputs from multiple data streams. Uncertain communication delays across data streams challenge the temporal flow of the inference process. State-of-the-art (SotA) non-blocking inference methods rely on a reference-modality paradigm, requiring one modality input to be fully received before processing, while depending on costly offline profiling. We propose a novel, neuro-inspired non-blocking inference paradigm that primarily employs adaptive temporal windows of integration (TWIs) to dynamically adjust to stochastic delay patterns across heterogeneous streams while relaxing the reference-modality requirement. Our communication-delay-aware framework achieves robust real-time inference with finer-grained control over the accuracy-latency tradeoff. Experiments on the audio-visual event localization (AVEL) task demonstrate superior adaptability to network dynamics compared to SotA approaches."}
{"id": "2511.16226", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16226", "abs": "https://arxiv.org/abs/2511.16226", "authors": ["Saksham Gautam", "Lakshmi Mandal", "Shalabh Bhatnagar"], "title": "Deep SOR Minimax Q-learning for Two-player Zero-sum Game", "comment": null, "summary": "In this work, we consider the problem of a two-player zero-sum game. In the literature, the successive over-relaxation Q-learning algorithm has been developed and implemented, and it is seen to result in a lower contraction factor for the associated Q-Bellman operator resulting in a faster value iteration-based procedure. However, this has been presented only for the tabular case and not for the setting with function approximation that typically caters to real-world high-dimensional state-action spaces. Furthermore, such settings in the case of two-player zero-sum games have not been considered. We thus propose a deep successive over-relaxation minimax Q-learning algorithm that incorporates deep neural networks as function approximators and is suitable for high-dimensional spaces. We prove the finite-time convergence of the proposed algorithm. Through numerical experiments, we show the effectiveness of the proposed method over the existing Q-learning algorithm. Our ablation studies demonstrate the effect of different values of the crucial successive over-relaxation parameter."}
{"id": "2511.16231", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16231", "abs": "https://arxiv.org/abs/2511.16231", "authors": ["Yang Yu"], "title": "Pass@k Metric for RLVR: A Diagnostic Tool of Exploration, But Not an Objective", "comment": null, "summary": "The ability of Large Language Models (LLMs) to perform complex, multi-step reasoning is a central focus of modern AI research. To evaluate and enhance this capability, the pass@k metric, which measures the probability of obtaining at least one correct solution in k independent samples, has received significant attention. Its intuitive appeal has led to its adoption not only as an evaluation standard but also as a direct optimization objective in reinforcement learning. In this paper, we analyze the pass@k objective, derive its gradient, and demonstrate that it is fundamentally a per-example positive reweighting of the simpler pass@1 objective. Our analysis reveals that the pass@k objective provides a vanishing learning signal in regimes where exploration is most critical. We further analyze the dynamics of \"exploration collapse\", showing that as the policy concentrates probability mass, the gap between pass@k and pass@1 diminishes. We conclude that while pass@k is a useful diagnostic tool, it may be an unsuitable direct objective for optimization. Instead, mechanisms explicitly encouraging efficient exploration could offer a more effective path forward for reinforcement learning in reasoning tasks."}
{"id": "2511.16258", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16258", "abs": "https://arxiv.org/abs/2511.16258", "authors": ["Yang Xu", "Zuliang Yang", "Kai Ming Ting"], "title": "GeoPTH: A Lightweight Approach to Category-Based Trajectory Retrieval via Geometric Prototype Trajectory Hashing", "comment": null, "summary": "Trajectory similarity retrieval is an important part of spatiotemporal data mining, however, existing methods have the following limitations: traditional metrics are computationally expensive, while learning-based methods suffer from substantial training costs and potential instability. This paper addresses these problems by proposing \\textbf{Geo}metric \\textbf{P}rototype \\textbf{T}rajectory \\textbf{H}ashing (GeoPTH), a novel, lightweight, and non-learning framework for efficient category-based trajectory retrieval. GeoPTH constructs data-dependent hash functions by using representative trajectory prototypes, i.e., small point sets preserving geometric characteristics, as anchors. The hashing process is efficient, which involves mapping a new trajectory to its closest prototype via a robust, \\textit{Hausdorff} metric. Extensive experiments show that GeoPTH's retrieval accuracy is highly competitive with both traditional metrics and state-of-the-art learning methods, and it significantly outperforms binary codes generated through simple binarization of the learned embeddings. Critically, GeoPTH consistently outperforms all competitors in terms of efficiency. Our work demonstrates that a lightweight, prototype-centric approach offers a practical and powerful alternative, achieving an exceptional retrieval performance and computational efficiency."}
{"id": "2511.16287", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16287", "abs": "https://arxiv.org/abs/2511.16287", "authors": ["David Bechtoldt", "Sidney Bender"], "title": "Graph Diffusion Counterfactual Explanation", "comment": null, "summary": "Machine learning models that operate on graph-structured data, such as molecular graphs or social networks, often make accurate predictions but offer little insight into why certain predictions are made. Counterfactual explanations address this challenge by seeking the closest alternative scenario where the model's prediction would change. Although counterfactual explanations are extensively studied in tabular data and computer vision, the graph domain remains comparatively underexplored. Constructing graph counterfactuals is intrinsically difficult because graphs are discrete and non-euclidean objects. We introduce Graph Diffusion Counterfactual Explanation, a novel framework for generating counterfactual explanations on graph data, combining discrete diffusion models and classifier-free guidance. We empirically demonstrate that our method reliably generates in-distribution as well as minimally structurally different counterfactuals for both discrete classification targets and continuous properties."}
{"id": "2511.16297", "categories": ["cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16297", "abs": "https://arxiv.org/abs/2511.16297", "authors": ["Dean Brandner", "Sergio Lucia"], "title": "Optimizing Operation Recipes with Reinforcement Learning for Safe and Interpretable Control of Chemical Processes", "comment": "16 pages, 3 figures, Part of the workshop 'Machine Learning for Chemistry and Chemical Engineering (ML4CCE)' at the ECML24 conference: Link: https://ml4cce-ecml.com/", "summary": "Optimal operation of chemical processes is vital for energy, resource, and cost savings in chemical engineering. The problem of optimal operation can be tackled with reinforcement learning, but traditional reinforcement learning methods face challenges due to hard constraints related to quality and safety that must be strictly satisfied, and the large amount of required training data. Chemical processes often cannot provide sufficient experimental data, and while detailed dynamic models can be an alternative, their complexity makes it computationally intractable to generate the needed data. Optimal control methods, such as model predictive control, also struggle with the complexity of the underlying dynamic models. Consequently, many chemical processes rely on manually defined operation recipes combined with simple linear controllers, leading to suboptimal performance and limited flexibility.\n  In this work, we propose a novel approach that leverages expert knowledge embedded in operation recipes. By using reinforcement learning to optimize the parameters of these recipes and their underlying linear controllers, we achieve an optimized operation recipe. This method requires significantly less data, handles constraints more effectively, and is more interpretable than traditional reinforcement learning methods due to the structured nature of the recipes. We demonstrate the potential of our approach through simulation results of an industrial batch polymerization reactor, showing that it can approach the performance of optimal controllers while addressing the limitations of existing methods."}
{"id": "2511.16318", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16318", "abs": "https://arxiv.org/abs/2511.16318", "authors": ["Hao Shu"], "title": "Learning-Enhanced Observer for Linear Time-Invariant Systems with Parametric Uncertainty", "comment": "6 pages, ordinary version", "summary": "This work introduces a learning-enhanced observer (LEO) for linear time-invariant systems with uncertain dynamics. Rather than relying solely on nominal models, the proposed framework treats the system matrices as optimizable variables and refines them through gradient-based minimization of a steady-state output discrepancy loss. The resulting data-informed surrogate model enables the construction of an improved observer that effectively compensates for moderate parameter uncertainty while preserving the structure of classical designs. Extensive Monte Carlo studies across diverse system dimensions show systematic and statistically significant reductions, typically exceeding 15\\%, in normalized estimation error for both open-loop and Luenberger observers. These results demonstrate that modern learning mechanisms can serve as a powerful complement to traditional observer design, yielding more accurate and robust state estimation in uncertain systems. Codes are available at https://github.com/Hao-B-Shu/LTI_LEO."}
{"id": "2511.16333", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16333", "abs": "https://arxiv.org/abs/2511.16333", "authors": ["Mohammad Areeb Qazi", "Maryam Nadeem", "Mohammad Yaqub"], "title": "Beyond Generative AI: World Models for Clinical Prediction, Counterfactuals, and Planning", "comment": "2 Figures, 1 Table", "summary": "Healthcare requires AI that is predictive, reliable, and data-efficient. However, recent generative models lack physical foundation and temporal reasoning required for clinical decision support. As scaling language models show diminishing returns for grounded clinical reasoning, world models are gaining traction because they learn multimodal, temporally coherent, and action-conditioned representations that reflect the physical and causal structure of care. This paper reviews World Models for healthcare systems that learn predictive dynamics to enable multistep rollouts, counterfactual evaluation and planning. We survey recent work across three domains: (i) medical imaging and diagnostics (e.g., longitudinal tumor simulation, projection-transition modeling, and Joint Embedding Predictive Architecture i.e., JEPA-style predictive representation learning), (ii) disease progression modeling from electronic health records (generative event forecasting at scale), and (iii) robotic surgery and surgical planning (action-conditioned guidance and control). We also introduce a capability rubric: L1 temporal prediction, L2 action-conditioned prediction, L3 counterfactual rollouts for decision support, and L4 planning/control. Most reviewed systems achieve L1--L2, with fewer instances of L3 and rare L4. We identify cross-cutting gaps that limit clinical reliability; under-specified action spaces and safety constraints, weak interventional validation, incomplete multimodal state construction, and limited trajectory-level uncertainty calibration. This review outlines a research agenda for clinically robust prediction-first world models that integrate generative backbones (transformers, diffusion, VAE) with causal/mechanical foundation for safe decision support in healthcare."}
{"id": "2511.16340", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.16340", "abs": "https://arxiv.org/abs/2511.16340", "authors": ["Alan Yufei Dong", "Jihao Andreas Lin", "José Miguel Hernández-Lobato"], "title": "Improving Iterative Gaussian Processes via Warm Starting Sequential Posteriors", "comment": null, "summary": "Scalable Gaussian process (GP) inference is essential for sequential decision-making tasks, yet improving GP scalability remains a challenging problem with many open avenues of research. This paper focuses on iterative GPs, where iterative linear solvers, such as conjugate gradients, stochastic gradient descent or alternative projections, are used to approximate the GP posterior. We propose a new method which improves solver convergence of a large linear system by leveraging the known solution to a smaller system contained within. This is significant for tasks with incremental data additions, and we show that our technique achieves speed-ups when solving to tolerance, as well as improved Bayesian optimisation performance under a fixed compute budget."}
{"id": "2511.16375", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16375", "abs": "https://arxiv.org/abs/2511.16375", "authors": ["Marcin Kostrzewa", "Oleksii Furman", "Roman Furman", "Sebastian Tomczak", "Maciej Zięba"], "title": "Are Foundation Models Useful for Bankruptcy Prediction?", "comment": "NeurIPS 2025 Workshop: Generative AI in Finance", "summary": "Foundation models have shown promise across various financial applications, yet their effectiveness for corporate bankruptcy prediction remains systematically unevaluated against established methods. We study bankruptcy forecasting using Llama-3.3-70B-Instruct and TabPFN, evaluated on large, highly imbalanced datasets of over one million company records from the Visegrád Group. We provide the first systematic comparison of foundation models against classical machine learning baselines for this task. Our results show that models such as XGBoost and CatBoost consistently outperform foundation models across all prediction horizons. LLM-based approaches suffer from unreliable probability estimates, undermining their use in risk-sensitive financial settings. TabPFN, while competitive with simpler baselines, requires substantial computational resources with costs not justified by performance gains. These findings suggest that, despite their generality, current foundation models remain less effective than specialized methods for bankruptcy forecasting."}
{"id": "2511.16377", "categories": ["cs.LG", "cs.CR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.16377", "abs": "https://arxiv.org/abs/2511.16377", "authors": ["Hrad Ghoukasian", "Shahab Asoodeh"], "title": "Optimal Fairness under Local Differential Privacy", "comment": "21 pages, 6 figures, 2 tables", "summary": "We investigate how to optimally design local differential privacy (LDP) mechanisms that reduce data unfairness and thereby improve fairness in downstream classification. We first derive a closed-form optimal mechanism for binary sensitive attributes and then develop a tractable optimization framework that yields the corresponding optimal mechanism for multi-valued attributes. As a theoretical contribution, we establish that for discrimination-accuracy optimal classifiers, reducing data unfairness necessarily leads to lower classification unfairness, thus providing a direct link between privacy-aware pre-processing and classification fairness. Empirically, we demonstrate that our approach consistently outperforms existing LDP mechanisms in reducing data unfairness across diverse datasets and fairness metrics, while maintaining accuracy close to that of non-private models. Moreover, compared with leading pre-processing and post-processing fairness methods, our mechanism achieves a more favorable accuracy-fairness trade-off while simultaneously preserving the privacy of sensitive attributes. Taken together, these results highlight LDP as a principled and effective pre-processing fairness intervention technique."}
{"id": "2511.16398", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16398", "abs": "https://arxiv.org/abs/2511.16398", "authors": ["Yidong Chai", "Haoxin Liu", "Jiaheng Xie", "Chaopeng Wang", "Xiao Fang"], "title": "Collaborative Management for Chronic Diseases and Depression: A Double Heterogeneity-based Multi-Task Learning Method", "comment": null, "summary": "Wearable sensor technologies and deep learning are transforming healthcare management. Yet, most health sensing studies focus narrowly on physical chronic diseases. This overlooks the critical need for joint assessment of comorbid physical chronic diseases and depression, which is essential for collaborative chronic care. We conceptualize multi-disease assessment, including both physical diseases and depression, as a multi-task learning (MTL) problem, where each disease assessment is modeled as a task. This joint formulation leverages inter-disease relationships to improve accuracy, but it also introduces the challenge of double heterogeneity: chronic diseases differ in their manifestation (disease heterogeneity), and patients with the same disease show varied patterns (patient heterogeneity). To address these issues, we first adopt existing techniques and propose a base method. Given the limitations of the base method, we further propose an Advanced Double Heterogeneity-based Multi-Task Learning (ADH-MTL) method that improves the base method through three innovations: (1) group-level modeling to support new patient predictions, (2) a decomposition strategy to reduce model complexity, and (3) a Bayesian network that explicitly captures dependencies while balancing similarities and differences across model components. Empirical evaluations on real-world wearable sensor data demonstrate that ADH-MTL significantly outperforms existing baselines, and each of its innovations is shown to be effective. This study contributes to health information systems by offering a computational solution for integrated physical and mental healthcare and provides design principles for advancing collaborative chronic disease management across the pre-treatment, treatment, and post-treatment phases."}
{"id": "2511.16426", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16426", "abs": "https://arxiv.org/abs/2511.16426", "authors": ["Seyed Mohamad Moghadas", "Bruno Cornelis", "Adrian Munteanu"], "title": "FreqFlow: Long-term forecasting using lightweight flow matching", "comment": "Accepted at EurIPS, 2025", "summary": "Multivariate time-series (MTS) forecasting is fundamental to applications ranging from urban mobility and resource management to climate modeling. While recent generative models based on denoising diffusion have advanced state-of-the-art performance in capturing complex data distributions, they suffer from significant computational overhead due to iterative stochastic sampling procedures that limit real-time deployment. Moreover, these models can be brittle when handling high-dimensional, non-stationary, and multi-scale periodic patterns characteristic of real-world sensor networks. We introduce FreqFlow, a novel framework that leverages conditional flow matching in the frequency domain for deterministic MTS forecasting. Unlike conventional approaches that operate in the time domain, FreqFlow transforms the forecasting problem into the spectral domain, where it learns to model amplitude and phase shifts through a single complex-valued linear layer. This frequency-domain formulation enables the model to efficiently capture temporal dynamics via complex multiplication, corresponding to scaling and temporal translations. The resulting architecture is exceptionally lightweight with only 89k parameters - an order of magnitude smaller than competing diffusion-based models-while enabling single-pass deterministic sampling through ordinary differential equation (ODE) integration. Our approach decomposes MTS signals into trend, seasonal, and residual components, with the flow matching mechanism specifically designed for residual learning to enhance long-term forecasting accuracy. Extensive experiments on real-world traffic speed, volume, and flow datasets demonstrate that FreqFlow achieves state-of-the-art forecasting performance, on average 7\\% RMSE improvements, while being significantly faster and more parameter-efficient than existing methods"}
{"id": "2511.16427", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16427", "abs": "https://arxiv.org/abs/2511.16427", "authors": ["Muhammad Aslanimoghanloo", "Ahmed ElGazzar", "Marcel van Gerven"], "title": "Generative Modeling of Clinical Time Series via Latent Stochastic Differential Equations", "comment": null, "summary": "Clinical time series data from electronic health records and medical registries offer unprecedented opportunities to understand patient trajectories and inform medical decision-making. However, leveraging such data presents significant challenges due to irregular sampling, complex latent physiology, and inherent uncertainties in both measurements and disease progression. To address these challenges, we propose a generative modeling framework based on latent neural stochastic differential equations (SDEs) that views clinical time series as discrete-time partial observations of an underlying controlled stochastic dynamical system. Our approach models latent dynamics via neural SDEs with modality-dependent emission models, while performing state estimation and parameter learning through variational inference. This formulation naturally handles irregularly sampled observations, learns complex non-linear interactions, and captures the stochasticity of disease progression and measurement noise within a unified scalable probabilistic framework. We validate the framework on two complementary tasks: (i) individual treatment effect estimation using a simulated pharmacokinetic-pharmacodynamic (PKPD) model of lung cancer, and (ii) probabilistic forecasting of physiological signals using real-world intensive care unit (ICU) data from 12,000 patients. Results show that our framework outperforms ordinary differential equation and long short-term memory baseline models in accuracy and uncertainty estimation. These results highlight its potential for enabling precise, uncertainty-aware predictions to support clinical decision-making."}
{"id": "2511.16475", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16475", "abs": "https://arxiv.org/abs/2511.16475", "authors": ["Ali Murtaza Caunhye", "Asad Jeewa"], "title": "A Comparison Between Decision Transformers and Traditional Offline Reinforcement Learning Algorithms", "comment": "15 pages, 4 figures, published in the Proceedings of the 46th Annual conference of the South African Institute of Computer Scientists and Information Technologists (SIACSIT 2025)", "summary": "The field of Offline Reinforcement Learning (RL) aims to derive effective policies from pre-collected datasets without active environment interaction. While traditional offline RL algorithms like Conservative Q-Learning (CQL) and Implicit Q-Learning (IQL) have shown promise, they often face challenges in balancing exploration and exploitation, especially in environments with varying reward densities. The recently proposed Decision Transformer (DT) approach, which reframes offline RL as a sequence modelling problem, has demonstrated impressive results across various benchmarks. This paper presents a comparative study evaluating the performance of DT against traditional offline RL algorithms in dense and sparse reward settings for the ANT continous control environment. Our research investigates how these algorithms perform when faced with different reward structures, examining their ability to learn effective policies and generalize across varying levels of feedback. Through empirical analysis in the ANT environment, we found that DTs showed less sensitivity to varying reward density compared to other methods and particularly excelled with medium-expert datasets in sparse reward scenarios. In contrast, traditional value-based methods like IQL showed improved performance in dense reward settings with high-quality data, while CQL offered balanced performance across different data qualities. Additionally, DTs exhibited lower variance in performance but required significantly more computational resources compared to traditional approaches. These findings suggest that sequence modelling approaches may be more suitable for scenarios with uncertain reward structures or mixed-quality data, while value-based methods remain competitive in settings with dense rewards and high-quality demonstrations."}
{"id": "2511.16476", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16476", "abs": "https://arxiv.org/abs/2511.16476", "authors": ["Muhammad Sa'ood Shah", "Asad Jeewa"], "title": "Limitations of Scalarisation in MORL: A Comparative Study in Discrete Environments", "comment": "15 pages, 4 figures, published in the Proceedings of the 46th Annual Conference of the South African Institute of Computer Scientists and Information Technologists (SAICSIT 2025)", "summary": "Scalarisation functions are widely employed in MORL algorithms to enable intelligent decision-making. However, these functions often struggle to approximate the Pareto front accurately, rendering them unideal in complex, uncertain environments. This study examines selected Multi-Objective Reinforcement Learning (MORL) algorithms across MORL environments with discrete action and observation spaces. We aim to investigate further the limitations associated with scalarisation approaches for decision-making in multi-objective settings. Specifically, we use an outer-loop multi-policy methodology to assess the performance of a seminal single-policy MORL algorithm, MO Q-Learning implemented with linear scalarisation and Chebyshev scalarisation functions. In addition, we explore a pioneering inner-loop multi-policy algorithm, Pareto Q-Learning, which offers a more robust alternative. Our findings reveal that the performance of the scalarisation functions is highly dependent on the environment and the shape of the Pareto front. These functions often fail to retain the solutions uncovered during learning and favour finding solutions in certain regions of the solution space. Moreover, finding the appropriate weight configurations to sample the entire Pareto front is complex, limiting their applicability in uncertain settings. In contrast, inner-loop multi-policy algorithms may provide a more sustainable and generalizable approach and potentially facilitate intelligent decision-making in dynamic and uncertain environments."}
{"id": "2511.16482", "categories": ["cs.LG", "cs.AI", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.16482", "abs": "https://arxiv.org/abs/2511.16482", "authors": ["Poushali Sengupta", "Yan Zhang", "Frank Eliassen", "Sabita Maharjan"], "title": "Correlation-Aware Feature Attribution Based Explainable AI", "comment": "Accepted, 2026 International Conference on Advances in Artificial Intelligence and Machine Learning (AAIML 2026)", "summary": "Explainable AI (XAI) is increasingly essential as modern models become more complex and high-stakes applications demand transparency, trust, and regulatory compliance. Existing global attribution methods often incur high computational costs, lack stability under correlated inputs, and fail to scale efficiently to large or heterogeneous datasets. We address these gaps with \\emph{ExCIR} (Explainability through Correlation Impact Ratio), a correlation-aware attribution score equipped with a lightweight transfer protocol that reproduces full-model rankings using only a fraction of the data. ExCIR quantifies sign-aligned co-movement between features and model outputs after \\emph{robust centering} (subtracting a robust location estimate, e.g., median or mid-mean, from features and outputs). We further introduce \\textsc{BlockCIR}, a \\emph{groupwise} extension of ExCIR that scores \\emph{sets} of correlated features as a single unit. By aggregating the same signed-co-movement numerators and magnitudes over predefined or data-driven groups, \\textsc{BlockCIR} mitigates double-counting in collinear clusters (e.g., synonyms or duplicated sensors) and yields smoother, more stable rankings when strong dependencies are present. Across diverse text, tabular, signal, and image datasets, ExCIR shows trustworthy agreement with established global baselines and the full model, delivers consistent top-$k$ rankings across settings, and reduces runtime via lightweight evaluation on a subset of rows. Overall, ExCIR provides \\emph{computationally efficient}, \\emph{consistent}, and \\emph{scalable} explainability for real-world deployment."}
{"id": "2511.16483", "categories": ["cs.LG", "cs.AI", "cs.MA"], "pdf": "https://arxiv.org/pdf/2511.16483", "abs": "https://arxiv.org/abs/2511.16483", "authors": ["Sayak Mukherjee", "Samrat Chatterjee", "Emilie Purvine", "Ted Fujimoto", "Tegan Emerson"], "title": "Large Language Model-Based Reward Design for Deep Reinforcement Learning-Driven Autonomous Cyber Defense", "comment": "Accepted in the AAAI-26 Workshop on Artificial Intelligence for Cyber Security (AICS)", "summary": "Designing rewards for autonomous cyber attack and defense learning agents in a complex, dynamic environment is a challenging task for subject matter experts. We propose a large language model (LLM)-based reward design approach to generate autonomous cyber defense policies in a deep reinforcement learning (DRL)-driven experimental simulation environment. Multiple attack and defense agent personas were crafted, reflecting heterogeneity in agent actions, to generate LLM-guided reward designs where the LLM was first provided with contextual cyber simulation environment information. These reward structures were then utilized within a DRL-driven attack-defense simulation environment to learn an ensemble of cyber defense policies. Our results suggest that LLM-guided reward designs can lead to effective defense strategies against diverse adversarial behaviors."}
{"id": "2511.16501", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16501", "abs": "https://arxiv.org/abs/2511.16501", "authors": ["Carlos Boned Riera", "David Romero Sanchez", "Oriol Ramos Terrades"], "title": "ODE-ViT: Plug & Play Attention Layer from the Generalization of the ViT as an Ordinary Differential Equation", "comment": null, "summary": "In recent years, increasingly large models have achieved outstanding performance across CV tasks. However, these models demand substantial computational resources and storage, and their growing complexity limits our understanding of how they make decisions. Most of these architectures rely on the attention mechanism within Transformer-based designs. Building upon the connection between residual neural networks and ordinary differential equations (ODEs), we introduce ODE-ViT, a Vision Transformer reformulated as an ODE system that satisfies the conditions for well-posed and stable dynamics. Experiments on CIFAR-10 and CIFAR-100 demonstrate that ODE-ViT achieves stable, interpretable, and competitive performance with up to one order of magnitude fewer parameters, surpassing prior ODE-based Transformer approaches in classification tasks. We further propose a plug-and-play teacher-student framework in which a discrete ViT guides the continuous trajectory of ODE-ViT by treating the intermediate representations of the teacher as solutions of the ODE. This strategy improves performance by more than 10% compared to training a free ODE-ViT from scratch."}
{"id": "2511.16512", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16512", "abs": "https://arxiv.org/abs/2511.16512", "authors": ["Nicholas Pellegrino", "David Szczecina", "Paul Fieguth"], "title": "Loss Functions Robust to the Presence of Label Errors", "comment": "6 pages, 6 figures, Presented at the 10th Annual Conference on Vision and Intelligent Systems (2024)", "summary": "Methods for detecting label errors in training data require models that are robust to label errors (i.e., not fit to erroneously labelled data points). However, acquiring such models often involves training on corrupted data, which presents a challenge. Adjustments to the loss function present an opportunity for improvement. Motivated by Focal Loss (which emphasizes difficult-to-classify samples), two novel, yet simple, loss functions are proposed that de-weight or ignore these difficult samples (i.e., those likely to have label errors). Results on artificially corrupted data show promise, such that F1 scores for detecting errors are improved from the baselines of conventional categorical Cross Entropy and Focal Loss."}
{"id": "2511.16520", "categories": ["cs.LG", "eess.IV"], "pdf": "https://arxiv.org/pdf/2511.16520", "abs": "https://arxiv.org/abs/2511.16520", "authors": ["Yuxiang Wan", "Ryan Devera", "Wenjie Zhang", "Ju Sun"], "title": "Saving Foundation Flow-Matching Priors for Inverse Problems", "comment": null, "summary": "Foundation flow-matching (FM) models promise a universal prior for solving inverse problems (IPs), yet today they trail behind domain-specific or even untrained priors. How can we unlock their potential? We introduce FMPlug, a plug-in framework that redefines how foundation FMs are used in IPs. FMPlug combines an instance-guided, time-dependent warm-start strategy with a sharp Gaussianity regularization, adding problem-specific guidance while preserving the Gaussian structures. This leads to a significant performance boost across image restoration and scientific IPs. Our results point to a path for making foundation FM models practical, reusable priors for IP solving."}
{"id": "2511.16523", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16523", "abs": "https://arxiv.org/abs/2511.16523", "authors": ["Ming-Lun Lee", "Fu-Shiang Yang", "Cheng-Kuan Lin", "Yan-Ann Chen", "Chih-Yu Lin", "Yu-Chee Tseng"], "title": "Dynamic Participation in Federated Learning: Benchmarks and a Knowledge Pool Plugin", "comment": null, "summary": "Federated learning (FL) enables clients to collaboratively train a shared model in a distributed manner, setting it apart from traditional deep learning paradigms. However, most existing FL research assumes consistent client participation, overlooking the practical scenario of dynamic participation (DPFL), where clients may intermittently join or leave during training. Moreover, no existing benchmarking framework systematically supports the study of DPFL-specific challenges. In this work, we present the first open-source framework explicitly designed for benchmarking FL models under dynamic client participation. Our framework provides configurable data distributions, participation patterns, and evaluation metrics tailored to DPFL scenarios. Using this platform, we benchmark four major categories of widely adopted FL models and uncover substantial performance degradation under dynamic participation. To address these challenges, we further propose Knowledge-Pool Federated Learning (KPFL), a generic plugin that maintains a shared knowledge pool across both active and idle clients. KPFL leverages dual-age and data-bias weighting, combined with generative knowledge distillation, to mitigate instability and prevent knowledge loss. Extensive experiments demonstrate the significant impact of dynamic participation on FL performance and the effectiveness of KPFL in improving model robustness and generalization."}
{"id": "2511.16549", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16549", "abs": "https://arxiv.org/abs/2511.16549", "authors": ["Yuanbo Guo", "Jun Xia", "Yiyu Shi"], "title": "FairLRF: Achieving Fairness through Sparse Low Rank Factorization", "comment": null, "summary": "As deep learning (DL) techniques become integral to various applications, ensuring model fairness while maintaining high performance has become increasingly critical, particularly in sensitive fields such as medical diagnosis. Although a variety of bias-mitigation methods have been proposed, many rely on computationally expensive debiasing strategies or suffer substantial drops in model accuracy, which limits their practicality in real-world, resource-constrained settings. To address this issue, we propose a fairness-oriented low rank factorization (LRF) framework that leverages singular value decomposition (SVD) to improve DL model fairness. Unlike traditional SVD, which is mainly used for model compression by decomposing and reducing weight matrices, our work shows that SVD can also serve as an effective tool for fairness enhancement. Specifically, we observed that elements in the unitary matrices obtained from SVD contribute unequally to model bias across groups defined by sensitive attributes. Motivated by this observation, we propose a method, named FairLRF, that selectively removes bias-inducing elements from unitary matrices to reduce group disparities, thus enhancing model fairness. Extensive experiments show that our method outperforms conventional LRF methods as well as state-of-the-art fairness-enhancing techniques. Additionally, an ablation study examines how major hyper-parameters may influence the performance of processed models. To the best of our knowledge, this is the first work utilizing SVD not primarily for compression but for fairness enhancement."}
{"id": "2511.16550", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16550", "abs": "https://arxiv.org/abs/2511.16550", "authors": ["Han Su", "Zhongyan Li", "Wanquan Liu"], "title": "Broad stochastic configuration residual learning system for norm-convergent universal approximation", "comment": null, "summary": "Universal approximation serves as the foundation of neural network learning algorithms. However, some networks establish their universal approximation property by demonstrating that the iterative errors converge in probability measure rather than the more rigorous norm convergence, which makes the universal approximation property of randomized learning networks highly sensitive to random parameter selection, Broad residual learning system (BRLS), as a member of randomized learning models, also encounters this issue. We theoretically demonstrate the limitation of its universal approximation property, that is, the iterative errors do not satisfy norm convergence if the selection of random parameters is inappropriate and the convergence rate meets certain conditions. To address this issue, we propose the broad stochastic configuration residual learning system (BSCRLS) algorithm, which features a novel supervisory mechanism adaptively constraining the range settings of random parameters on the basis of BRLS framework, Furthermore, we prove the universal approximation theorem of BSCRLS based on the more stringent norm convergence. Three versions of incremental BSCRLS algorithms are presented to satisfy the application requirements of various network updates. Solar panels dust detection experiments are performed on publicly available dataset and compared with 13 deep and broad learning algorithms. Experimental results reveal the effectiveness and superiority of BSCRLS algorithms."}
{"id": "2511.16551", "categories": ["cs.LG", "stat.AP", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.16551", "abs": "https://arxiv.org/abs/2511.16551", "authors": ["Perrine Chassat", "Van Tuan Nguyen", "Lucas Ducrot", "Emilie Lanoy", "Agathe Guilloux"], "title": "Toward Valid Generative Clinical Trial Data with Survival Endpoints", "comment": "P. Chassat and V.T. Nguyen contributed equally to this work", "summary": "Clinical trials face mounting challenges: fragmented patient populations, slow enrollment, and unsustainable costs, particularly for late phase trials in oncology and rare diseases. While external control arms built from real-world data have been explored, a promising alternative is the generation of synthetic control arms using generative AI. A central challenge is the generation of time-to-event outcomes, which constitute primary endpoints in oncology and rare disease trials, but are difficult to model under censoring and small sample sizes. Existing generative approaches, largely GAN-based, are data-hungry, unstable, and rely on strong assumptions such as independent censoring. We introduce a variational autoencoder (VAE) that jointly generates mixed-type covariates and survival outcomes within a unified latent variable framework, without assuming independent censoring. Across synthetic and real trial datasets, we evaluate our model in two realistic scenarios: (i) data sharing under privacy constraints, where synthetic controls substitute for original data, and (ii) control-arm augmentation, where synthetic patients mitigate imbalances between treated and control groups. Our method outperforms GAN baselines on fidelity, utility, and privacy metrics, while revealing systematic miscalibration of type I error and power. We propose a post-generation selection procedure that improves calibration, highlighting both progress and open challenges for generative survival modeling."}
{"id": "2511.16571", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16571", "abs": "https://arxiv.org/abs/2511.16571", "authors": ["Md. Tawfique Ihsan", "Md. Rakibul Hasan Rafi", "Ahmed Shoyeb Raihan", "Imtiaz Ahmed", "Abdullahil Azeem"], "title": "Boosting Predictive Performance on Tabular Data through Data Augmentation with Latent-Space Flow-Based Diffusion", "comment": "35 Pages", "summary": "Severe class imbalance is common in real-world tabular learning, where rare but important minority classes are essential for reliable prediction. Existing generative oversampling methods such as GANs, VAEs, and diffusion models can improve minority-class performance, but they often struggle with tabular heterogeneity, training stability, and privacy concerns. We propose a family of latent-space, tree-driven diffusion methods for minority oversampling that use conditional flow matching with gradient-boosted trees as the vector-field learner. The models operate in compact latent spaces to preserve tabular structure and reduce computation. We introduce three variants: PCAForest, which uses linear PCA embedding; EmbedForest, which uses a learned nonlinear embedding; and AttentionForest, which uses an attention-augmented embedding. Each method couples a GBT-based flow with a decoder back to the original feature space. Across 11 datasets from healthcare, finance, and manufacturing, AttentionForest achieves the best average minority recall while maintaining competitive precision, calibration, and distributional similarity. PCAForest and EmbedForest reach similar utility with much faster generation, offering favorable accuracy-efficiency trade-offs. Privacy evaluated with nearest-neighbor distance ratio and distance-to-closest-record is comparable to or better than the ForestDiffusion baseline. Ablation studies show that smaller embeddings tend to improve minority recall, while aggressive learning rates harm stability. Overall, latent-space, tree-driven diffusion provides an efficient and privacy-aware approach to high-fidelity tabular data augmentation under severe class imbalance."}
{"id": "2511.16575", "categories": ["cs.LG", "cs.AI", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.16575", "abs": "https://arxiv.org/abs/2511.16575", "authors": ["Fares Fourati", "Mohamed-Slim Alouini", "Vaneet Aggarwal"], "title": "ECPv2: Fast, Efficient, and Scalable Global Optimization of Lipschitz Functions", "comment": "Accepted at AAAI 2026 (main technical track), extended version", "summary": "We propose ECPv2, a scalable and theoretically grounded algorithm for global optimization of Lipschitz-continuous functions with unknown Lipschitz constants. Building on the Every Call is Precious (ECP) framework, which ensures that each accepted function evaluation is potentially informative, ECPv2 addresses key limitations of ECP, including high computational cost and overly conservative early behavior. ECPv2 introduces three innovations: (i) an adaptive lower bound to avoid vacuous acceptance regions, (ii) a Worst-m memory mechanism that restricts comparisons to a fixed-size subset of past evaluations, and (iii) a fixed random projection to accelerate distance computations in high dimensions. We theoretically show that ECPv2 retains ECP's no-regret guarantees with optimal finite-time bounds and expands the acceptance region with high probability. We further empirically validate these findings through extensive experiments and ablation studies. Using principled hyperparameter settings, we evaluate ECPv2 across a wide range of high-dimensional, non-convex optimization problems. Across benchmarks, ECPv2 consistently matches or outperforms state-of-the-art optimizers, while significantly reducing wall-clock time."}
{"id": "2511.16587", "categories": ["cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2511.16587", "abs": "https://arxiv.org/abs/2511.16587", "authors": ["Amartya Mukherjee", "Jun Liu"], "title": "Almost Sure Convergence Analysis of Differentially Private Stochastic Gradient Methods", "comment": "6 pages", "summary": "Differentially private stochastic gradient descent (DP-SGD) has become the standard algorithm for training machine learning models with rigorous privacy guarantees. Despite its widespread use, the theoretical understanding of its long-run behavior remains limited: existing analyses typically establish convergence in expectation or with high probability, but do not address the almost sure convergence of single trajectories. In this work, we prove that DP-SGD converges almost surely under standard smoothness assumptions, both in nonconvex and strongly convex settings, provided the step sizes satisfy some standard decaying conditions. Our analysis extends to momentum variants such as the stochastic heavy ball (DP-SHB) and Nesterov's accelerated gradient (DP-NAG), where we show that careful energy constructions yield similar guarantees. These results provide stronger theoretical foundations for differentially private optimization and suggest that, despite privacy-induced distortions, the algorithm remains pathwise stable in both convex and nonconvex regimes."}
{"id": "2511.16592", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16592", "abs": "https://arxiv.org/abs/2511.16592", "authors": ["Daniil Tiapkin", "Artem Agarkov", "Nikita Morozov", "Ian Maksimov", "Askar Tsyganov", "Timofei Gritsaev", "Sergey Samsonov"], "title": "gfnx: Fast and Scalable Library for Generative Flow Networks in JAX", "comment": "GitHub: https://github.com/d-tiapkin/gfnx | Documentation: https://gfnx.readthedocs.io", "summary": "In this paper, we present gfnx, a fast and scalable package for training and evaluating Generative Flow Networks (GFlowNets) written in JAX. gfnx provides an extensive set of environments and metrics for benchmarking, accompanied with single-file implementations of core objectives for training GFlowNets. We include synthetic hypergrids, multiple sequence generation environments with various editing regimes and particular reward designs for molecular generation, phylogenetic tree construction, Bayesian structure learning, and sampling from the Ising model energy. Across different tasks, gfnx achieves significant wall-clock speedups compared to Pytorch-based benchmarks (such as torchgfn library) and author implementations. For example, gfnx achieves up to 55 times speedup on CPU-based sequence generation environments, and up to 80 times speedup with the GPU-based Bayesian network structure learning setup. Our package provides a diverse set of benchmarks and aims to standardize empirical evaluation and accelerate research and applications of GFlowNets. The library is available on GitHub (https://github.com/d-tiapkin/gfnx) and on pypi (https://pypi.org/project/gfnx/). Documentation is available on https://gfnx.readthedocs.io."}
{"id": "2511.16596", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.16596", "abs": "https://arxiv.org/abs/2511.16596", "authors": ["Zohar Rimon", "Elisei Shafer", "Tal Tepper", "Efrat Shimron", "Aviv Tamar"], "title": "Toward Artificial Palpation: Representation Learning of Touch on Soft Bodies", "comment": null, "summary": "Palpation, the use of touch in medical examination, is almost exclusively performed by humans. We investigate a proof of concept for an artificial palpation method based on self-supervised learning. Our key idea is that an encoder-decoder framework can learn a $\\textit{representation}$ from a sequence of tactile measurements that contains all the relevant information about the palpated object. We conjecture that such a representation can be used for downstream tasks such as tactile imaging and change detection. With enough training data, it should capture intricate patterns in the tactile measurements that go beyond a simple map of forces -- the current state of the art. To validate our approach, we both develop a simulation environment and collect a real-world dataset of soft objects and corresponding ground truth images obtained by magnetic resonance imaging (MRI). We collect palpation sequences using a robot equipped with a tactile sensor, and train a model that predicts sensory readings at different positions on the object. We investigate the representation learned in this process, and demonstrate its use in imaging and change detection."}
{"id": "2511.16629", "categories": ["cs.LG", "cs.AI", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16629", "abs": "https://arxiv.org/abs/2511.16629", "authors": ["Shihab Ahmed", "El Houcine Bergou", "Aritra Dutta", "Yue Wang"], "title": "Stabilizing Policy Gradient Methods via Reward Profiling", "comment": null, "summary": "Policy gradient methods, which have been extensively studied in the last decade, offer an effective and efficient framework for reinforcement learning problems. However, their performances can often be unsatisfactory, suffering from unreliable reward improvements and slow convergence, due to high variance in gradient estimations. In this paper, we propose a universal reward profiling framework that can be seamlessly integrated with any policy gradient algorithm, where we selectively update the policy based on high-confidence performance estimations. We theoretically justify that our technique will not slow down the convergence of the baseline policy gradient methods, but with high probability, will result in stable and monotonic improvements of their performance. Empirically, on eight continuous-control benchmarks (Box2D and MuJoCo/PyBullet), our profiling yields up to 1.5x faster convergence to near-optimal returns, up to 1.75x reduction in return variance on some setups. Our profiling approach offers a general, theoretically grounded path to more reliable and efficient policy learning in complex environments."}
{"id": "2511.16652", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.16652", "abs": "https://arxiv.org/abs/2511.16652", "authors": ["Bidipta Sarkar", "Mattie Fellows", "Juan Agustin Duque", "Alistair Letcher", "Antonio León Villares", "Anya Sims", "Dylan Cope", "Jarek Liesen", "Lukas Seier", "Theo Wolf", "Uljad Berdica", "Alexander David Goldie", "Aaron Courville", "Karin Sevegnani", "Shimon Whiteson", "Jakob Nicolaus Foerster"], "title": "Evolution Strategies at the Hyperscale", "comment": "48 pages, 12 figures, Website at https://eshyperscale.github.io/", "summary": "We introduce Evolution Guided General Optimization via Low-rank Learning (EGGROLL), an evolution strategies (ES) algorithm designed to scale backprop-free optimization to large population sizes for modern large neural network architectures with billions of parameters. ES is a set of powerful blackbox optimisation methods that can handle non-differentiable or noisy objectives with excellent scaling potential through parallelisation. Na{ï}ve ES becomes prohibitively expensive at scale due to the computational and memory costs associated with generating matrix perturbations $E\\in\\mathbb{R}^{m\\times n}$ and the batched matrix multiplications needed to compute per-member forward passes. EGGROLL overcomes these bottlenecks by generating random matrices $A\\in \\mathbb{R}^{m\\times r},\\ B\\in \\mathbb{R}^{n\\times r}$ with $r\\ll \\min(m,n)$ to form a low-rank matrix perturbation $A B^\\top$ that are used in place of the full-rank perturbation $E$. As the overall update is an average across a population of $N$ workers, this still results in a high-rank update but with significant memory and computation savings, reducing the auxiliary storage from $mn$ to $r(m+n)$ per layer and the cost of a forward pass from $\\mathcal{O}(mn)$ to $\\mathcal{O}(r(m+n))$ when compared to full-rank ES. A theoretical analysis reveals our low-rank update converges to the full-rank update at a fast $\\mathcal{O}\\left(\\frac{1}{r}\\right)$ rate. Our experiments show that (1) EGGROLL does not compromise the performance of ES in tabula-rasa RL settings, despite being faster, (2) it is competitive with GRPO as a technique for improving LLM reasoning, and (3) EGGROLL enables stable pre-training of nonlinear recurrent language models that operate purely in integer datatypes."}
{"id": "2511.16665", "categories": ["cs.LG", "cs.AI", "cs.DC"], "pdf": "https://arxiv.org/pdf/2511.16665", "abs": "https://arxiv.org/abs/2511.16665", "authors": ["Qinghao Hu", "Shang Yang", "Junxian Guo", "Xiaozhe Yao", "Yujun Lin", "Yuxian Gu", "Han Cai", "Chuang Gan", "Ana Klimovic", "Song Han"], "title": "Taming the Long-Tail: Efficient Reasoning RL Training with Adaptive Drafter", "comment": null, "summary": "The emergence of Large Language Models (LLMs) with strong reasoning capabilities marks a significant milestone, unlocking new frontiers in complex problem-solving. However, training these reasoning models, typically using Reinforcement Learning (RL), encounters critical efficiency bottlenecks: response generation during RL training exhibits a persistent long-tail distribution, where a few very long responses dominate execution time, wasting resources and inflating costs. To address this, we propose TLT, a system that accelerates reasoning RL training losslessly by integrating adaptive speculative decoding. Applying speculative decoding in RL is challenging due to the dynamic workloads, evolving target model, and draft model training overhead. TLT overcomes these obstacles with two synergistic components: (1) Adaptive Drafter, a lightweight draft model trained continuously on idle GPUs during long-tail generation to maintain alignment with the target model at no extra cost; and (2) Adaptive Rollout Engine, which maintains a memory-efficient pool of pre-captured CUDAGraphs and adaptively select suitable SD strategies for each input batch. Evaluations demonstrate that TLT achieves over 1.7x end-to-end RL training speedup over state-of-the-art systems, preserves the model accuracy, and yields a high-quality draft model as a free byproduct suitable for efficient deployment. Code is released at https://github.com/mit-han-lab/fastrl."}
{"id": "2511.15902", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15902", "abs": "https://arxiv.org/abs/2511.15902", "authors": ["Roman Dolgopolyi", "Antonis Chatzipanagiotou"], "title": "EEG Emotion Recognition Through Deep Learning", "comment": "This version corresponds to the original manuscript submitted to the 22nd EMCIS conference prior to peer review. The peer-reviewed and accepted version will appear in the Springer conference proceedings", "summary": "An advanced emotion classification model was developed using a CNN-Transformer architecture for emotion recognition from EEG brain wave signals, effectively distinguishing among three emotional states, positive, neutral and negative. The model achieved a testing accuracy of 91%, outperforming traditional models such as SVM, DNN, and Logistic Regression. Training was conducted on a custom dataset created by merging data from SEED, SEED-FRA, and SEED-GER repositories, comprising 1,455 samples with EEG recordings labeled according to emotional states. The combined dataset represents one of the largest and most culturally diverse collections available. Additionally, the model allows for the reduction of the requirements of the EEG apparatus, by leveraging only 5 electrodes of the 62. This reduction demonstrates the feasibility of deploying a more affordable consumer-grade EEG headset, thereby enabling accessible, at-home use, while also requiring less computational power. This advancement sets the groundwork for future exploration into mood changes induced by media content consumption, an area that remains underresearched. Integration into medical, wellness, and home-health platforms could enable continuous, passive emotional monitoring, particularly beneficial in clinical or caregiving settings where traditional behavioral cues, such as facial expressions or vocal tone, are diminished, restricted, or difficult to interpret, thus potentially transforming mental health diagnostics and interventions..."}
{"id": "2511.15990", "categories": ["cs.CR", "cs.CY", "cs.DC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15990", "abs": "https://arxiv.org/abs/2511.15990", "authors": ["Osama Zafar", "Rosemarie Santa González", "Alfonso Morales", "Erman Ayday"], "title": "Digital Agriculture Sandbox for Collaborative Research", "comment": "Presents a privacy-preserving digital agriculture platform using federated learning, differential privacy, and secure data analysis to enable collaboration between farmers and researchers without exposing raw data. Demonstrates secure similarity search, model training, and risk-aware data sharing", "summary": "Digital agriculture is transforming the way we grow food by utilizing technology to make farming more efficient, sustainable, and productive. This modern approach to agriculture generates a wealth of valuable data that could help address global food challenges, but farmers are hesitant to share it due to privacy concerns. This limits the extent to which researchers can learn from this data to inform improvements in farming. This paper presents the Digital Agriculture Sandbox, a secure online platform that solves this problem. The platform enables farmers (with limited technical resources) and researchers to collaborate on analyzing farm data without exposing private information. We employ specialized techniques such as federated learning, differential privacy, and data analysis methods to safeguard the data while maintaining its utility for research purposes. The system enables farmers to identify similar farmers in a simplified manner without needing extensive technical knowledge or access to computational resources. Similarly, it enables researchers to learn from the data and build helpful tools without the sensitive information ever leaving the farmer's system. This creates a safe space where farmers feel comfortable sharing data, allowing researchers to make important discoveries. Our platform helps bridge the gap between maintaining farm data privacy and utilizing that data to address critical food and farming challenges worldwide."}
{"id": "2511.16192", "categories": ["cs.CR", "cs.ET", "cs.LG", "cs.SI"], "pdf": "https://arxiv.org/pdf/2511.16192", "abs": "https://arxiv.org/abs/2511.16192", "authors": ["Andrea Venturi", "Imanol Jerico-Yoldi", "Francesco Zola", "Raul Orduna"], "title": "ART: A Graph-based Framework for Investigating Illicit Activity in Monero via Address-Ring-Transaction Structures", "comment": "Paper accepted @ BLOCKCHAIN & CRYPTOCURRENCY CONFERENCE (B2C'2025)", "summary": "As Law Enforcement Agencies advance in cryptocurrency forensics, criminal actors aiming to conceal illicit fund movements increasingly turn to \"mixin\" services or privacy-based cryptocurrencies. Monero stands out as a leading choice due to its strong privacy preserving and untraceability properties, making conventional blockchain analysis ineffective. Understanding the behavior and operational patterns of criminal actors within Monero is therefore challenging and it is essential to support future investigative strategies and disrupt illicit activities. In this work, we propose a case study in which we leverage a novel graph-based methodology to extract structural and temporal patterns from Monero transactions linked to already discovered criminal activities. By building Address-Ring-Transaction graphs from flagged transactions, we extract structural and temporal features and use them to train Machine Learning models capable of detecting similar behavioral patterns that could highlight criminal modus operandi. This represents a first partial step toward developing analytical tools that support investigative efforts in privacy-preserving blockchain ecosystems"}
{"id": "2511.16346", "categories": ["eess.SP", "cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.16346", "abs": "https://arxiv.org/abs/2511.16346", "authors": ["Deniz Kasap", "Taraneh Aminosharieh Najafi", "Jérôme Paul Rémy Thevenot", "Jonathan Dan", "Stefano Albini", "David Atienza"], "title": "VersaPants: A Loose-Fitting Textile Capacitive Sensing System for Lower-Body Motion Capture", "comment": "14 pages, 8 figures", "summary": "We present VersaPants, the first loose-fitting, textile-based capacitive sensing system for lower-body motion capture, built on the open-hardware VersaSens platform. By integrating conductive textile patches and a compact acquisition unit into a pair of pants, the system reconstructs lower-body pose without compromising comfort. Unlike IMU-based systems that require user-specific fitting or camera-based methods that compromise privacy, our approach operates without fitting adjustments and preserves user privacy. VersaPants is a custom-designed smart garment featuring 6 capacitive channels per leg. We employ a lightweight Transformer-based deep learning model that maps capacitance signals to joint angles, enabling embedded implementation on edge platforms. To test our system, we collected approximately 3.7 hours of motion data from 11 participants performing 16 daily and exercise-based movements. The model achieves a mean per-joint position error (MPJPE) of 11.96 cm and a mean per-joint angle error (MPJAE) of 12.3 degrees across the hip, knee, and ankle joints, indicating the model's ability to generalize to unseen users and movements. A comparative analysis of existing textile-based deep learning architectures reveals that our model achieves competitive reconstruction performance with up to 22 times fewer parameters and 18 times fewer FLOPs, enabling real-time inference at 42 FPS on a commercial smartwatch without quantization. These results position VersaPants as a promising step toward scalable, comfortable, and embedded motion-capture solutions for fitness, healthcare, and wellbeing applications."}
