{"id": "2510.15070", "categories": ["eess.SP", "math.DG", "94A14, 94A12, 14M15, 53C22"], "pdf": "https://arxiv.org/pdf/2510.15070", "abs": "https://arxiv.org/abs/2510.15070", "authors": ["Álvaro Pendás-Recondo", "Enrique Pendás-Recondo"], "title": "A Structured Family of Grassmannian Constellations via Geodesic Mapping for MIMO Noncoherent Communications", "comment": "13 pages, 7 figures", "summary": "This work presents a novel structured family of Grassmannian constellations\nfor multiple-input multiple-output (MIMO) noncoherent communications over\nRayleigh block-fading channels, where neither the transmitter nor the receiver\nhas channel state information (CSI). The proposed constellation design is built\nupon the geodesic curves of the Grassmann manifold, thereby exploiting its\nunderlying geometric structure. The resulting solution is limited in spectral\nefficiency (with a maximum constellation size of $4M^2$ points, where $M$ is\nthe number of transmit antennas), targeting a rate in the range of $0.25$-$1$\nbps/Hz. However, all space-time matrices resulting from this design exhibit the\nremarkable property of having a single nonzero entry per row, meaning that only\none transmit antenna is active per time slot. This property significantly\nreduces hardware complexity and implementation cost, while also lowering power\nconsumption, as only a single power amplifier is required for transmission.\nFurthermore, within the constellation size limits, the proposed design achieves\nerror performance comparable to state-of-the-art optimization-based\nunstructured designs, as validated through symbol error rate (SER) numerical\nresults. It also enables simple yet effective bit labeling, confirmed by\ncomparisons of bit error rate (BER) and SER, and reduces the computational\ncomplexity of the maximum-likelihood (ML) detector for Grassmannian\nconstellations by a factor of $M$."}
{"id": "2510.15195", "categories": ["eess.SP", "cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15195", "abs": "https://arxiv.org/abs/2510.15195", "authors": ["Nishant Mehrotra", "Sandesh Rao Mattu", "Robert Calderbank"], "title": "Pulse Shaping Filter Design for Integrated Sensing & Communication with Zak-OTFS", "comment": "6 pages, 3 figures, to be submitted to IEEE for possible publication", "summary": "Zak-OTFS is an emerging framework for integrated sensing & communication\n(ISAC) in high delay and Doppler spread environments. A critical enabler for\nISAC with Zak-OTFS is the design of pulse shaping filters. For sensing, a\nlocalized pulse shaping filter enables ideal input-output (I/O) relation\nestimates close to the physical scattering channel. For communication,\northogonality of the pulse shape on the information lattice prevents\ninter-symbol interference, and no time and bandwidth expansion enables full\nspectral efficiency. A filter simultaneously meeting all three objectives is\nideal for ISAC. Existing filter designs achieve two of the above objectives,\nbut not all three simultaneously. For instance, the sinc filter is orthogonal\nand bandwidth/time-limited, but is not localized. The Gaussian filter is\nlocalized and bandwidth/time-limited, but not orthogonal. The RRC filter is\nlocalized and orthogonal, but not bandwidth/time-limited. A recently proposed\nhybrid Gaussian-sinc filter is more localized than the sinc filter and\nbandwidth/time-limited, but is not orthogonal. In this work, we design optimal\npulse shaping filters meeting all three objectives via the Isotropic Orthogonal\nTransform Algorithm. The proposed pulse shaping filters offer improved data\ndetection (communication) and I/O relation estimation (sensing) performance\ncompared to existing filter choices in the literature."}
{"id": "2510.15278", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15278", "abs": "https://arxiv.org/abs/2510.15278", "authors": ["Heyao Zhu", "Yimeng Zhao", "Zirui Zhang", "Huansheng Yi", "Chenbin Gao", "Canhua Xu", "Jianqi Wang", "Fugui Qi"], "title": "Multidimensional Physiology-Inspired Enhanced Vital Sign Monitoring Using MIMO mmWave Bio-radar", "comment": null, "summary": "With the intensiffcation of population aging and increasing burden of chronic\ndiseases, the demand for vital signs monitoring is becoming increasingly\nurgent. A key challenge facing current non-contact detection technologies using\nmillimeter wave (mmWave) radar is the low efffciency of multi-channel signal\nfusion in array radar systems based on equal weighting. To address this\nchallenge, this paper proposes a vital sign enhancement detection method for\nmultiple input and multiple output (MIMO) bio-radar, driven by multidimensional\nphysiological characteristics, which overcomes traditional limitations through\na two-stage fusion strategy. Stage 1: Enhanced Vital Sign Detection Using\nSingle-Channel Signals Based on Physiological Characteristics. First, a chest\nwall multi-scattering point model is constructed. For single channel\ntime-distance two-dimensional echo signals, effective range bins are selected\nbased on the respiratory/cardiac physiological frequency band energy ratio, and\nthe signal-to-noise ratio (SNR) of respiration/heart signals is enhanced using\nphase-aligned maximal ratio combining (MRC). Stage 2: Multi-Channel Fusion\nBased on Organ Radiation Spatial Distribution Characteristics. The spatial\nradiation characteristics of cardiopulmonary organs are introduced for the\nffrst time as the theoretical foundation for SNR-based channel screening,\nchannel attribute identiffcation, and multi-channel weighted fusion. Then, we\npropose a template matching method to extract respiratory rate (RR) and heart\nrate (HR) by adopting physical models of respiration and cardiac activities.\nThe experimental results demonstrate the existence of the spatial distribution\ncharacteristics of organ radiation. In addition, we analyzed the impact of\ndistance and state on the algorithm from these two aspects."}
{"id": "2510.15457", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15457", "abs": "https://arxiv.org/abs/2510.15457", "authors": ["Chunhui Li", "Chengrui Wang", "Zhiqiang Yuan", "Wei Fan"], "title": "Multi-Target Flexible Angular Emulation for ISAC Base Station Testing Using a Conductive Amplitude and Phase Matrix Setup: Framework and Experimental Validation", "comment": null, "summary": "Comprehensive evaluation of the functionalities, algorithms, hardware\ncomponents, and performance characteristics of future integrated sensing and\ncommunication (ISAC) base stations (BSs) under realistic deployment scenarios\nin controlled laboratory environments represents a critical requirement for\nISAC technology advancement. A primary challenge in achieving this objective\ninvolves the emulation of multiple targets with arbitrary radar cross-section\n(RCS), range, angle, and Doppler profiles for ISAC BS equipped with large-scale\nantenna arrays using radar target simulator (RTS) with limited interface ports.\nIn this work, we introduce a simple yet highly effective and practical\nconductive amplitude and phase matrix framework to address this fundamental\nchallenge. The core concept involves introducing a tunable conductive amplitude\nand phase modulation network in the test configuration between the ISAC BS\nunder test and a RTS. Based on this structure, we subsequently investigate the\ncorresponding configurations for different sensing operational modes of ISAC\nBSs, specifically the array duplex transmission and reception (ADTR) mode and\nthe split-array transmission and reception (SATR) mode. For experimental\nvalidation, we design two distinct monostatic sensing scenarios to demonstrate\nthe framework capabilities across both operational modes. The first scenario\ninvolves dynamic multi-drone sensing validation for ADTR mode operation, while\nthe second scenario addresses static single-drone sensing for SATR mode\nvalidation. The experimental results demonstrate that the proposed framework\ncan accurately emulate the joint RCS, range, velocity, and angular\ncharacteristics of multiple sensing targets within the conductive test\nenvironment, highlighting its significant potential for testing applications in\nsub-6 GHz ISAC BS development and validation."}
{"id": "2510.15109", "categories": ["cs.NI", "cs.AI", "cs.DC", "cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15109", "abs": "https://arxiv.org/abs/2510.15109", "authors": ["Utku Demir", "Tugba Erpek", "Yalin E. Sagduyu", "Sastry Kompella", "Mengran Xue"], "title": "Targeted Attacks and Defenses for Distributed Federated Learning in Vehicular Networks", "comment": null, "summary": "In emerging networked systems, mobile edge devices such as ground vehicles\nand unmanned aerial system (UAS) swarms collectively aggregate vast amounts of\ndata to make machine learning decisions such as threat detection in remote,\ndynamic, and infrastructure-constrained environments where power and bandwidth\nare scarce. Federated learning (FL) addresses these constraints and privacy\nconcerns by enabling nodes to share local model weights for deep neural\nnetworks instead of raw data, facilitating more reliable decision-making than\nindividual learning. However, conventional FL relies on a central server to\ncoordinate model updates in each learning round, which imposes significant\ncomputational burdens on the central node and may not be feasible due to the\nconnectivity constraints. By eliminating dependence on a central server,\ndistributed federated learning (DFL) offers scalability, resilience to node\nfailures, learning robustness, and more effective defense strategies. Despite\nthese advantages, DFL remains vulnerable to increasingly advanced and stealthy\ncyberattacks. In this paper, we design sophisticated targeted training data\npoisoning and backdoor (Trojan) attacks, and characterize the emerging\nvulnerabilities in a vehicular network. We analyze how DFL provides resilience\nagainst such attacks compared to individual learning and present effective\ndefense mechanisms to further strengthen DFL against the emerging cyber\nthreats."}
{"id": "2510.15099", "categories": ["cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15099", "abs": "https://arxiv.org/abs/2510.15099", "authors": ["Ravin Kumar"], "title": "Adaptive Base Representation Theorem: An Alternative to Binary Number System", "comment": "14 pages, 2 figures, 4 tables", "summary": "This paper introduces the Adaptive Base Representation (ABR) Theorem and\nproposes a novel number system that offers a structured alternative to the\nbinary number system for digital computers. The ABR number system enables each\ndecimal number to be represented uniquely and using the same number of bits,\n$n$, as the binary encoding. Theoretical foundations and mathematical\nformulations demonstrate that ABR can encode the same integer range as binary,\nvalidating its potential as a viable alternative. Additionally, the ABR number\nsystem is compatible with existing data compression algorithms like Huffman\ncoding and arithmetic coding, as well as error detection and correction\nmechanisms such as Hamming codes. We further explore practical applications,\nincluding digital steganography, to illustrate the utility of ABR in\ninformation theory and digital encoding, suggesting that the ABR number system\ncould inspire new approaches in digital data representation and computational\ndesign."}
{"id": "2510.14991", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.14991", "abs": "https://arxiv.org/abs/2510.14991", "authors": ["Cade Houston Kennedy", "Amr Hilal", "Morteza Momeni"], "title": "The Role of Federated Learning in Improving Financial Security: A Survey", "comment": "8 pages, 2 figures, 1 tables, accepted at 2025 IEEE Global Conference\n  on Artificial Intelligence and Internet of Things", "summary": "With the growth of digital financial systems, robust security and privacy\nhave become a concern for financial institutions. Even though traditional\nmachine learning models have shown to be effective in fraud detections, they\noften compromise user data by requiring centralized access to sensitive\ninformation. In IoT-enabled financial endpoints such as ATMs and POS Systems\nthat regularly produce sensitive data that is sent over the network. Federated\nLearning (FL) offers a privacy-preserving, decentralized model training across\ninstitutions without sharing raw data. FL enables cross-silo collaboration\namong banks while also using cross-device learning on IoT endpoints. This\nsurvey explores the role of FL in enhancing financial security and introduces a\nnovel classification of its applications based on regulatory and compliance\nexposure levels ranging from low-exposure tasks such as collaborative portfolio\noptimization to high-exposure tasks like real-time fraud detection. Unlike\nprior surveys, this work reviews FL's practical use within financial systems,\ndiscussing its regulatory compliance and recent successes in fraud prevention\nand blockchain-integrated frameworks. However, FL deployment in finance is not\nwithout challenges. Data heterogeneity, adversarial attacks, and regulatory\ncompliance make implementation far from easy. This survey reviews current\ndefense mechanisms and discusses future directions, including blockchain\nintegration, differential privacy, secure multi-party computation, and\nquantum-secure frameworks. Ultimately, this work aims to be a resource for\nresearchers exploring FL's potential to advance secure, privacy-compliant\nfinancial systems."}
{"id": "2510.14983", "categories": ["cs.LG", "cs.HC", "cs.SY", "eess.SY"], "pdf": "https://arxiv.org/pdf/2510.14983", "abs": "https://arxiv.org/abs/2510.14983", "authors": ["Oskar Triebe", "Fletcher Passow", "Simon Wittner", "Leonie Wagner", "Julio Arend", "Tao Sun", "Chad Zanocco", "Marek Miltner", "Arezou Ghesmati", "Chen-Hao Tsai", "Christoph Bergmeir", "Ram Rajagopal"], "title": "Extending Load Forecasting from Zonal Aggregates to Individual Nodes for Transmission System Operators", "comment": "Collaborative Research, Stanford University and Midcontinent\n  Independent System Operator", "summary": "The reliability of local power grid infrastructure is challenged by\nsustainable energy developments increasing electric load uncertainty.\nTransmission System Operators (TSOs) need load forecasts of higher spatial\nresolution, extending current forecasting operations from zonal aggregates to\nindividual nodes. However, nodal loads are less accurate to forecast and\nrequire a large number of individual forecasts, which are hard to manage for\nthe human experts assessing risks in the control room's daily operations\n(operator). In collaboration with a TSO, we design a multi-level system that\nmeets the needs of operators for hourly day-ahead load forecasting. Utilizing a\nuniquely extensive dataset of zonal and nodal net loads, we experimentally\nevaluate our system components. First, we develop an interpretable and scalable\nforecasting model that allows for TSOs to gradually extend zonal operations to\ninclude nodal forecasts. Second, we evaluate solutions to address the\nheterogeneity and volatility of nodal load, subject to a trade-off. Third, our\nsystem is manageable with a fully parallelized single-model forecasting\nworkflow. Our results show accuracy and interpretability improvements for zonal\nforecasts, and substantial improvements for nodal forecasts. In practice, our\nmulti-level forecasting system allows operators to adjust forecasts with\nunprecedented confidence and accuracy, and to diagnose otherwise opaque errors\nprecisely."}
{"id": "2510.15045", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15045", "abs": "https://arxiv.org/abs/2510.15045", "authors": ["Ziqing Zhu"], "title": "Q-EnergyDEX: A Zero-Trust Distributed Energy Trading Framework Driven by Quantum Key Distribution and Blockchain", "comment": null, "summary": "The rapid decentralization and digitalization of local electricity markets\nhave introduced new cyber-physical vulnerabilities, including key leakage, data\ntampering, and identity spoofing. Existing blockchain-based solutions provide\ntransparency and traceability but still depend on classical cryptographic\nprimitives that are vulnerable to quantum attacks. To address these challenges,\nthis paper proposes Q-EnergyDEX, a zero-trust distributed energy trading\nframework driven by quantum key distribution and blockchain. The framework\nintegrates physical-layer quantum randomness with market-level operations,\nproviding an end-to-end quantum-secured infrastructure. A cloud-based Quantum\nKey Management Service continuously generates verifiable entropy and regulates\nkey generation through a rate-adaptive algorithm to sustain high-quality\nrandomness. A symmetric authentication protocol (Q-SAH) establishes secure and\nlow-latency sessions, while the quantum-aided consensus mechanism (PoR-Lite)\nachieves probabilistic ledger finality within a few seconds. Furthermore, a\nStackelberg-constrained bilateral auction couples market clearing with entropy\navailability, ensuring both economic efficiency and cryptographic security.\nSimulation results show that Q-EnergyDEX maintains robust key stability and\nnear-optimal social welfare, demonstrating its feasibility for large-scale\ndecentralized energy markets."}
{"id": "2510.15575", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15575", "abs": "https://arxiv.org/abs/2510.15575", "authors": ["Yi Tao", "Zhen Gao", "Zhuoran Li", "Ziwei Wan", "Tuan Li", "Chunli Zhu", "Lei Chen", "Guanghui Wen", "Dezhi Zheng", "Dusit Niyato"], "title": "Pseudo-Random TDM-MIMO FMCW Based Millimeter-Wave Sensing and Communication Integration for UAV Swarm", "comment": null, "summary": "The integrated sensing and communications (ISAC) can achieve the sharing of\nhardware and spectrum resources, enabling efficient data transmission and\nenvironmental sensing. This fusion is particularly important for unmanned\naerial vehicle (UAV) swarms, as it enhances the overall performance,\nflexibility, and efficiency of such systems. To facilitate the collaborative\noperations among UAVs, this paper proposes an ISAC solution based on the\npseudo-random time-division multiplexing (TDM)-multiple input multiple output\n(MIMO) millimeter-wave (mmWave) frequency modulated continuous wave (FMCW).\nSpecifically, a novel ISAC chirp waveform is proposed to modulate data in both\nthe delay domain and complex amplitude, while also possessing high-precision\nsensing capabilities. To address challenges in the TDM-MIMO, we utilize the\npseudo-random antenna selection and compressed sensing algorithms, ensuring\nthat the maximum unambiguous velocity is not compromised. Moreover, by\nemploying a chirp-division multiple access scheme, we propose an\ninterference-free multiple antenna transmission scheme to achieve dynamic\nallocation of time-frequency resources and multi-user transmission. Finally, we\npropose a communication and sensing fusion-based dynamic iterative computation\nscheme, simultaneously achieving data demodulation and sensing parameter\nestimation. Simulation results show that the proposed scheme can achieve ISAC\nunder the dynamic flight scenarios of UAVs. Meanwhile, the scheme outperforms\nthe mmWave-LoRadar in communication and sensing performance, yet its sensing\nperformance is slightly lower than that of the traditional FMCW. Under the\nurban clutter modeling, the scheme still maintains favorable robustness despite\na certain degree of performance degradation."}
{"id": "2510.15210", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2510.15210", "abs": "https://arxiv.org/abs/2510.15210", "authors": ["Chenrui Hu", "Ziyu Cheng", "Di Wu", "Yuxiao Wang", "Feng Liu", "Zhimin Qiu"], "title": "Structural Generalization for Microservice Routing Using Graph Neural Networks", "comment": null, "summary": "This paper focuses on intelligent routing in microservice systems and\nproposes an end-to-end optimization framework based on graph neural networks.\nThe goal is to improve routing decision efficiency and overall system\nperformance under complex topologies. The method models invocation\nrelationships among microservices as a graph. In this graph, service nodes and\ncommunication links are treated as graph nodes and edges. Multi-dimensional\nfeatures such as node states, link latency, and call frequency are used as\ninput. A multi-layer graph neural network is employed to perform high-order\ninformation aggregation and structural modeling. The model outputs a score for\neach candidate service path. These scores are then used to guide dynamic\nrouting decisions. To improve the model's ability to assess path quality, an\nedge-aware attention mechanism is introduced. This mechanism helps the model\ncapture instability and bottleneck risks in service communications more\naccurately. The paper also conducts a systematic analysis of the model's\nperformance under different network depths, topology densities, and service\nscales. It evaluates the effectiveness of the method in terms of routing\naccuracy, prediction error, and system stability. Experimental results show\nthat the proposed method outperforms existing mainstream strategies across\nmultiple key metrics. It handles highly dynamic and concurrent microservice\nenvironments effectively and demonstrates strong performance, robustness, and\nstructural generalization."}
{"id": "2510.15292", "categories": ["cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15292", "abs": "https://arxiv.org/abs/2510.15292", "authors": ["Guojie Hu", "Qingqing Wu", "Ming-Min Zhao", "Wen Chen", "Zhenyu Xiao", "Kui Xu", "Jiangbo Si"], "title": "Outage-Aware Sum Rate Maximization in Movable Antennas-Enabled Systems", "comment": null, "summary": "In this paper, we investigate the movable antennas (MAs)-enabled\nmultiple-input-single-output (MISO) systems, where the base station (BS)\nequipped with multiple MAs serves multiple single-antenna user. The\ndelay-sensitive scenario is considered, where users refrain from periodically\nsending training signals to the BS for channel estimations to avoid additional\nlatency. As a result, the BS relies solely on the statistical channel state\ninformation (CSI) to transmit data with a fixed rate. Under this setup, we aim\nto maximize the outage-aware sum rate of all users, by jointly optimizing\nantenna positions and the transmit beamforming at the BS, while satisfying the\ngiven target outage probability requirement at each user. The problem is highly\nnon-convex, primarily because the exact cumulative distribution function (CDF)\nof the received signal-to-interference-plus-noise ratio (SINR) of each user is\ndifficult to derive. To simplify analysis and without comprising performance,\nwe adopt the statistical CSI based zero-forcing beamforming design. We then\nintroduce one important lemma to derive the tight mean and variance of the\nSINR. Leveraging these results, we further exploit the Laguerre series\napproximation to successfully derive the closedform and tight CDF of the SINR.\nSubsequently, the outageaware sum rate expression is presented but still\nincludes complex structure with respect to antenna positions. Facing this\nchallenge, the projected gradient ascent (PGA) method is developed to\niteratively update antenna positions until convergence. Numerical results\ndemonstrate the effectiveness of our proposed schemes compared to conventional\nfixed-position antenna (FPA) and other competitive benchmarks."}
{"id": "2510.14993", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.14993", "abs": "https://arxiv.org/abs/2510.14993", "authors": ["Sushil Khairnar", "Gaurav Bansod", "Vijay Dahiphale"], "title": "A Light Weight Cryptographic Solution for 6LoWPAN Protocol Stack", "comment": "9 pages", "summary": "Lightweight cryptography is an emerging field in the field of research, which\nendorses algorithms which are best suited for constrained environment. Design\nmetrics like Gate Equivalence (GE), Memory Requirement, Power Consumption, and\nThroughput play a vital role in the applications like IoT. This paper presents\nthe 6LoWPAN Protocol Stack which is a popular standard of communication for\nconstrained devices. This paper presents an implementation of a lightweight\n6LoWPAN Protocol stack by using a Light weight Cipher instead of regular heavy\nencryption cipher AES. The cipher proposed in this paper is specifically\nsuitable for 6LoWPAN architecture as it addresses all the constraints possessed\nby wireless sensor nodes. The lightweight cipher proposed in the paper needs\nonly 1856 bytes of FLASH and 1272 bytes of RAM memory which is less than any\nother standard existing lightweight cipher design. The proposed ciphers power\nconsumption is around 25 mW which is significantly less as compared to ISO\ncertified lightweight cipher PRESENT which consumes around 38 mW of dynamic\npower. This paper also discusses the detailed analysis of cipher against the\nattacks like Linear Cryptanalysis, Differential Cryptanalysis, Biclique attack\nand Avalanche attack. The cipher implementation on hardware is around 1051 GEs\nfor 64 bit of block size with 128 bit of key length which is less as compared\nto existing lightweight cipher design. The proposed cipher LiCi2 is motivated\nfrom LiCi cipher design but outclasses it in every design metric. We believe\nthe design of LiCi2 is the obvious choice for researchers to implement in\nconstrained environments like IoT."}
{"id": "2510.15005", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15005", "abs": "https://arxiv.org/abs/2510.15005", "authors": ["Allen Daniel Sunny"], "title": "TangledFeatures: Robust Feature Selection in Highly Correlated Spaces", "comment": "Accepted for poster presentation at the Machine Learning for\n  Structural Biology (MLSB) Workshop @ NeurIPS 2025, co-located with NeurIPS\n  2025 (San Diego, USA). Non-archival", "summary": "Feature selection is a fundamental step in model development, shaping both\npredictive performance and interpretability. Yet, most widely used methods\nfocus on predictive accuracy, and their performance degrades in the presence of\ncorrelated predictors. To address this gap, we introduce TangledFeatures, a\nframework for feature selection in correlated feature spaces. It identifies\nrepresentative features from groups of entangled predictors, reducing\nredundancy while retaining explanatory power. The resulting feature subset can\nbe directly applied in downstream models, offering a more interpretable and\nstable basis for analysis compared to traditional selection techniques. We\ndemonstrate the effectiveness of TangledFeatures on Alanine Dipeptide, applying\nit to the prediction of backbone torsional angles and show that the selected\nfeatures correspond to structurally meaningful intra-atomic distances that\nexplain variation in these angles."}
{"id": "2510.15071", "categories": ["eess.SY", "cs.SY", "math.DG"], "pdf": "https://arxiv.org/pdf/2510.15071", "abs": "https://arxiv.org/abs/2510.15071", "authors": ["Ahmed Ali", "Chiara Gabellieri", "Antonio Franchi"], "title": "Exploring a New Design Paradigm for Omnidirectional MAVs for Minimal Actuation and Internal Force Elimination: Theoretical Framework and Control", "comment": null, "summary": "This paper presents a novel concept for achieving omnidirectionality in a\nmultirotor aerial vehicle (MAV) that uses only 6 inputs and ensures no internal\nforces at the equilibria. The concept integrates a single actively-tilting\npropeller along with 3 pendulum-like links, each carrying a propeller,\nconnected by passive universal joints to the main body. We show that this\ndesign ensures omnidirectionality while minimizing the internal forces and\nwithout resorting to overactuation (i.e., more than 6 inputs). A detailed\ndynamic model of the multi-link MAV is first developed. Afterwards, the\nanalysis identifies the equilibrium configurations and illustrates that a\nforced equilibrium exists for every pose of the MAV's main platform. In order\nto render this equilibrium asymptotically stable for the closed-loop system, a\ngeometric nonlinear controller is constructed using dynamic feedback\nlinearization and backstepping techniques with the main platform configuration\nerror being the left-trivialized error on SE(3). The stability of the\nclosed-loop system is then investigated by employing standard Lyapunov\narguments on the zero dynamics. We conclude by providing numerical simulations\nvalidating the proposed approach. They demonstrate the MAV capability to\nperform decoupled attitude and translational motions under non-zero initial\nconditions, parametric uncertainty, and actuators noise."}
{"id": "2510.15689", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15689", "abs": "https://arxiv.org/abs/2510.15689", "authors": ["Gebreslassie atsbha weldegebrial", "hunduma legesse geleta"], "title": "More on Boundary Behavior of Univalent Harmonic Mappings", "comment": "10 pages and 3 figures", "summary": "Many authors have examined various boundary behaviors of injective harmonic\nmappings in the open unit disk. Building on Laugesen's work, Bshouty and others\nexplored the boundary behavior of harmonic mappings under different conditions.\nIn this paper, we extend their work and find out the angular limits of the\narguments and logarithms of analytic functions under various conditions. We\nalso examined the dilatation possesses only a finite set of zeros within any\nstolz angle if the first derivative of harmonic function $f$ at the boundary is\npositive infinity."}
{"id": "2510.15373", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2510.15373", "abs": "https://arxiv.org/abs/2510.15373", "authors": ["Pranay Agarwal", "D. Manjunath"], "title": "Content and Access Networks Synergies: Tradeoffs in Public and Private Investments by Content Providers", "comment": null, "summary": "The ubiquity of smartphones has fueled content consumption worldwide, leading\nto an ever-increasing demand for a better Internet experience. This has\nnecessitated an upgrade of the capacity of the access network. The Internet\nservice providers (ISPs) have been demanding that the content providers (CPs)\nshare the cost of upgrading access network infrastructure. A \\emph{public\ninvestment} in the infrastructure of a neutral ISP will boost the profit of the\nCPs, and hence, seems a rational strategy. A CP can also make a \\emph{private\ninvestment} in its infrastructure and boost its profits. In this paper, we\nstudy the trade-off between public and private investments by a CP when the\ndecision is made under different types of interaction between them.\nSpecifically, we consider four interaction models between CPs -- centralized\nallocation, cooperative game, non-cooperative game, and a bargaining game --\nand determine the public and private investment for each model. Via numerical\nresults, we evaluate the impact of different incentive structures on the\nutility of the CPs. We see that the bargaining game can result in higher public\ninvestment than the non-cooperative and centralized models. However, this\nbenefit gets reduced if the CPs are incentivized to invest in private\ninfrastructure."}
{"id": "2510.15295", "categories": ["cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15295", "abs": "https://arxiv.org/abs/2510.15295", "authors": ["Shiying Chen", "Guangji Chen", "Long Shi", "Qingqing Wu", "Kang Wei"], "title": "Rotatable Antenna Meets UAV: Towards Dual-Level Channel Reconfiguration Paradigm for ISAC", "comment": "5 pages", "summary": "Integrated sensing and communication (ISAC) is viewed as a key enabler for\nfuture wireless networks by sharing the hardware and wireless resources between\nthe functionalities of sensing and communication (S&C). Due to the shared\nwireless resources for both S&C, it is challenging to achieve a critical\ntrade-off between these two integrated functionalities. To address this issue,\nthis paper proposes a novel dual-level channel reconfiguration framework for\nISAC by deploying rotatable antennas at an unmanned aerial vehicle (UAV), where\nboth the large-scale path loss and the correlation of S&C channels can be\nproactively controlled, thereby allowing a flexible trade-off between S&C\nperformance. To characterize the S&C tradeoff, we aim to maximize the\ncommunication rate by jointly optimizing the RA rotation, the transmit\nbeamforming, and the UAV trajectory, subject to the given requirement of\nsensing performance. For the typical scenario of static UAV deployment, we\nintroduce the concept of subspace correlation coefficient to derive closed-form\nsolutions for the optimal RA rotation, transmit beamforming, and UAV hovering\nlocation. For the scenario of a fully mobile UAV, we prove that the optimal\ntrajectory of a UAV follows a hover-fly-hover (HFH) structure, thereby\nobtaining its global optimal solution. Simulation results show that the\nproposed design significantly improves the achievable S&C trade-off region\ncompared to benchmark schemes."}
{"id": "2510.15001", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15001", "abs": "https://arxiv.org/abs/2510.15001", "authors": ["Amer Sinha", "Thomas Mesnard", "Ryan McKenna", "Daogao Liu", "Christopher A. Choquette-Choo", "Yangsibo Huang", "Da Yu", "George Kaissis", "Zachary Charles", "Ruibo Liu", "Lynn Chua", "Pritish Kamath", "Pasin Manurangsi", "Steve He", "Chiyuan Zhang", "Badih Ghazi", "Borja De Balle Pigem", "Prem Eruvbetine", "Tris Warkentin", "Armand Joulin", "Ravi KumarAmer Sinha", "Thomas Mesnard", "Ryan McKenna", "Daogao Liu", "Christopher A. Choquette-Choo", "Yangsibo Huang", "Da Yu", "George Kaissis", "Zachary Charles", "Ruibo Liu", "Lynn Chua", "Pritish Kamath", "Pasin Manurangsi", "Steve He", "Chiyuan Zhang", "Badih Ghazi", "Borja De Balle Pigem", "Prem Eruvbetine", "Tris Warkentin", "Armand Joulin", "Ravi Kumar"], "title": "VaultGemma: A Differentially Private Gemma Model", "comment": null, "summary": "We introduce VaultGemma 1B, a 1 billion parameter model within the Gemma\nfamily, fully trained with differential privacy. Pretrained on the identical\ndata mixture used for the Gemma 2 series, VaultGemma 1B represents a\nsignificant step forward in privacy-preserving large language models. We openly\nrelease this model to the community"}
{"id": "2510.15006", "categories": ["cs.LG", "I.2.6"], "pdf": "https://arxiv.org/pdf/2510.15006", "abs": "https://arxiv.org/abs/2510.15006", "authors": ["Rijul Tandon", "Peter Vamplew", "Cameron Foale"], "title": "ES-C51: Expected Sarsa Based C51 Distributional Reinforcement Learning Algorithm", "comment": null, "summary": "In most value-based reinforcement learning (RL) algorithms, the agent\nestimates only the expected reward for each action and selects the action with\nthe highest reward. In contrast, Distributional Reinforcement Learning (DRL)\nestimates the entire probability distribution of possible rewards, providing\nricher information about uncertainty and variability. C51 is a popular DRL\nalgorithm for discrete action spaces. It uses a Q-learning approach, where the\ndistribution is learned using a greedy Bellman update. However, this can cause\nproblems if multiple actions at a state have similar expected reward but with\ndifferent distributions, as the algorithm may not learn a stable distribution.\nThis study presents a modified version of C51 (ES-C51) that replaces the greedy\nQ-learning update with an Expected Sarsa update, which uses a softmax\ncalculation to combine information from all possible actions at a state rather\nthan relying on a single best action. This reduces instability when actions\nhave similar expected rewards and allows the agent to learn higher-performing\npolicies. This approach is evaluated on classic control environments from Gym,\nand Atari-10 games. For a fair comparison, we modify the standard C51's\nexploration strategy from e-greedy to softmax, which we refer to as QL-C51 (Q-\nLearning based C51). The results demonstrate that ES-C51 outperforms QL-C51\nacross many environments."}
{"id": "2510.15150", "categories": ["eess.SY", "cs.SY", "eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15150", "abs": "https://arxiv.org/abs/2510.15150", "authors": ["Tina Gao", "Shimiao Li", "Lawrence Pileggi"], "title": "Sparsity-exploiting Gaussian Process for Robust Transient Learning of Power System Dynamics", "comment": "This manuscript has been submitted to PESGM2026", "summary": "Advances in leveraging Gaussian processes (GP) have enabled learning and\ninferring dynamic grid behavior from scarce PMU measurements. However, real\nmeasurements can be corrupted by various random and targeted threats, leading\nto inaccurate and meaningless results. This paper develops robust transient\nlearning to overcome this challenge by exploiting the sparse corruption\npatterns in the data flow. Specifically, we integrate sparse optimization with\nmethod of moments (MoM) to make learning robust to a sparse distribution of\ndata corruptions; then, we optimize sparse weights to identify corrupted meter\nlocations. To improve inference speed on large-scale systems, we further adopt\nK-medoid clustering of locations to develop dimension reduction (DR) and\naggregate representation (AR) heuristics. Experimental results demonstrate\nrobustness against random large errors, targeted false data injections, and\nlocal PMU clock drifts. On a 1354-bus system, inference turns out to be 18x\nfaster using DR and 400x faster when further combined with AR heuristics."}
{"id": "2510.15717", "categories": ["eess.SP", "68T05, 92C55", "I.5.1; I.2.6"], "pdf": "https://arxiv.org/pdf/2510.15717", "abs": "https://arxiv.org/abs/2510.15717", "authors": ["Mehdi Zekriyapanah Gashti", "Mostafa Mohammadpour", "Hassan Eshkiki"], "title": "Detection Seizure Onset Zone Using Circadian Fluctuating Epileptic Biomarkers: A Signal Processing and Machine Learning Approach", "comment": null, "summary": "Epileptic biomarkers play a crucial role in identifying the origin of\nseizures, an essential aspect of pre-surgical planning for epilepsy treatment.\nThese biomarkers can vary significantly over time. By studying these temporal\nfluctuations, we can enhance their effectiveness in guiding surgical planning.\nThis research focuses on examining how circadian rhythms influence epilepsy\nbiomarkers and aims to determine the optimal times for their analysis. To\ninvestigate the relationship between epilepsy biomarkers and circadian rhythm,\nthe sleep/wake states first need to be classified. After the biomarkers are\nidentified, they are compared across these states. A retrospective analysis was\nconducted on intracranial electroencephalography data from patients with focal\nepilepsy. The biomarkers spike, sequence of spikes, high-frequency oscillations\n(HFOs), and pathological HFOs were identified through automatic detection. The\nalpha/delta ratio was also calculated to distinguish between asleep and awake\nstages. Data from 9 patients were analyzed, and the classification of sleep and\nwake states was achieved with an area under the curve of 84%. All biomarker\nrates were higher during the sleep stage compared to the wake stage.\nPathological HFOs and the sequence of spikes proved to be more precise\nindicators regarding distance to seizure onset than spikes or HFOs. Unlike\nprevious studies that relied predominantly on long-term spike biomarker\nanalysis, this study is the first to utilize a comprehensive set of biomarkers,\nincluding HFOs, spike sequences, and pathological HFOs, to enhance seizure\nonset zone prediction. The rates of epilepsy biomarkers during sleep vary\nconsiderably from those seen while awake, making sleep data analysis more\neffective for accurately predicting the seizure onset zone."}
{"id": "2510.15802", "categories": ["cs.NI", "C.2.2; C.2.3; C.2.5"], "pdf": "https://arxiv.org/pdf/2510.15802", "abs": "https://arxiv.org/abs/2510.15802", "authors": ["Tommaso Bonato", "Sepehr Abdous", "Abdul Kabbani", "Ahmad Ghalayini", "Nadeen Gebara", "Terry Lam", "Anup Agarwal", "Tiancheng Chen", "Zhuolong Yu", "Konstantin Taranov", "Mahmoud Elhaddad", "Daniele De Sensi", "Soudeh Ghorbani", "Torsten Hoefler"], "title": "Uno: A One-Stop Solution for Inter- and Intra-Datacenter Congestion Control and Reliable Connectivity", "comment": null, "summary": "Cloud computing and AI workloads are driving unprecedented demand for\nefficient communication within and across datacenters. However, the coexistence\nof intra- and inter-datacenter traffic within datacenters plus the disparity\nbetween the RTTs of intra- and inter-datacenter networks complicates congestion\nmanagement and traffic routing. Particularly, faster congestion responses of\nintra-datacenter traffic causes rate unfairness when competing with slower\ninter-datacenter flows. Additionally, inter-datacenter messages suffer from\nslow loss recovery and, thus, require reliability. Existing solutions overlook\nthese challenges and handle inter- and intra-datacenter congestion with\nseparate control loops or at different granularities. We propose Uno, a unified\nsystem for both inter- and intra-DC environments that integrates a transport\nprotocol for rapid congestion reaction and fair rate control with a load\nbalancing scheme that combines erasure coding and adaptive routing. Our\nfindings show that Uno significantly improves the completion times of both\ninter- and intra-DC flows compared to state-of-the-art methods such as Gemini."}
{"id": "2510.15298", "categories": ["cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15298", "abs": "https://arxiv.org/abs/2510.15298", "authors": ["Guojie Hu", "Qingqing Wu", "Lipeng Zhu", "Kui Xu", "Guoxin Li", "Jiangbo Si", "Jian Ouyang", "Tong-Xing Zheng"], "title": "Subverting Flexible Multiuser Communications via Movable Antenna-Enabled Jammer", "comment": null, "summary": "Movable antenna (MA) is an emerging technology which can reconfigure wireless\nchannels via adaptive antenna position adjustments at transceivers, thereby\nbringing additional spatial degrees of freedom for improving system\nperformance. In this paper, from a security perspective, we exploit the\nMAenabled legitimate jammer (MAJ) to subvert suspicious multiuser downlink\ncommunications consisting of one suspicious transmitter (ST) and multiple\nsuspicious receivers (SRs). Specifically, our objective is to minimize the\nbenefit (the sum rate of all SRs or the minimum rate among all SRs) of such\nsuspicious communications, by jointly optimizing antenna positions and the\njamming beamforming at the MAJ. However, the key challenge lies in that given\nthe MAJ's actions, the ST can reactively adjust its power allocations to\ninstead maximize its benefit for mitigating the unfavorable interference. Such\nflexible behavior of the ST confuses the optimization design of the MAJ to a\ncertain extent. Facing this difficulty, corresponding to the above two\ndifferent benefits: i) we respectively determine the optimal behavior of the ST\ngiven the MAJ's actions; ii) armed with these, we arrive at two simplified\nproblems and then develop effective alternating optimization based algorithms\nto iteratively solve them. In addition to these, we also focus on the special\ncase of two SRs, and reveal insightful conclusions about the deployment rule of\nantenna positions at the MAJ. Furthermore, we analyze the ideal antenna\ndeployment scheme at the MAJ for achieving the globally performance lower\nbound. Numerical results demonstrate the effectiveness of our proposed schemes\ncompared to conventional fixed-position antenna (FPA) and other competitive\nbenchmarks."}
{"id": "2510.15017", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15017", "abs": "https://arxiv.org/abs/2510.15017", "authors": ["ChenYu Wu", "Yi Wang", "Yang Liao"], "title": "Active Honeypot Guardrail System: Probing and Confirming Multi-Turn LLM Jailbreaks", "comment": "6pages, 2 figures", "summary": "Large language models (LLMs) are increasingly vulnerable to multi-turn\njailbreak attacks, where adversaries iteratively elicit harmful behaviors that\nbypass single-turn safety filters. Existing defenses predominantly rely on\npassive rejection, which either fails against adaptive attackers or overly\nrestricts benign users. We propose a honeypot-based proactive guardrail system\nthat transforms risk avoidance into risk utilization. Our framework fine-tunes\na bait model to generate ambiguous, non-actionable but semantically relevant\nresponses, which serve as lures to probe user intent. Combined with the\nprotected LLM's safe reply, the system inserts proactive bait questions that\ngradually expose malicious intent through multi-turn interactions. We further\nintroduce the Honeypot Utility Score (HUS), measuring both the attractiveness\nand feasibility of bait responses, and use a Defense Efficacy Rate (DER) for\nbalancing safety and usability. Initial experiment on MHJ Datasets with recent\nattack method across GPT-4o show that our system significantly disrupts\njailbreak success while preserving benign user experience."}
{"id": "2510.15010", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15010", "abs": "https://arxiv.org/abs/2510.15010", "authors": ["Rekha R Nair", "Tina Babu", "Alavikunhu Panthakkan", "Balamurugan Balusamy", "Wathiq Mansoor"], "title": "Hybrid Autoencoder-Based Framework for Early Fault Detection in Wind Turbines", "comment": null, "summary": "Wind turbine reliability is critical to the growing renewable energy sector,\nwhere early fault detection significantly reduces downtime and maintenance\ncosts. This paper introduces a novel ensemble-based deep learning framework for\nunsupervised anomaly detection in wind turbines. The method integrates\nVariational Autoencoders (VAE), LSTM Autoencoders, and Transformer\narchitectures, each capturing different temporal and contextual patterns from\nhigh-dimensional SCADA data. A unique feature engineering pipeline extracts\ntemporal, statistical, and frequency-domain indicators, which are then\nprocessed by the deep models. Ensemble scoring combines model predictions,\nfollowed by adaptive thresholding to detect operational anomalies without\nrequiring labeled fault data. Evaluated on the CARE dataset containing 89 years\nof real-world turbine data across three wind farms, the proposed method\nachieves an AUC-ROC of 0.947 and early fault detection up to 48 hours prior to\nfailure. This approach offers significant societal value by enabling predictive\nmaintenance, reducing turbine failures, and enhancing operational efficiency in\nlarge-scale wind energy deployments."}
{"id": "2510.15152", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15152", "abs": "https://arxiv.org/abs/2510.15152", "authors": ["Wenxin Zhang", "Yueying Li", "Ciamac C. Moallemi", "Tianyi Peng"], "title": "Tail-Optimized Caching for LLM Inference", "comment": null, "summary": "Prompt caching is critical for reducing latency and cost in LLM inference:\nOpenAI and Anthropic report up to 50-90% cost savings through prompt reuse.\nDespite its widespread success, little is known about what constitutes an\noptimal prompt caching policy, particularly when optimizing tail latency, a\nmetric of central importance to practitioners. The widely used Least Recently\nUsed (LRU) policy can perform arbitrarily poor on this metric, as it is\noblivious to the heterogeneity of conversation lengths. To address this gap, we\npropose Tail-Optimized LRU, a simple two-line modification that reallocates KV\ncache capacity to prioritize high-latency conversations by evicting cache\nentries that are unlikely to affect future turns. Though the implementation is\nsimple, we prove its optimality under a natural stochastic model of\nconversation dynamics, providing the first theoretical justification for LRU in\nthis setting, a result that may be of independent interest to the caching\ncommunity. Experimentally, on real conversation data WildChat, Tail-Optimized\nLRU achieves up to 27.5% reduction in P90 tail Time to First Token latency and\n23.9% in P95 tail latency compared to LRU, along with up to 38.9% decrease in\nSLO violations of 200ms. We believe this provides a practical and theoretically\ngrounded option for practitioners seeking to optimize tail latency in\nreal-world LLM deployments."}
{"id": "2510.15759", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15759", "abs": "https://arxiv.org/abs/2510.15759", "authors": ["Ishan Rangajith Koralege", "Nurul Huda Mahmood", "Arthur Sousa de Sena", "Italo Atzeni"], "title": "On the Impact of Electromagnetic Interference and Inter-RIS Reflections in Indoor Factory Local 6G Networks", "comment": null, "summary": "The Sixth Generation (6G) radio technology is expected to include local 6G\nnetworks as a special use case, extending the capabilities of `generic' 6G\nnetworks towards more demanding performance requirements. Reconfigurable\nintelligent surfaces (RISs) offer a novel paradigm for next-generation wireless\ncommunications, especially in the context of local 6G networks, enabling\nadvanced signal propagation control through intelligent phase-shift\nconfigurations. However, in practical deployments, their performance can be\nadversely affected by electromagnetic interference (EMI) from external sources\nand inter-RIS reflections (IRR) caused by signal reflections between multiple\ncolocated RIS units. This paper presents a comprehensive analysis of the joint\nimpact of EMI and IRR in a multi-RIS multi-cell system deployed within an\nindoor factory environment. A detailed evaluation study is first carried out to\ninvestigate their impact on system performance. System-level simulations\ndemonstrate that the joint impact of EMI and IRR degrades system performance\nmore significantly than their individual effects, particularly as RIS\ndimensions and transmit power increase. To address these adverse effects, an\nalternate optimization algorithm using the Riemannian conjugate gradient method\nis then proposed. The novel algorithm optimizes the phase shifts of the RIS\nelements considering the spatial correlation among their associated channels,\nand is found to provide up to several orders of magnitude gains in terms of the\nsystem sum rate and the outage probability."}
{"id": "2510.15452", "categories": ["cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15452", "abs": "https://arxiv.org/abs/2510.15452", "authors": ["Xiang Zhang", "Michail Palaiologos", "Christian Bluemm", "Giuseppe Caire"], "title": "ProxySelect: Frequency Selectivity-Aware Scheduling for Joint OFDMA and MU-MIMO in 802.11ax WiFi", "comment": "accepted at IEEE Globecom 2025, Taipei", "summary": "IEEE 802.11ax introduces orthogonal frequency division multiple access\n(OFDMA) to WiFi to support concurrent transmissions to a larger number of\nusers. As bandwidth continues to grow, WiFi channels exhibit increased\nfrequency selectivity, which poses new challenges for MU-MIMO user selection:\nthe optimal user set varies across frequency and is interleaved over subbands\n(called resource units, or RUs). This frequency selectivity, coupled with the\ncomplex subband allocation pattern, renders conventional narrowband user\nselection algorithms inefficient for 802.11ax. In this paper, we propose\n\\emph{ProxySelect}, a scalable and frequency selectivity-aware user scheduling\nalgorithm for joint OFDMA and MU-MIMO usage in 802.11ax under zero-forcing\nbeamforming (ZFBF). The scheduling task is formulated as an integer linear\nprogram (ILP) with binary variables indicating user (group)-RU associations,\nand linear constraints ensuring standard compatibility. To reduce complexity,\nwe introduce a novel proxy rate--a function of individual channel strengths and\ntheir correlations--that approximates the ZFBF rate without requiring\ncubic-complexity matrix inversion. Additionally, we develop a sampling-based\ncandidate group generation scheme that selects up to $T$ near-orthogonal user\ngroups for each RU, thereby bounding the ILP size and ensuring scalability.\nSimulations using realistic ray-tracing-based channel models show that\nProxySelect achieves near-optimal rate performance with significantly lower\ncomplexity."}
{"id": "2510.15063", "categories": ["cs.CR", "cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15063", "abs": "https://arxiv.org/abs/2510.15063", "authors": ["Wenwen Chen", "Bin Han", "Yao Zhu", "Anke Schmeink", "Giuseppe Caire", "Hans D. Schotten"], "title": "Physical Layer Deception based on Semantic Distortion", "comment": "Submitted to IEEE TIFS", "summary": "Physical layer deception (PLD) is a framework we previously introduced that\nintegrates physical layer security (PLS) with deception techniques, enabling\nproactive countermeasures against eavesdropping rather than relying solely on\npassive defense. We extend this framework to a semantic communication model and\nconduct a theoretical analysis using semantic distortion as the performance\nmetric. In this work, we further investigate the receiver's selection of\ndecryption strategies and the transmitter's optimization of encryption\nstrategies. By anticipating the decryption strategy likely to be employed by\nthe legitimate receiver and eavesdropper, the transmitter can optimize resource\nallocation and encryption parameters, thereby maximizing the semantic\ndistortion at the eavesdropper while maintaining a low level of semantic\ndistortion for the legitimate receiver. We present a rigorous analysis of the\nresulting optimization problem, propose an efficient optimization algorithm,\nand derive closed-form optimal solutions for multiple scenarios. Finally, we\ncorroborate the theoretical findings with numerical simulations, which also\nconfirm the practicality of the proposed algorithm."}
{"id": "2510.15038", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15038", "abs": "https://arxiv.org/abs/2510.15038", "authors": ["Lingkai Kong", "Molei Tao", "Yang Liu", "Bryan Wang", "Jinmiao Fu", "Chien-Chih Wang", "Huidong Liu"], "title": "AlignFlow: Improving Flow-based Generative Models with Semi-Discrete Optimal Transport", "comment": "Submitted for peer review on Sep 24, 2025. Note: chairs and reviewers\n  can see and bid on our submission since Sep 28, 2025", "summary": "Flow-based Generative Models (FGMs) effectively transform noise into complex\ndata distributions. Incorporating Optimal Transport (OT) to couple noise and\ndata during FGM training has been shown to improve the straightness of flow\ntrajectories, enabling more effective inference. However, existing OT-based\nmethods estimate the OT plan using (mini-)batches of sampled noise and data\npoints, which limits their scalability to large and high-dimensional datasets\nin FGMs. This paper introduces AlignFlow, a novel approach that leverages\nSemi-Discrete Optimal Transport (SDOT) to enhance the training of FGMs by\nestablishing an explicit, optimal alignment between noise distribution and data\npoints with guaranteed convergence. SDOT computes a transport map by\npartitioning the noise space into Laguerre cells, each mapped to a\ncorresponding data point. During FGM training, i.i.d. noise samples are paired\nwith data points via the SDOT map. AlignFlow scales well to large datasets and\nmodel architectures with negligible computational overhead. Experimental\nresults show that AlignFlow improves the performance of a wide range of\nstate-of-the-art FGM algorithms and can be integrated as a plug-and-play\ncomponent. Code is available at: https://github.com/konglk1203/AlignFlow."}
{"id": "2510.15190", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15190", "abs": "https://arxiv.org/abs/2510.15190", "authors": ["Oumaima Barhoumi", "Ghazal Farhani", "Taufiq Rahman", "Mohamed H. Zaki", "Sofiène Tahar"], "title": "A Comparative Study of Oscillatory Perturbations in Car-Following Models", "comment": null, "summary": "As connected and autonomous vehicles become more widespread, platooning has\nemerged as a key strategy to improve road capacity, reduce fuel consumption,\nand enhance traffic flow. However, the benefits of platoons strongly depend on\ntheir ability to maintain stability. Instability can lead to unsafe spacing and\nincreased energy usage. In this work, we study platoon instability and analyze\nthe root cause of its occurrence, as well as its impacts on the following\nvehicle. To achieve this, we propose a comparative study between different\ncar-following models such as the Intelligent Driver Model (IDM), the Optimal\nVelocity Model (OVM), the General Motors Model (GMM), and the Cooperative\nAdaptive Cruise Control (CACC). In our approach, we introduce a disruption in\nthe model by varying the velocity of the leading vehicle to visualize the\nbehavior of the following vehicles. To evaluate the dynamic response of each\nmodel, we introduce controlled perturbations in the velocity of the leading\nvehicle, specifically, sinusoidal oscillations and discrete velocity changes.\nThe resulting vehicle trajectories and variations in inter-vehicle spacing are\nanalyzed to assess the robustness of each model to disturbance propagation. The\nfindings offer insight into model sensitivity, stability characteristics, and\nimplications for designing resilient platooning control strategies."}
{"id": "2510.15763", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15763", "abs": "https://arxiv.org/abs/2510.15763", "authors": ["Qihao Peng", "Jiuyu Liu", "Qu Luo", "Yi Ma", "Pei Xiao", "Maged Elkashlan", "George K. Karagiannidis"], "title": "RIS-assisted Atomic MIMO Receiver", "comment": "Submitted to IEEE journals", "summary": "In this paper, we propose a novel and low-complexity atomic multiple-input\nmultiple-output (MIMO) receiver architecture assisted by a reconfigurable\nintelligent surface (RIS). By introducing RIS and utilizing pulse amplitude\nmodulation (PAM), the phase of the transmitted signal is effectively aligned\nwith that of the local oscillator (LO), thereby mitigating phase ambiguity and\nsubstantially reducing both signal detection complexity and overall receiver\ncomplexity.To tackle the resulting non-convex optimization problem, we\nreformulate it into a tractable form by minimizing the Frobenius norm of an\nequivalent matrix, which is efficiently solved using an Adam-based gradient\ndescent algorithm."}
{"id": "2510.15459", "categories": ["cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15459", "abs": "https://arxiv.org/abs/2510.15459", "authors": ["Tianyu Yang", "Kangda Zhi", "Shuangyang Li", "Giuseppe Caire"], "title": "Near-Field Imaging by Exploiting Frequency Correlation in Wireless Communication Networks", "comment": "accepted by IEEE GLOBECOM 2025", "summary": "In this work, we address the near-field imaging under a wideband wireless\ncommunication network by exploiting both the near-field channel of a uniform\nlinear array (ULA) and the image correlation in the frequency domain. We first\nformulate the image recovery as a special multiple measurement vector (MMV)\ncompressed sensing (CS) problem, where at various frequencies the sensing\nmatrices can be different, and the image coefficients are correlated. To solve\nsuch an MMV problem with various sensing matrices and correlated coefficients,\nwe propose a sparse Bayesian learning (SBL)-based solution to simultaneously\nestimate all image coefficients and their correlation on multiple frequencies.\nMoreover, to enhance estimation performance, we design two illumination\npatterns following two different criteria. From the CS perspective, the first\ndesign minimizes the total coherence of the sensing matrix to increase the\nmutual orthogonality of the basis vectors. Alternatively, to improve SNR, the\nsecond design maximizes the illumination power of the imaging area. Numerical\nresults demonstrate the effectiveness of the proposed SBL-based method and the\nsuperiority of the illumination designs."}
{"id": "2510.15068", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15068", "abs": "https://arxiv.org/abs/2510.15068", "authors": ["Deyue Zhang", "Dongdong Yang", "Junjie Mu", "Quancheng Zou", "Zonghao Ying", "Wenzhuo Xu", "Zhao Liu", "Xuan Wang", "Xiangzheng Zhang"], "title": "Sequential Comics for Jailbreaking Multimodal Large Language Models via Structured Visual Storytelling", "comment": null, "summary": "Multimodal large language models (MLLMs) exhibit remarkable capabilities but\nremain susceptible to jailbreak attacks exploiting cross-modal vulnerabilities.\nIn this work, we introduce a novel method that leverages sequential comic-style\nvisual narratives to circumvent safety alignments in state-of-the-art MLLMs.\nOur method decomposes malicious queries into visually innocuous storytelling\nelements using an auxiliary LLM, generates corresponding image sequences\nthrough diffusion models, and exploits the models' reliance on narrative\ncoherence to elicit harmful outputs. Extensive experiments on harmful textual\nqueries from established safety benchmarks show that our approach achieves an\naverage attack success rate of 83.5\\%, surpassing prior state-of-the-art by\n46\\%. Compared with existing visual jailbreak methods, our sequential narrative\nstrategy demonstrates superior effectiveness across diverse categories of\nharmful content. We further analyze attack patterns, uncover key vulnerability\nfactors in multimodal safety mechanisms, and evaluate the limitations of\ncurrent defense strategies against narrative-driven attacks, revealing\nsignificant gaps in existing protections."}
{"id": "2510.15044", "categories": ["cs.LG", "quant-ph"], "pdf": "https://arxiv.org/pdf/2510.15044", "abs": "https://arxiv.org/abs/2510.15044", "authors": ["Abdul Samad Khan", "Nouhaila Innan", "Aeysha Khalique", "Muhammad Shafique"], "title": "IQNN-CS: Interpretable Quantum Neural Network for Credit Scoring", "comment": "Accepted for oral presentation at QUEST-IS'25. To appear in Springer\n  proceedings", "summary": "Credit scoring is a high-stakes task in financial services, where model\ndecisions directly impact individuals' access to credit and are subject to\nstrict regulatory scrutiny. While Quantum Machine Learning (QML) offers new\ncomputational capabilities, its black-box nature poses challenges for adoption\nin domains that demand transparency and trust. In this work, we present\nIQNN-CS, an interpretable quantum neural network framework designed for\nmulticlass credit risk classification. The architecture combines a variational\nQNN with a suite of post-hoc explanation techniques tailored for structured\ndata. To address the lack of structured interpretability in QML, we introduce\nInter-Class Attribution Alignment (ICAA), a novel metric that quantifies\nattribution divergence across predicted classes, revealing how the model\ndistinguishes between credit risk categories. Evaluated on two real-world\ncredit datasets, IQNN-CS demonstrates stable training dynamics, competitive\npredictive performance, and enhanced interpretability. Our results highlight a\npractical path toward transparent and accountable QML models for financial\ndecision-making."}
{"id": "2510.15239", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15239", "abs": "https://arxiv.org/abs/2510.15239", "authors": ["Ziqing Zhu"], "title": "Quantum-Key-Distribution Authenticated Aggregation and Settlement for Virtual Power Plants", "comment": null, "summary": "The proliferation of distributed energy resources (DERs) and demand-side\nflexibility has made virtual power plants (VPPs) central to modern grid\noperation. Yet their end-to-end business pipeline, covering bidding, dispatch,\nmetering, settlement, and archival, forms a tightly coupled\ncyber-physical-economic system where secure and timely communication is\ncritical. Under the combined stress of sophisticated cyberattacks and extreme\nweather shocks, conventional cryptography offers limited long-term protection.\nQuantum key distribution (QKD), with information-theoretic guarantees, is\nviewed as a gold standard for securing critical infrastructures. However,\nlimited key generation rates, routing capacity, and system overhead render key\nallocation a pressing challenge: scarce quantum keys must be scheduled across\nheterogeneous processes to minimize residual risk while maintaining latency\nguarantees. This paper introduces a quantum-authenticated aggregation and\nsettlement framework for VPPs. We first develop a system-threat model that\nconnects QKD key generation and routing with business-layer security\nstrategies, authentication strength, refresh frequency, and delay constraints.\nBuilding on this, we formulate a key-budgeted risk minimization problem that\njointly accounts for economic risk, service-level violations, and key-budget\nfeasibility, and reveal a threshold property linking marginal security value to\nshadow prices. Case studies on a representative VPP system demonstrate that the\nproposed approach significantly reduces residual risk and SLA violations,\nenhances key efficiency and robustness, and aligns observed dynamics with the\ntheoretical shadow price mechanism."}
{"id": "2510.15773", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15773", "abs": "https://arxiv.org/abs/2510.15773", "authors": ["Qihao Peng Tierui Gong", "Zihang Song", "Qu Luo", "Cunhua Pan", "Pei Xiao", "Chau Yuen"], "title": "Rydberg Atomic Quantum Satellites for Enhanced Ground-to-Space Direct Uplink Access", "comment": "Submitted to IEEE journals", "summary": "This paper investigates the performance advantages of Rydberg atomic quantum\n(RAQ)-based multiple-input multiple-output (MIMO) satellites for enhancing\ndirect ground-to-space uplink access.We analytically evaluate the impact of\nRydberg atoms on channel estimation by deriving closed-form expressions for the\nmean-square error (MSE) and normalized mean-square error (NMSE). Based on the\nestimated channels, we further derive lower bounds on the achievable data rates\nfor maximum ratio combining (MRC) and zero-forcing (ZF) detection schemes.\nRigorous analysis demonstrates that RAQ-MIMO outperforms conventional\nradio-frequency (RF) MIMO under both Rayleigh and satellite channel conditions.\nSpecifically, compared with conventional MIMO, RAQR achieves a ``squaring\" gain\nunder Rayleigh fading, especially in long-distance transmission scenarios with\nstringent power constraints. In contrast, under line-of-sight (LoS)-dominated\nsatellite channels, this gain saturates as channel-estimation benefits\ndiminish, with the remaining improvement primarily arising from the normalized\nnoise background. Monte Carlo simulations validate the analytical results and\nshow that the performance gains of RAQ-MIMO satellites translate into smaller\nantenna apertures, lower transmit power, and longer communication ranges,\nthereby paving the way for next-generation satellite networks."}
{"id": "2510.15605", "categories": ["cs.IT", "math.IT", "03E72, 94D05"], "pdf": "https://arxiv.org/pdf/2510.15605", "abs": "https://arxiv.org/abs/2510.15605", "authors": ["Yelda Gülfırat", "Mehmet Ünver"], "title": "New generalizations of circular complex fuzzy sets and Gaussian weighted aggregation operators", "comment": null, "summary": "In this paper, we introduce the concept of the circular complex $q$-rung\northopair fuzzy set (CC$q$-ROFS) as a novel generalization that unifies the\nexisting frameworks of circular complex intuitionistic fuzzy sets (CCIFSs) and\ncomplex $q$-rung orthopair fuzzy sets. If $q = 2$, the structure is referred to\nas a circular complex Pythagorean fuzzy set, and if $q = 3$, it is called a\ncircular complex Fermatean fuzzy set. The proposed approach extends the\nGaussian-based framework to the CC$q$-ROFSs, aiming to achieve a smoother and\nstatistically meaningful representation of uncertainty. Within this setting,\nnew Gaussian-based aggregation operators for CC$q$-ROFSs are constructed by\nemploying the Gaussian triangular norm and conorm. Furthermore,\nGaussian-weighted arithmetic and Gaussian-weighted geometric aggregation\noperators are formulated to enable consistent integration of membership and\nnon-membership information for fuzzy modeling and decision-making."}
{"id": "2510.15083", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.15083", "abs": "https://arxiv.org/abs/2510.15083", "authors": ["Georgi Ganev", "Reza Nazari", "Rees Davison", "Amir Dizche", "Xinmin Wu", "Ralph Abbey", "Jorge Silva", "Emiliano De Cristofaro"], "title": "SMOTE and Mirrors: Exposing Privacy Leakage from Synthetic Minority Oversampling", "comment": null, "summary": "The Synthetic Minority Over-sampling Technique (SMOTE) is one of the most\nwidely used methods for addressing class imbalance and generating synthetic\ndata. Despite its popularity, little attention has been paid to its privacy\nimplications; yet, it is used in the wild in many privacy-sensitive\napplications. In this work, we conduct the first systematic study of privacy\nleakage in SMOTE: We begin by showing that prevailing evaluation practices,\ni.e., naive distinguishing and distance-to-closest-record metrics, completely\nfail to detect any leakage and that membership inference attacks (MIAs) can be\ninstantiated with high accuracy. Then, by exploiting SMOTE's geometric\nproperties, we build two novel attacks with very limited assumptions:\nDistinSMOTE, which perfectly distinguishes real from synthetic records in\naugmented datasets, and ReconSMOTE, which reconstructs real minority records\nfrom synthetic datasets with perfect precision and recall approaching one under\nrealistic imbalance ratios. We also provide theoretical guarantees for both\nattacks. Experiments on eight standard imbalanced datasets confirm the\npracticality and effectiveness of these attacks. Overall, our work reveals that\nSMOTE is inherently non-private and disproportionately exposes minority\nrecords, highlighting the need to reconsider its use in privacy-sensitive\napplications."}
{"id": "2510.15047", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15047", "abs": "https://arxiv.org/abs/2510.15047", "authors": ["Shiqi Chen", "Tongyao Zhu", "Zian Wang", "Jinghan Zhang", "Kangrui Wang", "Siyang Gao", "Teng Xiao", "Yee Whye Teh", "Junxian He", "Manling Li"], "title": "Internalizing World Models via Self-Play Finetuning for Agentic RL", "comment": null, "summary": "Large Language Models (LLMs) as agents often struggle in out-of-distribution\n(OOD) scenarios. Real-world environments are complex and dynamic, governed by\ntask-specific rules and stochasticity, which makes it difficult for LLMs to\nground their internal knowledge in those dynamics. Under such OOD conditions,\nvanilla RL training often fails to scale; we observe Pass@k--the probability\nthat at least one of (k) sampled trajectories succeeds--drops markedly across\ntraining steps, indicating brittle exploration and limited generalization.\nInspired by model-based reinforcement learning, we hypothesize that equipping\nLLM agents with an internal world model can better align reasoning with\nenvironmental dynamics and improve decision-making. We show how to encode this\nworld model by decomposing it into two components: state representation and\ntransition modeling. Building on this, we introduce SPA, a simple reinforcement\nlearning framework that cold-starts the policy via a Self-Play supervised\nfinetuning (SFT) stage to learn the world model by interacting with the\nenvironment, then uses it to simulate future states prior to policy\noptimization. This simple initialization outperforms the online world-modeling\nbaseline and greatly boosts the RL-based agent training performance.\nExperiments across diverse environments like Sokoban, FrozenLake, and Sudoku\nshow that our approach significantly improves performance. For example, SPA\nboosts the Sokoban success rate from 25.6% to 59.8% and raises the FrozenLake\nscore from 22.1% to 70.9% for the Qwen2.5-1.5B-Instruct model."}
{"id": "2510.15248", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15248", "abs": "https://arxiv.org/abs/2510.15248", "authors": ["Ziqing Zhu"], "title": "Techno-Economic Feasibility Analysis of Quantum Key Distribution for Power-System Communications", "comment": null, "summary": "The accelerating digitalization and decentralization of modern power systems\nexpose critical communication infrastructures to escalating cyber risks,\nparticularly under emerging quantum computing threats. This paper presents an\nintegrated techno-economic framework to evaluate the feasibility of Quantum Key\nDistribution (QKD) for secure power-system communications. A stochastic system\nmodel is developed to jointly capture time-varying key demand, QKD supply under\noptical-loss constraints, station-side buffering, and post-quantum cryptography\n(PQC) fallback mechanisms. Analytical conditions are derived for service-level\nassurance, including buffer stability, outage probability, and availability\nbounds. Building on this, two quantitative metrics, including the Levelized\nCost of Security (LCoSec) and Cost of Incremental Security (CIS), are\nformulated to unify capital, operational, and risk-related expenditures within\na discounted net-present-value framework. Using IEEE 118-bus, 123-node, and\n39-bus test systems, we conduct discrete-event simulations comparing PQC-only,\nQKD-only, and Hybrid architectures across multiple topologies and service\nprofiles. Results show that Hybrid architectures dominated by QKD significantly\nreduce key-outage probability and SLA shortfalls, achieving near-unit\navailability for real-time and confidentiality-critical services. Economic\nanalyses reveal clear breakeven zones where QKD-enhanced deployments become\ncost-effective, primarily in metropolitan and distribution-level networks under\nmoderate optical loss and buffer sizing. The proposed framework provides a\nreproducible, risk-aware decision tool for guiding large-scale, economically\njustified QKD adoption in future resilient power-system infrastructures."}
{"id": "2510.15784", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15784", "abs": "https://arxiv.org/abs/2510.15784", "authors": ["Qihao Peng", "Qu Luo", "Zheng Chu", "Neng Ye", "Hong Ren", "Cunhua Pan", "Lixia Xiao", "Pei Xiao"], "title": "From Active to Battery-Free: Rydberg Atomic Quantum Receivers for Self-Sustained SWIPT-MIMO Networks", "comment": "Submitted to IEEE journals", "summary": "In this paper, we proposed a hybrid simultaneous wireless information and\npower transfer (SWIPT)-enabled multiple-input multiple-output (MIMO)\narchitecture, where the base station (BS) uses a conventional RF transmitter\nfor downlink transmission and a Rydberg atomic quantum receiver (RAQR) for\nreceiving uplink signal from Internet of Things (IoT) devices. To fully exploit\nthis integration, we jointly design the transmission scheme and the\npower-splitting strategy to maximize the sum rate, which leads to a non-convex\nproblem. To address this challenge, we first derive closed-form lower bounds on\nthe uplink achievable rates for maximum ratio combining (MRC) and zero-forcing\n(ZF), as well as on the downlink rate and harvested energy for maximum ratio\ntransmission (MRT) and ZF precoding. Building upon these bounds, we propose an\niterative algorithm relying on the best monomial approximation and geometric\nprogramming (GP) to solve the non-convex problem. Finally, simulations validate\nthe tightness of our derived lower bounds and demonstrate the superiority of\nthe proposed algorithm over benchmark schemes. Importantly, by integrating RAQR\nwith SWIPT-enabled MIMO, the BS can reliably detect weak uplink signals from\nIoT devices powered only by harvested energy, enabling battery-free\ncommunication."}
{"id": "2510.15701", "categories": ["cs.IT", "cs.AI", "eess.SP", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15701", "abs": "https://arxiv.org/abs/2510.15701", "authors": ["Binggui Zhou", "Bruno Clerckx"], "title": "Beyond-Diagonal RIS Under Non-Idealities: Learning-Based Architecture Discovery and Optimization", "comment": "13 pages, 13 figures, 1 table. This paper has been submitted to IEEE\n  journal for possible publication", "summary": "Beyond-diagonal reconfigurable intelligent surface (BD-RIS) has recently been\nintroduced to enable advanced control over electromagnetic waves to further\nincrease the benefits of traditional RIS in enhancing signal quality and\nimproving spectral and energy efficiency for next-generation wireless networks.\nA significant issue in designing and deploying BD-RIS is the tradeoff between\nits performance and circuit complexity. Despite some efforts in exploring\noptimal architectures with the lowest circuit complexities for ideal BD-RIS,\narchitecture discovery for non-ideal BD-RIS remains uninvestigated. Therefore,\nhow non-idealities and circuit complexity jointly affect the performance of\nBD-RIS remains unclear, making it difficult to achieve the performance -\ncircuit complexity tradeoff in the presence of non-idealities. Essentially,\narchitecture discovery for non-ideal BD-RIS faces challenges from both the\ncomputational complexity of global architecture search and the difficulty in\nachieving global optima. To tackle these challenges, we propose a\nlearning-based two-tier architecture discovery framework (LTTADF) consisting of\nan architecture generator and a performance optimizer to jointly discover\noptimal architectures of non-ideal BD-RIS given specific circuit complexities,\nwhich can effectively explore over a large architecture space while avoiding\ngetting trapped in poor local optima and thus achieving near-optimal solutions\nfor the performance optimization. Numerical results provide valuable insights\nfor deploying non-ideal BD-RIS considering the performance - circuit complexity\ntradeoff."}
{"id": "2510.15106", "categories": ["cs.CR", "cs.LG", "I.2.7; I.2.6"], "pdf": "https://arxiv.org/pdf/2510.15106", "abs": "https://arxiv.org/abs/2510.15106", "authors": ["Issam Seddik", "Sami Souihi", "Mohamed Tamaazousti", "Sara Tucci Piergiovanni"], "title": "PoTS: Proof-of-Training-Steps for Backdoor Detection in Large Language Models", "comment": "10 pages, 6 figures, 1 table. Accepted for presentation at FLLM 2025\n  (Vienna, Nov 2025)", "summary": "As Large Language Models (LLMs) gain traction across critical domains,\nensuring secure and trustworthy training processes has become a major concern.\nBackdoor attacks, where malicious actors inject hidden triggers into training\ndata, are particularly insidious and difficult to detect. Existing\npost-training verification solutions like Proof-of-Learning are impractical for\nLLMs due to their requirement for full retraining, lack of robustness against\nstealthy manipulations, and inability to provide early detection during\ntraining. Early detection would significantly reduce computational costs. To\naddress these limitations, we introduce Proof-of-Training Steps, a verification\nprotocol that enables an independent auditor (Alice) to confirm that an LLM\ndeveloper (Bob) has followed the declared training recipe, including data\nbatches, architecture, and hyperparameters. By analyzing the sensitivity of the\nLLMs' language modeling head (LM-Head) to input perturbations, our method can\nexpose subtle backdoor injections or deviations in training. Even with backdoor\ntriggers in up to 10 percent of the training data, our protocol significantly\nreduces the attacker's ability to achieve a high attack success rate (ASR). Our\nmethod enables early detection of attacks at the injection step, with\nverification steps being 3x faster than training steps. Our results highlight\nthe protocol's potential to enhance the accountability and security of LLM\ndevelopment, especially against insider threats."}
{"id": "2510.15056", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15056", "abs": "https://arxiv.org/abs/2510.15056", "authors": ["Ziqing Lu", "Babak Hassibi", "Lifeng Lai", "Weiyu Xu"], "title": "Learn to Change the World: Multi-level Reinforcement Learning with Model-Changing Actions", "comment": null, "summary": "Reinforcement learning usually assumes a given or sometimes even fixed\nenvironment in which an agent seeks an optimal policy to maximize its long-term\ndiscounted reward. In contrast, we consider agents that are not limited to\npassive adaptations: they instead have model-changing actions that actively\nmodify the RL model of world dynamics itself. Reconfiguring the underlying\ntransition processes can potentially increase the agents' rewards. Motivated by\nthis setting, we introduce the multi-layer configurable time-varying Markov\ndecision process (MCTVMDP). In an MCTVMDP, the lower-level MDP has a\nnon-stationary transition function that is configurable through upper-level\nmodel-changing actions. The agent's objective consists of two parts: Optimize\nthe configuration policies in the upper-level MDP and optimize the primitive\naction policies in the lower-level MDP to jointly improve its expected\nlong-term reward."}
{"id": "2510.15250", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15250", "abs": "https://arxiv.org/abs/2510.15250", "authors": ["Mostafaali Ayubirad", "Zeng Qiu", "Hao Wang", "Chris Weinkauf", "Michiel Van Nieuwstadt", "Hamid R. Ossareh"], "title": "Comprehensive Dynamic Modeling and Constraint-Aware Air Supply Control for Localized Water Management in Automotive Polymer Electrolyte Membrane Fuel Cells", "comment": "This is a manuscript submitted to Applied Energy", "summary": "In this paper, a predictive constraint-aware control scheme is formulated\nwithin the Command Governor (CG) framework for localized hydration management\nof a proton exchange membrane (PEM) fuel cell system. First, a comprehensive\nnonlinear dynamic model of the fuel cell system is presented which includes a\npseudo 2-dimensional (P2D) model of the stack, reactant supply and cooling\nsubsystems. The model captures the couplings among the various subsystems and\nserves as the basis for designing output feedback controllers to track the\noptimal set-points of the air supply and cooling systems for power\noptimization. The closed-loop nonlinear model is then used to analyze the\ndynamic behavior of membrane hydration near the anode inlet, the driest region\nof the membrane in a counter-flow configuration, under various operating\nconditions. A reduced-order linearized model is then derived to approximate\nhydration behavior with sufficient fidelity for constraint enforcement. This\nmodel is used within the CG framework to adjust the air supply set-points when\nnecessary to prevent membrane dry-out. The effectiveness of the proposed\napproach in maintaining local membrane hydration while closely tracking the\nrequested net power is demonstrated through realistic drive-cycle simulations."}
{"id": "2510.15810", "categories": ["eess.SP", "cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15810", "abs": "https://arxiv.org/abs/2510.15810", "authors": ["Luis F. Abanto-Leon", "Setareh Maghsudi"], "title": "Resilient Full-Duplex ISAC in the Face of Imperfect SI Cancellation: Globally Optimal Timeslot Allocation and Beam Selection", "comment": null, "summary": "This work addresses the radio resource management (RRM) design in downlink\nfull-duplex integrated sensing and communications (ISAC) systems, jointly\noptimizing timeslot allocation and beam selection under imperfect\nself-interference cancellation. Timeslot allocation governs the distribution of\ndiscrete channel uses between sensing and communication tasks, while beam\nselection determines transmit and receive directions along with adaptive\nbeamwidths. The joint design leads to a semi-infinite, nonconvex mixed-integer\nnonlinear program (MINLP), which is difficult to solve. To overcome this, we\ndevelop a tailored reformulation strategy that transforms the problem into a\ntractable mixed-integer linear program (MILP), enabling globally optimal\nsolutions. Our approach provides insights into the coordinated optimization of\ntimeslot allocation and beam selection, enhancing the efficiency of full-duplex\nISAC systems while ensuring resilience against residual self-interference."}
{"id": "2510.15063", "categories": ["cs.CR", "cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15063", "abs": "https://arxiv.org/abs/2510.15063", "authors": ["Wenwen Chen", "Bin Han", "Yao Zhu", "Anke Schmeink", "Giuseppe Caire", "Hans D. Schotten"], "title": "Physical Layer Deception based on Semantic Distortion", "comment": "Submitted to IEEE TIFS", "summary": "Physical layer deception (PLD) is a framework we previously introduced that\nintegrates physical layer security (PLS) with deception techniques, enabling\nproactive countermeasures against eavesdropping rather than relying solely on\npassive defense. We extend this framework to a semantic communication model and\nconduct a theoretical analysis using semantic distortion as the performance\nmetric. In this work, we further investigate the receiver's selection of\ndecryption strategies and the transmitter's optimization of encryption\nstrategies. By anticipating the decryption strategy likely to be employed by\nthe legitimate receiver and eavesdropper, the transmitter can optimize resource\nallocation and encryption parameters, thereby maximizing the semantic\ndistortion at the eavesdropper while maintaining a low level of semantic\ndistortion for the legitimate receiver. We present a rigorous analysis of the\nresulting optimization problem, propose an efficient optimization algorithm,\nand derive closed-form optimal solutions for multiple scenarios. Finally, we\ncorroborate the theoretical findings with numerical simulations, which also\nconfirm the practicality of the proposed algorithm."}
{"id": "2510.15108", "categories": ["cs.CR", "math.GR", "math.NT"], "pdf": "https://arxiv.org/pdf/2510.15108", "abs": "https://arxiv.org/abs/2510.15108", "authors": ["Nikolaos Verykios", "Christos Gogos"], "title": "Partitioning $\\mathbb{Z}_{sp}$ in finite fields and groups of trees and cycles", "comment": "Preprint version of the manuscript submitted for publication in\n  Fundamenta Informaticae (IOS Press)", "summary": "This paper investigates the algebraic and graphical structure of the ring\n$\\mathbb{Z}_{sp}$, with a focus on its decomposition into finite fields,\nkernels, and special subsets. We establish classical isomorphisms between\n$\\mathbb{F}_s$ and $p\\mathbb{F}_s$, as well as $p\\mathbb{F}_s^{\\star}$ and\n$p\\mathbb{F}_s^{+1,\\star}$. We introduce the notion of arcs and rooted trees to\ndescribe the pre-periodic structure of $\\mathbb{Z}_{sp}$, and prove that trees\nrooted at elements not divisible by $s$ or $p$ can be generated from the tree\nof unity via multiplication by cyclic arcs. Furthermore, we define and analyze\nthe set $\\mathbb{D}_{sp}$, consisting of elements that are neither multiples of\n$s$ or $p$ nor \"off-by-one\" elements, and show that its graph decomposes into\ncycles and pre-periodic trees. Finally, we demonstrate that every cycle in\n$\\mathbb{Z}_{sp}$ contains inner cycles that are derived predictably from the\ncycles of the finite fields $p\\mathbb{F}_s$ and $s\\mathbb{F}_p$, and we discuss\nthe cryptographic relevance of $\\mathbb{D}_{sp}$, highlighting its potential\nfor analyzing cyclic attacks and factorization methods."}
{"id": "2510.15061", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15061", "abs": "https://arxiv.org/abs/2510.15061", "authors": ["Samuel Paech", "Allen Roush", "Judah Goldfeder", "Ravid Shwartz-Ziv"], "title": "Antislop: A Comprehensive Framework for Identifying and Eliminating Repetitive Patterns in Language Models", "comment": "11 pages + appendices, 16 figures", "summary": "Widespread LLM adoption has introduced characteristic repetitive phraseology,\ntermed ``slop,'' which degrades output quality and makes AI-generated text\nimmediately recognizable. We present Antislop, a comprehensive framework\nproviding tools to both detect and eliminate these overused patterns. Our\napproach combines three innovations: (1) The Antislop Sampler, which uses\nbacktracking to suppress unwanted strings at inference time without destroying\nvocabulary; (2) An automated pipeline that profiles model-specific slop against\nhuman baselines and generates training data; (3) Final Token Preference\nOptimization (FTPO), a novel fine-tuning method that operates on individual\ntokens, surgically adjusting logits wherever a banned pattern has appeared in\nan inference trace. We demonstrate that some slop patterns appear over\n1,000$\\times$ more frequently in LLM output than human text. The Antislop\nSampler successfully suppresses 8,000+ patterns while maintaining quality,\nwhereas token banning becomes unusable at just 2,000. Most importantly, FTPO\nachieves 90\\% slop reduction while maintaining or improving performance in\ncross-domain evals including GSM8K, MMLU, and creative writing tasks. In\ncontrast, DPO suffers significant degradation in writing quality and lexical\ndiversity despite achieving weaker suppression. We release all code and results\nunder MIT license: https://github.com/sam-paech/auto-antislop."}
{"id": "2510.15285", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15285", "abs": "https://arxiv.org/abs/2510.15285", "authors": ["Saeid Bayat", "Jerry Zuo", "Jing Sun"], "title": "Modeling and Dynamic Simulation of a Hybrid Wind-Wave System on a Hexagonal Semi-Submersible Platform", "comment": "28 pages, 17 figures", "summary": "Offshore renewable energy systems offer promising solutions for sustainable\npower generation, yet most existing platforms harvest either wind or wave\nenergy in isolation. This study presents a hybrid floating offshore platform\nthat integrates a wind turbine with three oscillating surge wave energy\nconverters (WECs) into a hexagonal semi-submersible structure. In this\nconfiguration, the flaps are integrated with the platform geometry to provide\nboth energy extraction and hydrodynamic stability. A modeling and simulation\nframework was developed using WEC-Sim and benchmarked against the NREL 5 MW\nsemisubmersible reference. Metacentric height analysis confirmed hydrostatic\nstability across a range of prescribed flap angles. Sensitivity analysis of\ntwelve geometric variables identified flap dimensions and tower length as\ndominant drivers of stability, energy capture, and tower stress. Time-domain\nsimulations revealed dependence on wave incidence angle, with variations in\nflap power sharing, capture width ratio (CWR), and platform response. The\nfeasibility of using flap sweeps to modulate pitch motion was also\ndemonstrated. Annual energy production (AEP) estimates based on site-specific\ndata indicate 16.86 GWh from wind and 3.65 GWh from wave energy, with WECs\ncontributing about 18% of the total. These results highlight the potential of\nintegrated wind-wave platforms and point toward future studies on structural\nmodeling and advanced control."}
{"id": "2510.15109", "categories": ["cs.NI", "cs.AI", "cs.DC", "cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15109", "abs": "https://arxiv.org/abs/2510.15109", "authors": ["Utku Demir", "Tugba Erpek", "Yalin E. Sagduyu", "Sastry Kompella", "Mengran Xue"], "title": "Targeted Attacks and Defenses for Distributed Federated Learning in Vehicular Networks", "comment": null, "summary": "In emerging networked systems, mobile edge devices such as ground vehicles\nand unmanned aerial system (UAS) swarms collectively aggregate vast amounts of\ndata to make machine learning decisions such as threat detection in remote,\ndynamic, and infrastructure-constrained environments where power and bandwidth\nare scarce. Federated learning (FL) addresses these constraints and privacy\nconcerns by enabling nodes to share local model weights for deep neural\nnetworks instead of raw data, facilitating more reliable decision-making than\nindividual learning. However, conventional FL relies on a central server to\ncoordinate model updates in each learning round, which imposes significant\ncomputational burdens on the central node and may not be feasible due to the\nconnectivity constraints. By eliminating dependence on a central server,\ndistributed federated learning (DFL) offers scalability, resilience to node\nfailures, learning robustness, and more effective defense strategies. Despite\nthese advantages, DFL remains vulnerable to increasingly advanced and stealthy\ncyberattacks. In this paper, we design sophisticated targeted training data\npoisoning and backdoor (Trojan) attacks, and characterize the emerging\nvulnerabilities in a vehicular network. We analyze how DFL provides resilience\nagainst such attacks compared to individual learning and present effective\ndefense mechanisms to further strengthen DFL against the emerging cyber\nthreats."}
{"id": "2510.15195", "categories": ["eess.SP", "cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15195", "abs": "https://arxiv.org/abs/2510.15195", "authors": ["Nishant Mehrotra", "Sandesh Rao Mattu", "Robert Calderbank"], "title": "Pulse Shaping Filter Design for Integrated Sensing & Communication with Zak-OTFS", "comment": "6 pages, 3 figures, to be submitted to IEEE for possible publication", "summary": "Zak-OTFS is an emerging framework for integrated sensing & communication\n(ISAC) in high delay and Doppler spread environments. A critical enabler for\nISAC with Zak-OTFS is the design of pulse shaping filters. For sensing, a\nlocalized pulse shaping filter enables ideal input-output (I/O) relation\nestimates close to the physical scattering channel. For communication,\northogonality of the pulse shape on the information lattice prevents\ninter-symbol interference, and no time and bandwidth expansion enables full\nspectral efficiency. A filter simultaneously meeting all three objectives is\nideal for ISAC. Existing filter designs achieve two of the above objectives,\nbut not all three simultaneously. For instance, the sinc filter is orthogonal\nand bandwidth/time-limited, but is not localized. The Gaussian filter is\nlocalized and bandwidth/time-limited, but not orthogonal. The RRC filter is\nlocalized and orthogonal, but not bandwidth/time-limited. A recently proposed\nhybrid Gaussian-sinc filter is more localized than the sinc filter and\nbandwidth/time-limited, but is not orthogonal. In this work, we design optimal\npulse shaping filters meeting all three objectives via the Isotropic Orthogonal\nTransform Algorithm. The proposed pulse shaping filters offer improved data\ndetection (communication) and I/O relation estimation (sensing) performance\ncompared to existing filter choices in the literature."}
{"id": "2510.15112", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.15112", "abs": "https://arxiv.org/abs/2510.15112", "authors": ["Mst Eshita Khatun", "Lamine Noureddine", "Zhiyong Sui", "Aisha Ali-Gombe"], "title": "AndroByte: LLM-Driven Privacy Analysis through Bytecode Summarization and Dynamic Dataflow Call Graph Generation", "comment": "Accepted at the Annual Computer Security Applications Conference\n  (ACSAC) 2025", "summary": "With the exponential growth in mobile applications, protecting user privacy\nhas become even more crucial. Android applications are often known for\ncollecting, storing, and sharing sensitive user information such as contacts,\nlocation, camera, and microphone data often without the user's clear consent or\nawareness raising significant privacy risks and exposure. In the context of\nprivacy assessment, dataflow analysis is particularly valuable for identifying\ndata usage and potential leaks. Traditionally, this type of analysis has relied\non formal methods, heuristics, and rule-based matching. However, these\ntechniques are often complex to implement and prone to errors, such as taint\nexplosion for large programs. Moreover, most existing Android dataflow analysis\nmethods depend heavily on predefined list of sinks, limiting their flexibility\nand scalability. To address the limitations of these existing techniques, we\npropose AndroByte, an AI-driven privacy analysis tool that leverages LLM\nreasoning on bytecode summarization to dynamically generate accurate and\nexplainable dataflow call graphs from static code analysis. AndroByte achieves\na significant F\\b{eta}-Score of 89% in generating dynamic dataflow call graphs\non the fly, outperforming the effectiveness of traditional tools like FlowDroid\nand Amandroid in leak detection without relying on predefined propagation rules\nor sink lists. Moreover, AndroByte's iterative bytecode summarization provides\ncomprehensive and explainable insights into dataflow and leak detection,\nachieving high, quantifiable scores based on the G-Eval metric."}
{"id": "2510.15075", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15075", "abs": "https://arxiv.org/abs/2510.15075", "authors": ["Sixian Jia", "Zhiqiao Dong", "Chenhui Shao"], "title": "Physics-informed data-driven machine health monitoring for two-photon lithography", "comment": null, "summary": "Two-photon lithography (TPL) is a sophisticated additive manufacturing\ntechnology for creating three-dimensional (3D) micro- and nano-structures.\nMaintaining the health of TPL systems is critical for ensuring consistent\nfabrication quality. Current maintenance practices often rely on experience\nrather than informed monitoring of machine health, resulting in either untimely\nmaintenance that causes machine downtime and poor-quality fabrication, or\nunnecessary maintenance that leads to inefficiencies and avoidable downtime. To\naddress this gap, this paper presents three methods for accurate and timely\nmonitoring of TPL machine health. Through integrating physics-informed\ndata-driven predictive models for structure dimensions with statistical\napproaches, the proposed methods are able to handle increasingly complex\nscenarios featuring different levels of generalizability. A comprehensive\nexperimental dataset that encompasses six process parameter combinations and\nsix structure dimensions under two machine health conditions was collected to\nevaluate the effectiveness of the proposed approaches. Across all test\nscenarios, the approaches are shown to achieve high accuracies, demonstrating\nexcellent effectiveness, robustness, and generalizability. These results\nrepresent a significant step toward condition-based maintenance for TPL\nsystems."}
{"id": "2510.15365", "categories": ["eess.SY", "cs.LG", "cs.MA", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15365", "abs": "https://arxiv.org/abs/2510.15365", "authors": ["Maonan Wang", "Yirong Chen", "Yuxin Cai", "Aoyu Pang", "Yuejiao Xie", "Zian Ma", "Chengcheng Xu", "Kemou Jiang", "Ding Wang", "Laurent Roullet", "Chung Shue Chen", "Zhiyong Cui", "Yuheng Kan", "Michael Lepech", "Man-On Pun"], "title": "TranSimHub:A Unified Air-Ground Simulation Platform for Multi-Modal Perception and Decision-Making", "comment": "9 pages, 4 figures", "summary": "Air-ground collaborative intelligence is becoming a key approach for\nnext-generation urban intelligent transportation management, where aerial and\nground systems work together on perception, communication, and decision-making.\nHowever, the lack of a unified multi-modal simulation environment has limited\nprogress in studying cross-domain perception, coordination under communication\nconstraints, and joint decision optimization. To address this gap, we present\nTranSimHub, a unified simulation platform for air-ground collaborative\nintelligence. TranSimHub offers synchronized multi-view rendering across RGB,\ndepth, and semantic segmentation modalities, ensuring consistent perception\nbetween aerial and ground viewpoints. It also supports information exchange\nbetween the two domains and includes a causal scene editor that enables\ncontrollable scenario creation and counterfactual analysis under diverse\nconditions such as different weather, emergency events, and dynamic obstacles.\nWe release TranSimHub as an open-source platform that supports end-to-end\nresearch on perception, fusion, and control across realistic air and ground\ntraffic scenes. Our code is available at\nhttps://github.com/Traffic-Alpha/TranSimHub."}
{"id": "2510.15150", "categories": ["eess.SY", "cs.SY", "eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15150", "abs": "https://arxiv.org/abs/2510.15150", "authors": ["Tina Gao", "Shimiao Li", "Lawrence Pileggi"], "title": "Sparsity-exploiting Gaussian Process for Robust Transient Learning of Power System Dynamics", "comment": "This manuscript has been submitted to PESGM2026", "summary": "Advances in leveraging Gaussian processes (GP) have enabled learning and\ninferring dynamic grid behavior from scarce PMU measurements. However, real\nmeasurements can be corrupted by various random and targeted threats, leading\nto inaccurate and meaningless results. This paper develops robust transient\nlearning to overcome this challenge by exploiting the sparse corruption\npatterns in the data flow. Specifically, we integrate sparse optimization with\nmethod of moments (MoM) to make learning robust to a sparse distribution of\ndata corruptions; then, we optimize sparse weights to identify corrupted meter\nlocations. To improve inference speed on large-scale systems, we further adopt\nK-medoid clustering of locations to develop dimension reduction (DR) and\naggregate representation (AR) heuristics. Experimental results demonstrate\nrobustness against random large errors, targeted false data injections, and\nlocal PMU clock drifts. On a 1354-bus system, inference turns out to be 18x\nfaster using DR and 400x faster when further combined with AR heuristics."}
{"id": "2510.15380", "categories": ["cs.CR", "cs.IT", "eess.SP", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15380", "abs": "https://arxiv.org/abs/2510.15380", "authors": ["Axel Flinth", "Hubert Orlicki", "Semira Einsele", "Gerhard Wunder"], "title": "Bilinear Compressive Security", "comment": null, "summary": "Beyond its widespread application in signal and image processing,\n\\emph{compressed sensing} principles have been greatly applied to secure\ninformation transmission (often termed 'compressive security'). In this\nscenario, the measurement matrix $Q$ acts as a one time pad encryption key (in\ncomplex number domain) which can achieve perfect information-theoretic security\ntogether with other benefits such as reduced complexity and energy efficiency\nparticularly useful in IoT. However, unless the matrix is changed for every\nmessage it is vulnerable towards known plain text attacks: only $n$\nobservations suffices to recover a key $Q$ with $n$ columns. In this paper, we\ninvent and analyze a new method (termed 'Bilinear Compressive Security (BCS)')\naddressing these shortcomings: In addition to the linear encoding of the\nmessage $x$ with a matrix $Q$, the sender convolves the resulting vector with a\nrandomly generated filter $h$. Assuming that $h$ and $x$ are sparse, the\nreceiver can then recover $x$ without knowledge of $h$ from $y=h*Qx$ through\nblind deconvolution. We study a rather idealized known plaintext attack for\nrecovering $Q$ from repeated observations of $y$'s for different, known $x_k$,\nwith varying and unknown $h$ ,giving Eve a number of advantages not present in\npractice. Our main result for BCS states that under a weak symmetry condition\non the filter $h$, recovering $Q$ will require extensive sampling from\ntransmissions of $\\Omega\\left(\\max\\left(n,(n/s)^2\\right)\\right)$ messages $x_k$\nif they are $s$-sparse. Remarkably, with $s=1$ it is impossible to recover the\nkey. In this way, the scheme is much safer than standard compressed sensing\neven though our assumptions are much in favor towards a potential attacker."}
{"id": "2510.15133", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.15133", "abs": "https://arxiv.org/abs/2510.15133", "authors": ["Ynes Ineza", "Gerald Jackson", "Prince Niyonkuru", "Jaden Kevil", "Abdul Serwadda"], "title": "Intermittent File Encryption in Ransomware: Measurement, Modeling, and Detection", "comment": null, "summary": "File encrypting ransomware increasingly employs intermittent encryption\ntechniques, encrypting only parts of files to evade classical detection\nmethods. These strategies, exemplified by ransomware families like BlackCat,\ncomplicate file structure based detection techniques due to diverse file\nformats exhibiting varying traits under partial encryption. This paper provides\na systematic empirical characterization of byte level statistics under\nintermittent encryption across common file types, establishing a comprehensive\nbaseline of how partial encryption impacts data structure. We specialize a\nclassical KL divergence upper bound on a tailored mixture model of intermittent\nencryption, yielding filetype specific detectability ceilings for\nhistogram-based detectors. Leveraging insights from this analysis, we\nempirically evaluate convolutional neural network (CNN) based detection methods\nusing realistic intermittent encryption configurations derived from leading\nransomware variants. Our findings demonstrate that localized analysis via chunk\nlevel CNNs consistently outperforms global analysis methods, highlighting their\npractical effectiveness and establishing a robust baseline for future detection\nsystems."}
{"id": "2510.15076", "categories": ["cs.LG", "cs.DM", "cs.DS"], "pdf": "https://arxiv.org/pdf/2510.15076", "abs": "https://arxiv.org/abs/2510.15076", "authors": ["Sami Davies", "Benjamin Moseley", "Heather Newman"], "title": "Online Correlation Clustering: Simultaneously Optimizing All $\\ell_p$-norms", "comment": "66 pages", "summary": "The $\\ell_p$-norm objectives for correlation clustering present a fundamental\ntrade-off between minimizing total disagreements (the $\\ell_1$-norm) and\nensuring fairness to individual nodes (the $\\ell_\\infty$-norm). Surprisingly,\nin the offline setting it is possible to simultaneously approximate all\n$\\ell_p$-norms with a single clustering. Can this powerful guarantee be\nachieved in an online setting? This paper provides the first affirmative\nanswer. We present a single algorithm for the online-with-a-sample (AOS) model\nthat, given a small constant fraction of the input as a sample, produces one\nclustering that is simultaneously $O(\\log^4 n)$-competitive for all\n$\\ell_p$-norms with high probability, $O(\\log n)$-competitive for the\n$\\ell_\\infty$-norm with high probability, and $O(1)$-competitive for the\n$\\ell_1$-norm in expectation. This work successfully translates the offline\n\"all-norms\" guarantee to the online world.\n  Our setting is motivated by a new hardness result that demonstrates a\nfundamental separation between these objectives in the standard random-order\n(RO) online model. Namely, while the $\\ell_1$-norm is trivially\n$O(1)$-approximable in the RO model, we prove that any algorithm in the RO\nmodel for the fairness-promoting $\\ell_\\infty$-norm must have a competitive\nratio of at least $\\Omega(n^{1/3})$. This highlights the necessity of a\ndifferent beyond-worst-case model. We complement our algorithm with lower\nbounds, showing our competitive ratios for the $\\ell_1$- and $\\ell_\\infty$-\nnorms are nearly tight in the AOS model."}
{"id": "2510.15519", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15519", "abs": "https://arxiv.org/abs/2510.15519", "authors": ["Yushu Qin", "Marcos L. L. Sartori", "Shengyu Duan", "Emre Ozer", "Rishad Shafik", "Alex Yakovlev"], "title": "A Tsetlin Machine Image Classification Accelerator on a Flexible Substrate", "comment": "accepted by International Symposium on the Tsetlin Machine (ISTM)\n  2025", "summary": "This paper introduces the first implementation of digital Tsetlin Machines\n(TMs) on flexible integrated circuit (FlexIC) using Pragmatic's 600nm\nIGZO-based FlexIC technology. TMs, known for their energy efficiency,\ninterpretability, and suitability for edge computing, have previously been\nlimited by the rigidity of conventional silicon-based chips. We develop two TM\ninference models as FlexICs: one achieving 98.5% accuracy using 6800 NAND2\nequivalent logic gates with an area of 8X8 mm2, and a second more compact\nversion achieving slightly lower prediction accuracy of 93% but using only 1420\nNAND2 equivalent gates with an area of 4X4 mm2, both of which are\ncustom-designed for an 8X8-pixel handwritten digit recognition dataset. The\npaper demonstrates the feasibility of deploying flexible TM inference engines\ninto wearable healthcare and edge computing applications."}
{"id": "2510.15380", "categories": ["cs.CR", "cs.IT", "eess.SP", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15380", "abs": "https://arxiv.org/abs/2510.15380", "authors": ["Axel Flinth", "Hubert Orlicki", "Semira Einsele", "Gerhard Wunder"], "title": "Bilinear Compressive Security", "comment": null, "summary": "Beyond its widespread application in signal and image processing,\n\\emph{compressed sensing} principles have been greatly applied to secure\ninformation transmission (often termed 'compressive security'). In this\nscenario, the measurement matrix $Q$ acts as a one time pad encryption key (in\ncomplex number domain) which can achieve perfect information-theoretic security\ntogether with other benefits such as reduced complexity and energy efficiency\nparticularly useful in IoT. However, unless the matrix is changed for every\nmessage it is vulnerable towards known plain text attacks: only $n$\nobservations suffices to recover a key $Q$ with $n$ columns. In this paper, we\ninvent and analyze a new method (termed 'Bilinear Compressive Security (BCS)')\naddressing these shortcomings: In addition to the linear encoding of the\nmessage $x$ with a matrix $Q$, the sender convolves the resulting vector with a\nrandomly generated filter $h$. Assuming that $h$ and $x$ are sparse, the\nreceiver can then recover $x$ without knowledge of $h$ from $y=h*Qx$ through\nblind deconvolution. We study a rather idealized known plaintext attack for\nrecovering $Q$ from repeated observations of $y$'s for different, known $x_k$,\nwith varying and unknown $h$ ,giving Eve a number of advantages not present in\npractice. Our main result for BCS states that under a weak symmetry condition\non the filter $h$, recovering $Q$ will require extensive sampling from\ntransmissions of $\\Omega\\left(\\max\\left(n,(n/s)^2\\right)\\right)$ messages $x_k$\nif they are $s$-sparse. Remarkably, with $s=1$ it is impossible to recover the\nkey. In this way, the scheme is much safer than standard compressed sensing\neven though our assumptions are much in favor towards a potential attacker."}
{"id": "2510.15810", "categories": ["eess.SP", "cs.IT", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15810", "abs": "https://arxiv.org/abs/2510.15810", "authors": ["Luis F. Abanto-Leon", "Setareh Maghsudi"], "title": "Resilient Full-Duplex ISAC in the Face of Imperfect SI Cancellation: Globally Optimal Timeslot Allocation and Beam Selection", "comment": null, "summary": "This work addresses the radio resource management (RRM) design in downlink\nfull-duplex integrated sensing and communications (ISAC) systems, jointly\noptimizing timeslot allocation and beam selection under imperfect\nself-interference cancellation. Timeslot allocation governs the distribution of\ndiscrete channel uses between sensing and communication tasks, while beam\nselection determines transmit and receive directions along with adaptive\nbeamwidths. The joint design leads to a semi-infinite, nonconvex mixed-integer\nnonlinear program (MINLP), which is difficult to solve. To overcome this, we\ndevelop a tailored reformulation strategy that transforms the problem into a\ntractable mixed-integer linear program (MILP), enabling globally optimal\nsolutions. Our approach provides insights into the coordinated optimization of\ntimeslot allocation and beam selection, enhancing the efficiency of full-duplex\nISAC systems while ensuring resilience against residual self-interference."}
{"id": "2510.15173", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.15173", "abs": "https://arxiv.org/abs/2510.15173", "authors": ["Ynes Ineza", "Muhammad A. Ullah", "Abdul Serwadda", "Aurore Munyaneza"], "title": "Beyond the Voice: Inertial Sensing of Mouth Motion for High Security Speech Verification", "comment": null, "summary": "Voice interfaces are increasingly used in high stakes domains such as mobile\nbanking, smart home security, and hands free healthcare. Meanwhile, modern\ngenerative models have made high quality voice forgeries inexpensive and easy\nto create, eroding confidence in voice authentication alone. To strengthen\nprotection against such attacks, we present a second authentication factor that\ncombines acoustic evidence with the unique motion patterns of a speaker's lower\nface. By placing lightweight inertial sensors around the mouth to capture mouth\nopening and evolving lower facial geometry, our system records a distinct\nmotion signature with strong discriminative power across individuals. We built\na prototype and recruited 43 participants to evaluate the system under four\nconditions seated, walking on level ground, walking on stairs, and speaking\nwith different language backgrounds (native vs. non native English). Across all\nscenarios, our approach consistently achieved a median equal error rate (EER)\nof 0.01 or lower, indicating that mouth movement data remain robust under\nvariations in gait, posture, and spoken language. We discuss specific use cases\nwhere this second line of defense could provide tangible security benefits to\nvoice authentication systems."}
{"id": "2510.15101", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15101", "abs": "https://arxiv.org/abs/2510.15101", "authors": ["Yolanne Yi Ran Lee", "Kyriakos Flouris"], "title": "Operator Flow Matching for Timeseries Forecasting", "comment": "Preprint", "summary": "Forecasting high-dimensional, PDE-governed dynamics remains a core challenge\nfor generative modeling. Existing autoregressive and diffusion-based approaches\noften suffer cumulative errors and discretisation artifacts that limit long,\nphysically consistent forecasts. Flow matching offers a natural alternative,\nenabling efficient, deterministic sampling. We prove an upper bound on FNO\napproximation error and propose TempO, a latent flow matching model leveraging\nsparse conditioning with channel folding to efficiently process 3D\nspatiotemporal fields using time-conditioned Fourier layers to capture\nmulti-scale modes with high fidelity. TempO outperforms state-of-the-art\nbaselines across three benchmark PDE datasets, and spectral analysis further\ndemonstrates superior recovery of multi-scale dynamics, while efficiency\nstudies highlight its parameter- and memory-light design compared to\nattention-based or convolutional regressors."}
{"id": "2510.15573", "categories": ["eess.SY", "cs.MA", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15573", "abs": "https://arxiv.org/abs/2510.15573", "authors": ["Jianguo Chen", "Zhengqin Liu", "Jinlong Lei", "Peng Yi", "Yiguang Hong", "Hong Chen"], "title": "Hypergame-based Cognition Modeling and Intention Interpretation for Human-Driven Vehicles in Connected Mixed Traffic", "comment": null, "summary": "With the practical implementation of connected and autonomous vehicles\n(CAVs), the traffic system is expected to remain a mix of CAVs and human-driven\nvehicles (HVs) for the foreseeable future. To enhance safety and traffic\nefficiency, the trajectory planning strategies of CAVs must account for the\ninfluence of HVs, necessitating accurate HV trajectory prediction. Current\nresearch often assumes that human drivers have perfect knowledge of all\nvehicles' objectives, an unrealistic premise. This paper bridges the gap by\nleveraging hypergame theory to account for cognitive and perception limitations\nin HVs. We model human bounded rationality without assuming them to be merely\npassive followers and propose a hierarchical cognition modeling framework that\ncaptures cognitive relationships among vehicles. We further analyze the\ncognitive stability of the system, proving that the strategy profile where all\nvehicles adopt cognitively equilibrium strategies constitutes a hyper Nash\nequilibrium when CAVs accurately learn HV parameters. To achieve this, we\ndevelop an inverse learning algorithm for distributed intention interpretation\nvia vehicle-to-everything (V2X) communication, which extends the framework to\nboth offline and online scenarios. Additionally, we introduce a distributed\ntrajectory prediction and planning approach for CAVs, leveraging the learned\nparameters in real time. Simulations in highway lane-changing scenarios\ndemonstrate the proposed method's accuracy in parameter learning, robustness to\nnoisy trajectory observations, and safety in HV trajectory prediction. The\nresults validate the effectiveness of our method in both offline and online\nimplementations."}
{"id": "2510.15644", "categories": ["cs.LG", "eess.SP", "math.OC", "68W10, 68W15, 68W40, 90C06, 90C35, 90C26", "G.1.6; F.2.1; E.4"], "pdf": "https://arxiv.org/pdf/2510.15644", "abs": "https://arxiv.org/abs/2510.15644", "authors": ["Tomas Ortega", "Hamid Jafarkhani"], "title": "Decentralized Parameter-Free Online Learning", "comment": null, "summary": "We propose the first parameter-free decentralized online learning algorithms\nwith network regret guarantees, which achieve sublinear regret without\nrequiring hyperparameter tuning. This family of algorithms connects multi-agent\ncoin-betting and decentralized online learning via gossip steps. To enable our\ndecentralized analysis, we introduce a novel \"betting function\" formulation for\ncoin-betting that simplifies the multi-agent regret analysis. Our analysis\nshows sublinear network regret bounds and is validated through experiments on\nsynthetic and real datasets. This family of algorithms is applicable to\ndistributed sensing, decentralized optimization, and collaborative ML\napplications."}
{"id": "2510.15186", "categories": ["cs.CR", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15186", "abs": "https://arxiv.org/abs/2510.15186", "authors": ["Gurusha Juneja", "Jayanth Naga Sai Pasupulati", "Alon Albalak", "Wenyue Hua", "William Yang Wang"], "title": "MAGPIE: A benchmark for Multi-AGent contextual PrIvacy Evaluation", "comment": null, "summary": "A core challenge for autonomous LLM agents in collaborative settings is\nbalancing robust privacy understanding and preservation alongside task\nefficacy. Existing privacy benchmarks only focus on simplistic, single-turn\ninteractions where private information can be trivially omitted without\naffecting task outcomes. In this paper, we introduce MAGPIE (Multi-AGent\ncontextual PrIvacy Evaluation), a novel benchmark of 200 high-stakes tasks\ndesigned to evaluate privacy understanding and preservation in multi-agent\ncollaborative, non-adversarial scenarios. MAGPIE integrates private information\nas essential for task resolution, forcing agents to balance effective\ncollaboration with strategic information control. Our evaluation reveals that\nstate-of-the-art agents, including GPT-5 and Gemini 2.5-Pro, exhibit\nsignificant privacy leakage, with Gemini 2.5-Pro leaking up to 50.7% and GPT-5\nup to 35.1% of the sensitive information even when explicitly instructed not\nto. Moreover, these agents struggle to achieve consensus or task completion and\noften resort to undesirable behaviors such as manipulation and power-seeking\n(e.g., Gemini 2.5-Pro demonstrating manipulation in 38.2% of the cases). These\nfindings underscore that current LLM agents lack robust privacy understanding\nand are not yet adequately aligned to simultaneously preserve privacy and\nmaintain effective collaboration in complex environments."}
{"id": "2510.15110", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15110", "abs": "https://arxiv.org/abs/2510.15110", "authors": ["Shih-Yang Liu", "Xin Dong", "Ximing Lu", "Shizhe Diao", "Mingjie Liu", "Min-Hung Chen", "Hongxu Yin", "Yu-Chiang Frank Wang", "Kwang-Ting Cheng", "Yejin Choi", "Jan Kautz", "Pavlo Molchanov"], "title": "DLER: Doing Length pEnalty Right - Incentivizing More Intelligence per Token via Reinforcement Learning", "comment": "NVIDIA-Tech Report", "summary": "Reasoning language models such as OpenAI-o1, DeepSeek-R1, and Qwen achieve\nstrong performance via extended chains of thought but often generate\nunnecessarily long outputs. Maximizing intelligence per token--accuracy\nrelative to response length--remains an open problem. We revisit reinforcement\nlearning (RL) with the simplest length penalty--truncation--and show that\naccuracy degradation arises not from the lack of sophisticated penalties but\nfrom inadequate RL optimization. We identify three key challenges: (i) large\nbias in advantage estimation, (ii) entropy collapse, and (iii) sparse reward\nsignal. We address them with Doing Length pEnalty Right (DLER), a training\nrecipe combining batch-wise reward normalization, higher clipping, dynamic\nsampling, and a simple truncation length penalty. DLER achieves\nstate-of-the-art accuracy--efficiency trade-offs, cutting output length by over\n70 percent while surpassing all previous baseline accuracy. It also improves\ntest-time scaling: compared to DeepSeek-R1-7B, DLER-7B generates multiple\nconcise responses in parallel with 28 percent higher accuracy and lower\nlatency. We further introduce Difficulty-Aware DLER, which adaptively tightens\ntruncation on easier questions for additional efficiency gains. We also propose\nan update-selective merging method that preserves baseline accuracy while\nretaining the concise reasoning ability of the DLER model, which is useful for\nscenarios where RL training data is scarce."}
{"id": "2510.15598", "categories": ["eess.SY", "cs.SY", "93B07, 93C05, 15A66"], "pdf": "https://arxiv.org/pdf/2510.15598", "abs": "https://arxiv.org/abs/2510.15598", "authors": ["Michael Sebek"], "title": "Observer Design over Hypercomplex Quaternions", "comment": "Accepted for presentation at the 24th European Control Conference\n  (ECC 2026), Reykjavik, Iceland. This work was co-funded by the European Union\n  under the project ROBOPROX (reg. no. CZ.02.01.01/00/22 008/0004590)", "summary": "We develop observer design over hypercomplex quaternions in a\ncharacteristic-polynomial-free framework. Using the standard right-module\nconvention, we derive a right observable companion form and its companion\npolynomial that encodes error dynamics via right-eigenvalue similarity classes.\nThe design mirrors the real/complex case - coefficient updates in companion\ncoordinates, followed by a similarity back - yet avoids determinants,\ncharacteristic/minimal polynomials, and Cayley-Hamilton identities that do not\ntransfer to quaternions. We also give an Ackermann-type construction for the\nimportant case of closed-loop companion polynomials with real coefficients,\nensuring similarity-equivariant evaluation. The results yield simple recipes\nfor full-order observers directly over quaternions, clarify the role of right\nspectra and their similarity classes, and pinpoint when classical one-shot\nformulas remain valid. Numerical examples illustrate the method and advantages\nover vectorized or complex-adjoint surrogates."}
{"id": "2510.15701", "categories": ["cs.IT", "cs.AI", "eess.SP", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15701", "abs": "https://arxiv.org/abs/2510.15701", "authors": ["Binggui Zhou", "Bruno Clerckx"], "title": "Beyond-Diagonal RIS Under Non-Idealities: Learning-Based Architecture Discovery and Optimization", "comment": "13 pages, 13 figures, 1 table. This paper has been submitted to IEEE\n  journal for possible publication", "summary": "Beyond-diagonal reconfigurable intelligent surface (BD-RIS) has recently been\nintroduced to enable advanced control over electromagnetic waves to further\nincrease the benefits of traditional RIS in enhancing signal quality and\nimproving spectral and energy efficiency for next-generation wireless networks.\nA significant issue in designing and deploying BD-RIS is the tradeoff between\nits performance and circuit complexity. Despite some efforts in exploring\noptimal architectures with the lowest circuit complexities for ideal BD-RIS,\narchitecture discovery for non-ideal BD-RIS remains uninvestigated. Therefore,\nhow non-idealities and circuit complexity jointly affect the performance of\nBD-RIS remains unclear, making it difficult to achieve the performance -\ncircuit complexity tradeoff in the presence of non-idealities. Essentially,\narchitecture discovery for non-ideal BD-RIS faces challenges from both the\ncomputational complexity of global architecture search and the difficulty in\nachieving global optima. To tackle these challenges, we propose a\nlearning-based two-tier architecture discovery framework (LTTADF) consisting of\nan architecture generator and a performance optimizer to jointly discover\noptimal architectures of non-ideal BD-RIS given specific circuit complexities,\nwhich can effectively explore over a large architecture space while avoiding\ngetting trapped in poor local optima and thus achieving near-optimal solutions\nfor the performance optimization. Numerical results provide valuable insights\nfor deploying non-ideal BD-RIS considering the performance - circuit complexity\ntradeoff."}
{"id": "2510.15188", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15188", "abs": "https://arxiv.org/abs/2510.15188", "authors": ["Ahmed Aly", "Essam Mansour", "Amr Youssef"], "title": "OCR-APT: Reconstructing APT Stories from Audit Logs using Subgraph Anomaly Detection and LLMs", "comment": null, "summary": "Advanced Persistent Threats (APTs) are stealthy cyberattacks that often evade\ndetection in system-level audit logs. Provenance graphs model these logs as\nconnected entities and events, revealing relationships that are missed by\nlinear log representations. Existing systems apply anomaly detection to these\ngraphs but often suffer from high false positive rates and coarse-grained\nalerts. Their reliance on node attributes like file paths or IPs leads to\nspurious correlations, reducing detection robustness and reliability. To fully\nunderstand an attack's progression and impact, security analysts need systems\nthat can generate accurate, human-like narratives of the entire attack. To\naddress these challenges, we introduce OCR-APT, a system for APT detection and\nreconstruction of human-like attack stories. OCR-APT uses Graph Neural Networks\n(GNNs) for subgraph anomaly detection, learning behavior patterns around nodes\nrather than fragile attributes such as file paths or IPs. This approach leads\nto a more robust anomaly detection. It then iterates over detected subgraphs\nusing Large Language Models (LLMs) to reconstruct multi-stage attack stories.\nEach stage is validated before proceeding, reducing hallucinations and ensuring\nan interpretable final report. Our evaluations on the DARPA TC3, OpTC, and\nNODLINK datasets show that OCR-APT outperforms state-of-the-art systems in both\ndetection accuracy and alert interpretability. Moreover, OCR-APT reconstructs\nhuman-like reports that comprehensively capture the attack story."}
{"id": "2510.15127", "categories": ["cs.LG", "math.OC", "q-bio.QM"], "pdf": "https://arxiv.org/pdf/2510.15127", "abs": "https://arxiv.org/abs/2510.15127", "authors": ["David J. Albers", "Tell D. Bennett", "Jana de Wiljes", "Bradford J. Smith", "Peter D. Sottile", "J. N. Stroh"], "title": "Navigating the consequences of mechanical ventilation in clinical intensive care settings through an evolutionary game-theoretic framework", "comment": null, "summary": "Identifying the effects of mechanical ventilation strategies and protocols in\ncritical care requires analyzing data from heterogeneous patient-ventilator\nsystems within the context of the clinical decision-making environment. This\nresearch develops a framework to help understand the consequences of mechanical\nventilation (MV) and adjunct care decisions on patient outcome from\nobservations of critical care patients receiving MV. Developing an\nunderstanding of and improving critical care respiratory management requires\nthe analysis of existing secondary-use clinical data to generate hypotheses\nabout advantageous variations and adaptations of current care. This work\nintroduces a perspective of the joint patient-ventilator-care systems\n(so-called J6) to develop a scalable method for analyzing data and trajectories\nof these complex systems. To that end, breath behaviors are analyzed using\nevolutionary game theory (EGT), which generates the necessary quantitative\nprecursors for deeper analysis through probabilistic and stochastic machinery\nsuch as reinforcement learning. This result is one step along the pathway\ntoward MV optimization and personalization. The EGT-based process is\nanalytically validated on synthetic data to reveal potential caveats before\nproceeding to real-world ICU data applications that expose complexities of the\ndata-generating process J6. The discussion includes potential developments\ntoward a state transition model for the simulating effects of MV decision using\nempirical and game-theoretic elements."}
{"id": "2510.15613", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15613", "abs": "https://arxiv.org/abs/2510.15613", "authors": ["Clément Moureau", "Thomas Stegen", "Mevludin Glavic", "Bertrand Cornélusse"], "title": "A Predictive Flexibility Aggregation Method for Low Voltage Distribution System Control", "comment": "8 pages, 6 figures", "summary": "This paper presents a predictive control strategy to manage low-voltage\ndistribution systems. The proposed approach relies on an aggregate of the\nflexibility at the residential unit level into a three-dimensional chart that\nrepresents the injected active and reactive power, and the flexibility cost.\nFirst, this method solves a multiparametric optimization problem offline at the\nresidential unit level to aggregate the flexibility of the assets. Then, a\nsemi-explicit model predictive control problem is solved to account for\nforecasts. By combining the results of these problems with measurements, the\nmethod generates the desired flexibility chart. The proposed approach is\ncompatible with realtime control requirements, as heavy computations are\nperformed offline locally, making it naturally parallelizable. By linking\nrealtime flexibility assessment with energy scheduling, our approach enables\nefficient, low-cost, and privacy-preserving management of low-voltage\ndistribution systems. We validate this method on a low-voltage network of 5\nbuses by comparing it with an ideal technique."}
{"id": "2510.15303", "categories": ["cs.CR", "cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2510.15303", "abs": "https://arxiv.org/abs/2510.15303", "authors": ["Ting Qiao", "Xing Liu", "Wenke Huang", "Jianbin Li", "Zhaoxin Fan", "Yiming Li"], "title": "DSSmoothing: Toward Certified Dataset Ownership Verification for Pre-trained Language Models via Dual-Space Smoothing", "comment": "13 pages, 21 figures", "summary": "Large web-scale datasets have driven the rapid advancement of pre-trained\nlanguage models (PLMs), but unauthorized data usage has raised serious\ncopyright concerns. Existing dataset ownership verification (DOV) methods\ntypically assume that watermarks remain stable during inference; however, this\nassumption often fails under natural noise and adversary-crafted perturbations.\nWe propose the first certified dataset ownership verification method for PLMs\nbased on dual-space smoothing (i.e., DSSmoothing). To address the challenges of\ntext discreteness and semantic sensitivity, DSSmoothing introduces continuous\nperturbations in the embedding space to capture semantic robustness and applies\ncontrolled token reordering in the permutation space to capture sequential\nrobustness. DSSmoothing consists of two stages: in the first stage, triggers\nare collaboratively embedded in both spaces to generate norm-constrained and\nrobust watermarked datasets; in the second stage, randomized smoothing is\napplied in both spaces during verification to compute the watermark robustness\n(WR) of suspicious models and statistically compare it with the principal\nprobability (PP) values of a set of benign models. Theoretically, DSSmoothing\nprovides provable robustness guarantees for dataset ownership verification by\nensuring that WR consistently exceeds PP under bounded dual-space\nperturbations. Extensive experiments on multiple representative web datasets\ndemonstrate that DSSmoothing achieves stable and reliable verification\nperformance and exhibits robustness against potential adaptive attacks."}
{"id": "2510.15132", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15132", "abs": "https://arxiv.org/abs/2510.15132", "authors": ["Alex Shtoff"], "title": "A Simple Method for PMF Estimation on Large Supports", "comment": null, "summary": "We study nonparametric estimation of a probability mass function (PMF) on a\nlarge discrete support, where the PMF is multi-modal and heavy-tailed. The core\nidea is to treat the empirical PMF as a signal on a line graph and apply a\ndata-dependent low-pass filter. Concretely, we form a symmetric tri-diagonal\noperator, the path graph Laplacian perturbed with a diagonal matrix built from\nthe empirical PMF, then compute the eigenvectors, corresponding to the smallest\nfeq eigenvalues. Projecting the empirical PMF onto this low dimensional\nsubspace produces a smooth, multi-modal estimate that preserves coarse\nstructure while suppressing noise. A light post-processing step of clipping and\nre-normalizing yields a valid PMF.\n  Because we compute the eigenpairs of a symmetric tridiagonal matrix, the\ncomputation is reliable and runs time and memory proportional to the support\ntimes the dimension of the desired low-dimensional supspace. We also provide a\npractical, data-driven rule for selecting the dimension based on an\northogonal-series risk estimate, so the method \"just works\" with minimal\ntuning. On synthetic and real heavy-tailed examples, the approach preserves\ncoarse structure while suppressing sampling noise, compares favorably to\nlogspline and Gaussian-KDE baselines in the intended regimes. However, it has\nknown failure modes (e.g., abrupt discontinuities). The method is short to\nimplement, robust across sample sizes, and suitable for automated pipelines and\nexploratory analysis at scale because of its reliability and speed."}
{"id": "2510.15695", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15695", "abs": "https://arxiv.org/abs/2510.15695", "authors": ["Sheng Wang", "Muhammad Maladoh Bah"], "title": "Cross-border offshore hydrogen trade and carbon mitigation for Europe's net zero transition", "comment": null, "summary": "European countries are ambitious in both the net-zero transition and offshore\nenergy resource development. The Irish and UK governments announced their\ncommitments to offshore wind capacities - 37 and 125 GW, respectively, in 2050,\nmore than two times higher than their projected power demands. While other\ncontinental countries, such as Germany, are calling for cleaner fuel resources.\nExporting surplus offshore green hydrogen and bridging supply and demand could\nbe pivotal in carbon emission mitigation for Europe. Yet, the potentials of\nthese Island countries, are usually underestimated. This paper developed a\nbottom-up method to investigate the role of offshore hydrogen from Ireland and\nthe UK in the decarbonisation of the entire Europe. We evaluate the future\nhydrogen/ammonia trading and the contributions of each country in carbon\nemission mitigation, considering their relative cost-competitiveness in\noffshore hydrogen production, domestic hourly power and gas system operation,\nand international shipping costs. Results indicate that the offshore green\nhydrogen could reduce 175.16 Mt/year of carbon dioxide emissions in Europe. The\nUK will be the largest hydrogen supplier from 2030 to 2040, while surpassed by\nIreland in 2050, with 161 TWh of hydrogen exports to France and Spain. The\noffshore green hydrogen can contribute to 175.16 Mt of annual carbon dioxide\nemission reductions in total. This general flow of hydrogen from the West to\nthe East not only facilitates Europe's net-zero progress, but also reshapes the\nenergy supply structure and helps to ensure energy security across the European\ncontinent."}
{"id": "2510.15367", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.15367", "abs": "https://arxiv.org/abs/2510.15367", "authors": ["Ruyuan Zhang", "Jinguang Han", "Liqun Chen"], "title": "Flexible Threshold Multi-client Functional Encryption for Inner Product in Federated Learning", "comment": null, "summary": "Federated learning (FL) is a distributed machine learning paradigm that\nenables multiple clients to collaboratively train a shared model without\ndisclosing their local data. To address privacy issues of gradient, several\nprivacy-preserving machine-learning schemes based on multi-client functional\nencryption (MCFE) have been proposed. However, existing MCFE-based schemes\ncannot support client dropout or flexible threshold selection, which are\nessential for practical FL. In this paper, we design a flexible threshold\nmulti-client functional encryption for inner product (FTMCFE-IP) scheme, where\nmultiple clients generate ciphertexts independently without any interaction. In\nthe encryption phase, clients are able to choose a threshold flexibly without\nreinitializing the system. The decryption can be performed correctly when the\nnumber of online clients satisfies the threshold. An authorized user are\nallowed to compute the inner product of the vectors associated with his/her\nfunctional key and the ciphertext, respectively, but cannot learning anything\nelse. Especially, the presented scheme supports clients drop out. Furthermore,\nwe provide the definition and security model of our FTMCFE-IP scheme,and\npropose a concrete construction. The security of the designed scheme is\nformally proven. Finally, we implement and evaluate our FTMCFE-IP scheme."}
{"id": "2510.15136", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15136", "abs": "https://arxiv.org/abs/2510.15136", "authors": ["Oluwasegun Adegoke"], "title": "Predicting the Unpredictable: Reproducible BiLSTM Forecasting of Incident Counts in the Global Terrorism Database (GTD)", "comment": "12 pages, 5 figures, 2 tables. Code & reproducibility:\n  https://github.com/Davidavid45/Deep-Learning-in-Counterterrorism Data/ethics:\n  GTD used under research-only terms; no raw GTD is redistributed", "summary": "We study short-horizon forecasting of weekly terrorism incident counts using\nthe Global Terrorism Database (GTD, 1970--2016). We build a reproducible\npipeline with fixed time-based splits and evaluate a Bidirectional LSTM\n(BiLSTM) against strong classical anchors (seasonal-naive, linear/ARIMA) and a\ndeep LSTM-Attention baseline. On the held-out test set, the BiLSTM attains RMSE\n6.38, outperforming LSTM-Attention (9.19; +30.6\\%) and a linear lag-regression\nbaseline (+35.4\\% RMSE gain), with parallel improvements in MAE and MAPE.\nAblations varying temporal memory, training-history length, spatial grain,\nlookback size, and feature groups show that models trained on long historical\ndata generalize best; a moderate lookback (20--30 weeks) provides strong\ncontext; and bidirectional encoding is critical for capturing both build-up and\naftermath patterns within the window. Feature-group analysis indicates that\nshort-horizon structure (lagged counts and rolling statistics) contributes\nmost, with geographic and casualty features adding incremental lift. We release\ncode, configs, and compact result tables, and provide a data/ethics statement\ndocumenting GTD licensing and research-only use. Overall, the study offers a\ntransparent, baseline-beating reference for GTD incident forecasting."}
{"id": "2510.15707", "categories": ["eess.SY", "cs.SY", "physics.ao-ph"], "pdf": "https://arxiv.org/pdf/2510.15707", "abs": "https://arxiv.org/abs/2510.15707", "authors": ["Martín de Frutos", "Laura Botero-Bolívar", "Esteban Ferrer"], "title": "Mitigating Underwater Noise from Offshore Wind Turbines via Individual Pitch Control", "comment": null, "summary": "This paper proposes a pitch control strategy to mitigate the underwater\nacoustic footprint of offshore wind turbines, a measure that will soon become\nnecessary to minimize impacts on marine life, which rely on sound for\ncommunication, navigation, and survival. First, we quantify the underwater\nacoustic signature of blade-generated aerodynamic noise from three reference\nturbines, the NREL 5 MW, DTU 10 MW, and IEA 22 MW, using coupling blade element\nmomentum and coupled air-water acoustic propagation modeling. Second, we\npropose and implement an open-loop individual pitch control (IPC) strategy that\nmodulates the pitch of the blade at the blade passing frequency to attenuate\nthe overall sound pressure level (OSPL) and the amplitude modulation (AM) of\nthe transmitted noise. Third, we benchmark IPC performance against conventional\npitch schemes. The results indicate that up to 5 dB reductions in OSPL and a\ndecrease in AM depth 20% can be achieved with a pitch variation of\n$\\Delta\\theta\\approx 5^\\circ$, with small losses (5-10%) in energy capture.\nThese findings highlight a previously underappreciated noise pathway and\ndemonstrate that targeted blade-pitch modulation can mitigate its impact."}
{"id": "2510.15380", "categories": ["cs.CR", "cs.IT", "eess.SP", "math.IT"], "pdf": "https://arxiv.org/pdf/2510.15380", "abs": "https://arxiv.org/abs/2510.15380", "authors": ["Axel Flinth", "Hubert Orlicki", "Semira Einsele", "Gerhard Wunder"], "title": "Bilinear Compressive Security", "comment": null, "summary": "Beyond its widespread application in signal and image processing,\n\\emph{compressed sensing} principles have been greatly applied to secure\ninformation transmission (often termed 'compressive security'). In this\nscenario, the measurement matrix $Q$ acts as a one time pad encryption key (in\ncomplex number domain) which can achieve perfect information-theoretic security\ntogether with other benefits such as reduced complexity and energy efficiency\nparticularly useful in IoT. However, unless the matrix is changed for every\nmessage it is vulnerable towards known plain text attacks: only $n$\nobservations suffices to recover a key $Q$ with $n$ columns. In this paper, we\ninvent and analyze a new method (termed 'Bilinear Compressive Security (BCS)')\naddressing these shortcomings: In addition to the linear encoding of the\nmessage $x$ with a matrix $Q$, the sender convolves the resulting vector with a\nrandomly generated filter $h$. Assuming that $h$ and $x$ are sparse, the\nreceiver can then recover $x$ without knowledge of $h$ from $y=h*Qx$ through\nblind deconvolution. We study a rather idealized known plaintext attack for\nrecovering $Q$ from repeated observations of $y$'s for different, known $x_k$,\nwith varying and unknown $h$ ,giving Eve a number of advantages not present in\npractice. Our main result for BCS states that under a weak symmetry condition\non the filter $h$, recovering $Q$ will require extensive sampling from\ntransmissions of $\\Omega\\left(\\max\\left(n,(n/s)^2\\right)\\right)$ messages $x_k$\nif they are $s$-sparse. Remarkably, with $s=1$ it is impossible to recover the\nkey. In this way, the scheme is much safer than standard compressed sensing\neven though our assumptions are much in favor towards a potential attacker."}
{"id": "2510.15165", "categories": ["cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2510.15165", "abs": "https://arxiv.org/abs/2510.15165", "authors": ["Xin Guo", "Zijiu Lyu"], "title": "Policy Transfer Ensures Fast Learning for Continuous-Time LQR with Entropy Regularization", "comment": null, "summary": "Reinforcement Learning (RL) enables agents to learn optimal decision-making\nstrategies through interaction with an environment, yet training from scratch\non complex tasks can be highly inefficient. Transfer learning (TL), widely\nsuccessful in large language models (LLMs), offers a promising direction for\nenhancing RL efficiency by leveraging pre-trained models.\n  This paper investigates policy transfer, a TL approach that initializes\nlearning in a target RL task using a policy from a related source task, in the\ncontext of continuous-time linear quadratic regulators (LQRs) with entropy\nregularization. We provide the first theoretical proof of policy transfer for\ncontinuous-time RL, proving that a policy optimal for one LQR serves as a\nnear-optimal initialization for closely related LQRs, while preserving the\noriginal algorithm's convergence rate. Furthermore, we introduce a novel policy\nlearning algorithm for continuous-time LQRs that achieves global linear and\nlocal super-linear convergence. Our results demonstrate both theoretical\nguarantees and algorithmic benefits of transfer learning in continuous-time RL,\naddressing a gap in existing literature and extending prior work from discrete\nto continuous time settings.\n  As a byproduct of our analysis, we derive the stability of a class of\ncontinuous-time score-based diffusion models via their connection with LQRs."}
{"id": "2510.15708", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15708", "abs": "https://arxiv.org/abs/2510.15708", "authors": ["Thomas Bernard", "François Grondin", "Jean-Michel Lavoie"], "title": "Sugar Shack 4.0: Practical Demonstration of an IIoT-Based Event-Driven Automation System", "comment": "10 pages, 15 figures", "summary": "This paper presents a practical alternative to\nprogrammable-logic-controller-centric automation by implementing an\nevent-driven architecture built with industrial Internet of Things tools. A\nlayered design on a local edge server (i) abstracts actuators, (ii) enforces\nmutual exclusion of shared physical resources through an interlock with\npriority queueing, (iii) composes deterministic singular operations, and (iv)\norchestrates complete workflows as state machines in Node-RED, with\ncommunication over MQTT. The device layer uses low-cost ESP32-based gateways to\ninterface sensors and actuators, while all automation logic is offloaded to the\nserver side. As part of a larger project involving the first\nscientifically-documented integration of Industry 4.0 technologies in a maple\nsyrup boiling center, this work demonstrates the deployment of the proposed\nsystem as a case-study. Evaluation over an entire production season shows\nmedian message time of flight around one tenth of a second, command\nissuance-to-motion latencies of about two to three seconds, and command\ncompletion near six seconds dominated by actuator mechanics; operation runtimes\nspan tens of seconds to minutes. These results indicate that network and\norchestration overheads are negligible relative to process dynamics, enabling\nmodular, distributed control without compromising determinism or fault\nisolation. The approach reduces material and integration effort, supports\nportable containerized deployment, and naturally enables an edge/cloud split in\nwhich persistence and analytics are offloaded while automation remains at the\nedge."}
{"id": "2510.15413", "categories": ["cs.CR", "cs.DB"], "pdf": "https://arxiv.org/pdf/2510.15413", "abs": "https://arxiv.org/abs/2510.15413", "authors": ["Po-Yu Tseng", "Po-Chu Hsu", "Shih-Wei Liao"], "title": "FHE-SQL: Fully Homomorphic Encrypted SQL Database", "comment": "12 pages, 1 figures, Keywords: Fully Homomorphic Encryption, Private\n  Information Retrieval, Encrypted Databases, Privacy-Preserving Systems", "summary": "FHE-SQL is a privacy-preserving database system that enables secure query\nprocessing on encrypted data using Fully Homomorphic Encryption (FHE),\nproviding privacy guaranties where an untrusted server can execute encrypted\nqueries without learning either the query contents or the underlying data.\nUnlike property-preserving encryption-based systems such as CryptDB, which rely\non deterministic or order-preserving encryption and are vulnerable to\nfrequency, order, and equality-pattern inference attacks, FHE-SQL performs\ncomputations entirely under encryption, eliminating these leakage channels.\nCompared to trusted-hardware approaches such as TrustedDB, which depend on a\nhardware security module and thus inherit its trust and side-channel\nlimitations, our design achieves end-to-end cryptographic protection without\nrequiring trusted execution environments. In contrast to high-performance\nFHE-based engines-Hermes, which target specialized workloads such as vector\nsearch, FHE-SQL supports general SQL query semantics with schema-aware,\ntype-safe definitions suitable for relational data management. FHE-SQL\nmitigates the high cost of ciphertext space by using an indirection\narchitecture that separates metadata in RocksDB from large ciphertexts in blob\nstorage. It supports oblivious selection via homomorphic boolean masks,\nmulti-tier caching, and garbage collection, with security proven under the\nUniversal Composability framework."}
{"id": "2510.15174", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15174", "abs": "https://arxiv.org/abs/2510.15174", "authors": ["Niclas Göring", "Chris Mingard", "Yoonsoo Nam", "Ard Louis"], "title": "A simple mean field model of feature learning", "comment": null, "summary": "Feature learning (FL), where neural networks adapt their internal\nrepresentations during training, remains poorly understood. Using methods from\nstatistical physics, we derive a tractable, self-consistent mean-field (MF)\ntheory for the Bayesian posterior of two-layer non-linear networks trained with\nstochastic gradient Langevin dynamics (SGLD). At infinite width, this theory\nreduces to kernel ridge regression, but at finite width it predicts a symmetry\nbreaking phase transition where networks abruptly align with target functions.\nWhile the basic MF theory provides theoretical insight into the emergence of FL\nin the finite-width regime, semi-quantitatively predicting the onset of FL with\nnoise or sample size, it substantially underestimates the improvements in\ngeneralisation after the transition. We trace this discrepancy to a key\nmechanism absent from the plain MF description: \\textit{self-reinforcing input\nfeature selection}. Incorporating this mechanism into the MF theory allows us\nto quantitatively match the learning curves of SGLD-trained networks and\nprovides mechanistic insight into FL."}
{"id": "2510.15740", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15740", "abs": "https://arxiv.org/abs/2510.15740", "authors": ["Geon Roh", "Jip Kim"], "title": "Integrating Conductor Health into Dynamic Line Rating and Unit Commitment under Uncertainty", "comment": null, "summary": "Dynamic line rating (DLR) enables greater utilization of existing\ntransmission lines by leveraging real-time weather data. However, the elevated\ntemperature operation (ETO) of conductors under DLR is often overlooked,\ndespite its long-term impact on conductor health. This paper addresses this\nissue by 1) quantifying depreciation costs associated with ETO and 2) proposing\na Conductor Health-Aware Unit Commitment (CHA-UC) that internalizes these costs\nin operational decisions. The CHA-UC incorporates a robust linear approximation\nof conductor temperature and integration of expected depreciation costs due to\nhourly ETO into the objective function. Case studies on the Texas 123-bus\nbackbone test system using NOAA weather data demonstrate that the proposed\nCHA-UC model reduces the total cost by 0.8% and renewable curtailment by\n84%compared to static line rating (SLR), while conventional DLR operation\nwithout risk consideration resulted in higher costs due to excessive ETO.\nFurther analysis of the commitment decisions and the line temperature\nstatistics confirms that the CHA-UC achieves safer line flows by shifting\ngenerator commitments. Finally, we examine the emergent correlation between\nwind generation and DLR forecast errors, and show that CHA-UC adaptively\nmanages this effect by relaxing flows for risk-hedging conditions while\ntightening flows for risk-amplifying ones."}
{"id": "2510.15476", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15476", "abs": "https://arxiv.org/abs/2510.15476", "authors": ["Hanbin Hong", "Shuya Feng", "Nima Naderloui", "Shenao Yan", "Jingyu Zhang", "Biying Liu", "Ali Arastehfard", "Heqing Huang", "Yuan Hong"], "title": "SoK: Taxonomy and Evaluation of Prompt Security in Large Language Models", "comment": null, "summary": "Large Language Models (LLMs) have rapidly become integral to real-world\napplications, powering services across diverse sectors. However, their\nwidespread deployment has exposed critical security risks, particularly through\njailbreak prompts that can bypass model alignment and induce harmful outputs.\nDespite intense research into both attack and defense techniques, the field\nremains fragmented: definitions, threat models, and evaluation criteria vary\nwidely, impeding systematic progress and fair comparison. In this\nSystematization of Knowledge (SoK), we address these challenges by (1)\nproposing a holistic, multi-level taxonomy that organizes attacks, defenses,\nand vulnerabilities in LLM prompt security; (2) formalizing threat models and\ncost assumptions into machine-readable profiles for reproducible evaluation;\n(3) introducing an open-source evaluation toolkit for standardized, auditable\ncomparison of attacks and defenses; (4) releasing JAILBREAKDB, the largest\nannotated dataset of jailbreak and benign prompts to date; and (5) presenting a\ncomprehensive evaluation and leaderboard of state-of-the-art methods. Our work\nunifies fragmented research, provides rigorous foundations for future studies,\nand supports the development of robust, trustworthy LLMs suitable for\nhigh-stakes deployment."}
{"id": "2510.15177", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15177", "abs": "https://arxiv.org/abs/2510.15177", "authors": ["Conor Rowan"], "title": "Finding geodesics with the Deep Ritz method", "comment": null, "summary": "Geodesic problems involve computing trajectories between prescribed initial\nand final states to minimize a user-defined measure of distance, cost, or\nenergy. They arise throughout physics and engineering -- for instance, in\ndetermining optimal paths through complex environments, modeling light\npropagation in refractive media, and the study of spacetime trajectories in\ncontrol theory and general relativity. Despite their ubiquity, the scientific\nmachine learning (SciML) community has given relatively little attention to\ninvestigating its methods in the context of these problems. In this work, we\nargue that given their simple geometry, variational structure, and natural\nnonlinearity, geodesic problems are particularly well-suited for the Deep Ritz\nmethod. We substantiate this claim with three numerical examples drawn from\npath planning, optics, and solid mechanics. Our goal is not to provide an\nexhaustive study of geodesic problems, but rather to identify a promising\napplication of the Deep Ritz method and a fruitful direction for future SciML\nresearch."}
{"id": "2510.15797", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15797", "abs": "https://arxiv.org/abs/2510.15797", "authors": ["Laszlo Gacsi", "Adam K. Kiss", "Tamas G. Molnar"], "title": "Braking within Barriers: Constructive Safety-Critical Control for Input-Constrained Vehicles via the Backup Set Method", "comment": "Submitted to the IEEE Transactions on Automation Science and\n  Engineering. 14 pages, 10 figures", "summary": "This paper presents a safety-critical control framework to maintain bounded\nlateral motions for vehicles braking on asymmetric surfaces. We synthesize a\nbrake controller that assists drivers and guarantees safety against excessive\nlateral motions (i.e., prevents the vehicle from spinning out) while minimizing\nthe stopping distance. We address this safety-critical control problem in the\npresence of input constraints, since braking forces are limited by the\navailable friction on the road. We use backup control barrier functions for\nsafe control design. As this approach requires the construction of a backup set\nand a backup controller, we propose a novel, systematic method to creating\nvalid backup set-backup controller pairs based on feedback linearization and\ncontinuous-time Lyapunov equations. We use simple examples to demonstrate our\nproposed safety-critical control method. Finally, we implement our approach on\na four-wheel vehicle model for braking on asymmetric surfaces and present\nsimulation results."}
{"id": "2510.15499", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.15499", "abs": "https://arxiv.org/abs/2510.15499", "authors": ["Yuexiao Liu", "Lijun Li", "Xingjun Wang", "Jing Shao"], "title": "HarmRLVR: Weaponizing Verifiable Rewards for Harmful LLM Alignment", "comment": null, "summary": "Recent advancements in Reinforcement Learning with Verifiable Rewards (RLVR)\nhave gained significant attention due to their objective and verifiable reward\nsignals, demonstrating strong performance in reasoning and code generation\ntasks. However, the potential safety risks associated with RLVR remain\nunderexplored. This paper presents HarmRLVR, the first systematic investigation\ninto the alignment reversibility risk of RLVR. We show that safety alignment\ncan be rapidly reversed using GRPO with merely 64 harmful prompts without\nresponses, causing models to readily comply with harmful instructions. Across\nfive models from Llama, Qwen, and DeepSeek, we empirically demonstrate that\nRLVR-based attacks elevate the average harmfulness score to 4.94 with an attack\nsuccess rate of 96.01\\%, significantly outperforming harmful fine-tuning while\npreserving general capabilities. Our findings reveal that RLVR can be\nefficiently exploited for harmful alignment, posing serious threats to\nopen-source model safety. Please see our code at\nhttps://github.com/lyxx2535/HarmRLVR."}
{"id": "2510.15179", "categories": ["cs.LG", "physics.med-ph"], "pdf": "https://arxiv.org/pdf/2510.15179", "abs": "https://arxiv.org/abs/2510.15179", "authors": ["Shuo Sun", "Meiling Zhou", "Chen Zhao", "Joyce H. Keyak", "Nancy E. Lane", "Jeffrey D. Deng", "Kuan-Jui Su", "Hui Shen", "Hong-Wen Deng", "Kui Zhang", "Weihua Zhou"], "title": "An Advanced Two-Stage Model with High Sensitivity and Generalizability for Prediction of Hip Fracture Risk Using Multiple Datasets", "comment": "38 pages, 3 figures, 8 tables. This is a preprint version of the\n  manuscript titled \"An Advanced Two-Stage Model with High Sensitivity and\n  Generalizability for Prediction of Hip Fracture Risk Using Multiple\n  Datasets.\" The paper is currently under journal submission", "summary": "Hip fractures are a major cause of disability, mortality, and healthcare\nburden in older adults, underscoring the need for early risk assessment.\nHowever, commonly used tools such as the DXA T-score and FRAX often lack\nsensitivity and miss individuals at high risk, particularly those without prior\nfractures or with osteopenia. To address this limitation, we propose a\nsequential two-stage model that integrates clinical and imaging information to\nimprove prediction accuracy. Using data from the Osteoporotic Fractures in Men\nStudy (MrOS), the Study of Osteoporotic Fractures (SOF), and the UK Biobank,\nStage 1 (Screening) employs clinical, demographic, and functional variables to\nestimate baseline risk, while Stage 2 (Imaging) incorporates DXA-derived\nfeatures for refinement. The model was rigorously validated through internal\nand external testing, showing consistent performance and adaptability across\ncohorts. Compared to T-score and FRAX, the two-stage framework achieved higher\nsensitivity and reduced missed cases, offering a cost-effective and\npersonalized approach for early hip fracture risk assessment.\n  Keywords: Hip Fracture, Two-Stage Model, Risk Prediction, Sensitivity, DXA,\nFRAX"}
{"id": "2510.15847", "categories": ["eess.SY", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15847", "abs": "https://arxiv.org/abs/2510.15847", "authors": ["Panos C. Papageorgiou", "Anastasios E. Giannopoulos", "Sotirios T. Spantideas"], "title": "Bio-inspired Microgrid Management based on Brain's Sensorimotor Gating", "comment": null, "summary": "Microgrids are emerging as key enablers of resilient, sustainable, and\nintelligent power systems, but they continue to face challenges in dynamic\ndisturbance handling, protection coordination, and uncertainty. Recent efforts\nhave explored Brain Emotional Learning (BEL) controllers as bio-inspired\nsolutions for microgrid control. Building on this growing trajectory, this\narticle introduces a new paradigm for Neuro-Microgrids, inspired by the brain's\nsensorimotor gating mechanisms, specifically the Prepulse Inhibition (PPI) and\nPrepulse Facilitation (PPF). Sensorimotor gating offers a biological model for\nselectively suppressing or amplifying responses depending on contextual\nrelevance. By mapping these principles onto the hierarchical control\narchitecture of microgrids, we propose a Sensorimotor Gating-Inspired\nNeuro-Microgrid (SG-NMG) framework. In this architecture, PPI-like control\ndecisions correspond to protective damping in primary and secondary management\nof microgrids, whereas PPF-like decisions correspond to adaptive amplification\nof corrective control actions. The framework is presented through analytical\nworkflow design, neuro-circuitry analogies, and integration with machine\nlearning methods. Finally, open challenges and research directions are\noutlined, including the mathematical modeling of gating, digital twin\nvalidation, and cross-disciplinary collaboration between neuroscience and\nindustrial power systems. The resulting paradigm highlights sensorimotor gating\nas a promising framework for designing self-protective, adaptive, and resilient\nmicrogrids."}
{"id": "2510.15515", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2510.15515", "abs": "https://arxiv.org/abs/2510.15515", "authors": ["Meir Ariel"], "title": "High Memory Masked Convolutional Codes for PQC", "comment": null, "summary": "This paper presents a novel post-quantum cryptosystem based on high-memory\nmasked convolutional codes. Unlike conventional code-based schemes that rely on\nblock codes with fixed dimensions and limited error-correction capability, our\nconstruction offers both stronger cryptographic security and greater\nflexibility. It supports arbitrary plaintext lengths with linear-time\ndecryption and uniform per-bit computational cost, enabling seamless\nscalability to long messages. Security is reinforced through a higher-rate\ninjection of random errors than in block-code approaches, along with additional\nnoise introduced via polynomial division, which substantially obfuscates the\nunderlying code structure. Semi-invertible transformations generate dense,\nrandom-like generator matrices that conceal algebraic properties and resist\nknown structural attacks. Consequently, the scheme achieves cryptanalytic\nsecurity margins exceeding those of the classic McEliece system by factors\ngreater than 2100. Finally, decryption at the recipient employs an array of\nparallel Viterbi decoders, enabling efficient hardware and software\nimplementation and positioning the scheme as a strong candidate for deployment\nin practical quantum-resistant public-key cryptosystems."}
{"id": "2510.15201", "categories": ["cs.LG", "cs.AI", "cs.NA", "math.NA", "physics.app-ph", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2510.15201", "abs": "https://arxiv.org/abs/2510.15201", "authors": ["Mohammad Amin Nabian", "Sudeep Chavare", "Deepak Akhare", "Rishikesh Ranade", "Ram Cherukuri", "Srinivas Tadepalli"], "title": "Automotive Crash Dynamics Modeling Accelerated with Machine Learning", "comment": null, "summary": "Crashworthiness assessment is a critical aspect of automotive design,\ntraditionally relying on high-fidelity finite element (FE) simulations that are\ncomputationally expensive and time-consuming. This work presents an exploratory\ncomparative study on developing machine learning-based surrogate models for\nefficient prediction of structural deformation in crash scenarios using the\nNVIDIA PhysicsNeMo framework. Given the limited prior work applying machine\nlearning to structural crash dynamics, the primary contribution lies in\ndemonstrating the feasibility and engineering utility of the various modeling\napproaches explored in this work. We investigate two state-of-the-art neural\nnetwork architectures for modeling crash dynamics: MeshGraphNet, and\nTransolver. Additionally, we examine three strategies for modeling transient\ndynamics: time-conditional, the standard Autoregressive approach, and a\nstability-enhanced Autoregressive scheme incorporating rollout-based training.\nThe models are evaluated on a comprehensive Body-in-White (BIW) crash dataset\ncomprising 150 detailed FE simulations using LS-DYNA. The dataset represents a\nstructurally rich vehicle assembly with over 200 components, including 38 key\ncomponents featuring variable thickness distributions to capture realistic\nmanufacturing variability. Each model utilizes the undeformed mesh geometry and\ncomponent characteristics as inputs to predict the spatiotemporal evolution of\nthe deformed mesh during the crash sequence. Evaluation results show that the\nmodels capture the overall deformation trends with reasonable fidelity,\ndemonstrating the feasibility of applying machine learning to structural crash\ndynamics. Although not yet matching full FE accuracy, the models achieve\norders-of-magnitude reductions in computational cost, enabling rapid design\nexploration and early-stage optimization in crashworthiness evaluation."}
{"id": "2510.14983", "categories": ["cs.LG", "cs.HC", "cs.SY", "eess.SY"], "pdf": "https://arxiv.org/pdf/2510.14983", "abs": "https://arxiv.org/abs/2510.14983", "authors": ["Oskar Triebe", "Fletcher Passow", "Simon Wittner", "Leonie Wagner", "Julio Arend", "Tao Sun", "Chad Zanocco", "Marek Miltner", "Arezou Ghesmati", "Chen-Hao Tsai", "Christoph Bergmeir", "Ram Rajagopal"], "title": "Extending Load Forecasting from Zonal Aggregates to Individual Nodes for Transmission System Operators", "comment": "Collaborative Research, Stanford University and Midcontinent\n  Independent System Operator", "summary": "The reliability of local power grid infrastructure is challenged by\nsustainable energy developments increasing electric load uncertainty.\nTransmission System Operators (TSOs) need load forecasts of higher spatial\nresolution, extending current forecasting operations from zonal aggregates to\nindividual nodes. However, nodal loads are less accurate to forecast and\nrequire a large number of individual forecasts, which are hard to manage for\nthe human experts assessing risks in the control room's daily operations\n(operator). In collaboration with a TSO, we design a multi-level system that\nmeets the needs of operators for hourly day-ahead load forecasting. Utilizing a\nuniquely extensive dataset of zonal and nodal net loads, we experimentally\nevaluate our system components. First, we develop an interpretable and scalable\nforecasting model that allows for TSOs to gradually extend zonal operations to\ninclude nodal forecasts. Second, we evaluate solutions to address the\nheterogeneity and volatility of nodal load, subject to a trade-off. Third, our\nsystem is manageable with a fully parallelized single-model forecasting\nworkflow. Our results show accuracy and interpretability improvements for zonal\nforecasts, and substantial improvements for nodal forecasts. In practice, our\nmulti-level forecasting system allows operators to adjust forecasts with\nunprecedented confidence and accuracy, and to diagnose otherwise opaque errors\nprecisely."}
{"id": "2510.15567", "categories": ["cs.CR", "cs.SE"], "pdf": "https://arxiv.org/pdf/2510.15567", "abs": "https://arxiv.org/abs/2510.15567", "authors": ["Eduard Andrei Cristea", "Petter Molnes", "Jingyue Li"], "title": "MalCVE: Malware Detection and CVE Association Using Large Language Models", "comment": null, "summary": "Malicious software attacks are having an increasingly significant economic\nimpact. Commercial malware detection software can be costly, and tools that\nattribute malware to the specific software vulnerabilities it exploits are\nlargely lacking. Understanding the connection between malware and the\nvulnerabilities it targets is crucial for analyzing past threats and\nproactively defending against current ones. In this study, we propose an\napproach that leverages large language models (LLMs) to detect binary malware,\nspecifically within JAR files, and utilizes the capabilities of LLMs combined\nwith retrieval-augmented generation (RAG) to identify Common Vulnerabilities\nand Exposures (CVEs) that malware may exploit. We developed a proof-of-concept\ntool called MalCVE, which integrates binary code decompilation, deobfuscation,\nLLM-based code summarization, semantic similarity search, and CVE\nclassification using LLMs. We evaluated MalCVE using a benchmark dataset of\n3,839 JAR executables. MalCVE achieved a mean malware detection accuracy of\n97%, at a fraction of the cost of commercial solutions. It is also the first\ntool to associate CVEs with binary malware, achieving a recall@10 of 65%, which\nis comparable to studies that perform similar analyses on source code."}
{"id": "2510.15202", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2510.15202", "abs": "https://arxiv.org/abs/2510.15202", "authors": ["Denis Janiak", "Jakub Binkowski", "Tomasz Kajdanowicz"], "title": "Dissecting Mahalanobis: How Feature Geometry and Normalization Shape OOD Detection", "comment": null, "summary": "Out-of-distribution (OOD) detection is critical for the reliable deployment\nof deep learning models. hile Mahalanobis distance methods are widely used, the\nimpact of representation geometry and normalization on their performance is not\nfully understood, which may limit their downstream application. To address this\ngap, we conducted a comprehensive empirical study across diverse image\nfoundation models, datasets, and distance normalization schemes. First, our\nanalysis shows that Mahalanobis-based methods aren't universally reliable.\nSecond, we define the ideal geometry for data representations and demonstrate\nthat spectral and intrinsic-dimensionality metrics can accurately predict a\nmodel's OOD performance. Finally, we analyze how normalization impacts OOD\nperformance. Building upon these studies, we propose radially scaled $\\ell_2$\nnormalization, a method that generalizes the standard $\\ell_2$ normalization\nrecently applied to Mahalanobis-based OOD detection. Our approach introduces a\ntunable parameter to directly control the radial geometry of the feature space,\nsystematically contracting or expanding representations to significantly\nimprove OOD detection performance. By bridging the gap between representation\ngeometry, normalization, and OOD performance, our findings offer new insights\ninto the design of more effective and reliable deep learning models."}
{"id": "2510.15796", "categories": ["cs.LG", "cs.SY", "eess.SY"], "pdf": "https://arxiv.org/pdf/2510.15796", "abs": "https://arxiv.org/abs/2510.15796", "authors": ["Anton Raskovalov"], "title": "Cavity Duplexer Tuning with 1d Resnet-like Neural Networks", "comment": null, "summary": "This paper presents machine learning method for tuning of cavity duplexer\nwith a large amount of adjustment screws. After testing we declined\nconventional reinforcement learning approach and reformulated our task in the\nsupervised learning setup. The suggested neural network architecture includes\n1d ResNet-like backbone and processing of some additional information about\nS-parameters, like the shape of curve and peaks positions and amplitudes. This\nneural network with external control algorithm is capable to reach almost the\ntuned state of the duplexer within 4-5 rotations per screw."}
{"id": "2510.15798", "categories": ["cs.CR", "cs.NI"], "pdf": "https://arxiv.org/pdf/2510.15798", "abs": "https://arxiv.org/abs/2510.15798", "authors": ["Jinwoo Kim", "Minjae Seo", "Eduard Marin", "Seungsoo Lee", "Jaehyun Nam", "Seungwon Shin"], "title": "Ambusher: Exploring the Security of Distributed SDN Controllers Through Protocol State Fuzzing", "comment": "17 pages, 16 figures", "summary": "Distributed SDN (Software-Defined Networking) controllers have rapidly become\nan integral element of Wide Area Networks (WAN), particularly within SD-WAN,\nproviding scalability and fault-tolerance for expansive network\ninfrastructures. However, the architecture of these controllers introduces new\npotential attack surfaces that have thus far received inadequate attention. In\nresponse to these concerns, we introduce Ambusher, a testing tool designed to\ndiscover vulnerabilities within protocols used in distributed SDN controllers.\nAmbusher achieves this by leveraging protocol state fuzzing, which\nsystematically finds attack scenarios based on an inferred state machine. Since\nlearning states from a cluster is complicated, Ambusher proposes a novel\nmethodology that extracts a single and relatively simple state machine,\nachieving efficient state-based fuzzing. Our evaluation of Ambusher, conducted\non a real SD-WAN deployment spanning two campus networks and one enterprise\nnetwork, illustrates its ability to uncover 6 potential vulnerabilities in the\nwidely used distributed controller platform."}
{"id": "2510.15211", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15211", "abs": "https://arxiv.org/abs/2510.15211", "authors": ["Yongchan Kwon", "Shang Zhu", "Federico Bianchi", "Kaitlyn Zhou", "James Zou"], "title": "ReasonIF: Large Reasoning Models Fail to Follow Instructions During Reasoning", "comment": null, "summary": "The ability of large language models (LLMs) to follow user instructions is\ncentral to their reliability, safety, and usefulness. While prior studies\nassess instruction adherence in the model's main responses, we argue that it is\nalso critical for large reasoning models (LRMs) to follow user instructions\nthroughout their reasoning process. Reasoning instruction following makes LRMs\nmore controllable and transparent, while reducing risks of undesirable\nshortcuts, hallucinations, or reward hacking within reasoning traces. To\nevaluate this dimension, we introduce ReasonIF, a systematic benchmark for\nassessing reasoning instruction following. ReasonIF includes six categories of\ninstruction prompts, spanning multilingual reasoning, formatting and length\ncontrol. Across many open-source LRMs including GPT-OSS, Qwen3, and\nDeepSeek-R1, we find substantial failures in reasoning instruction adherence:\nthe highest instruction following score (IFS) remains below 0.25, meaning that\nfewer than $25\\%$ of reasoning traces comply with the given instructions.\nNotably, as task difficulty increases, reasoning instruction following degrades\nfurther. We also explore two strategies to enhance reasoning instruction\nfidelity. (1) multi-turn reasoning and (2) Reasoning Instruction Finetuning\n(RIF) using synthetic data. RIF improves the IFS of $GPT-OSS-20B$ from 0.11 to\n0.27, indicating measurable progress but leaving ample room for improvement."}
{"id": "2510.15801", "categories": ["cs.CR", "cs.CY", "cs.HC", "cs.SI"], "pdf": "https://arxiv.org/pdf/2510.15801", "abs": "https://arxiv.org/abs/2510.15801", "authors": ["Bonnie Rushing", "Mac-Rufus Umeokolo", "Shouhuai Xu"], "title": "Towards Proactive Defense Against Cyber Cognitive Attacks", "comment": "University of Colorado Colorado Springs and Department of the Air\n  Force, US Air Force Academy. Disclaimer: The views expressed are those of the\n  author and do not reflect the official policy or position of the US Air Force\n  Academy, US Air Force, Department of Defense, or the US Government", "summary": "Cyber cognitive attacks leverage disruptive innovations (DIs) to exploit\npsychological biases and manipulate decision-making processes. Emerging\ntechnologies, such as AI-driven disinformation and synthetic media, have\naccelerated the scale and sophistication of these threats. Prior studies\nprimarily categorize current cognitive attack tactics, lacking predictive\nmechanisms to anticipate future DIs and their malicious use in cognitive\nattacks. This paper addresses these gaps by introducing a novel predictive\nmethodology for forecasting the emergence of DIs and their malicious uses in\ncognitive attacks. We identify trends in adversarial tactics and propose\nproactive defense strategies."}
{"id": "2510.15216", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15216", "abs": "https://arxiv.org/abs/2510.15216", "authors": ["Xuansheng Wu", "Xiaoman Pan", "Wenlin Yao", "Jianshu Chen"], "title": "Soundness-Aware Level: A Microscopic Signature that Predicts LLM Reasoning Potential", "comment": "Pre-print", "summary": "Reinforcement learning with verifiable rewards (RLVR) can elicit strong\nreasoning in large language models (LLMs), while their performance after RLVR\nvaries dramatically across different base models. This raises a fundamental\nquestion: what microscopic property of pre-trained models leads to this\nvariation? To investigate, we formalize reasoning as chains of Horn clauses\n(\"if-then\" rules) built from features extracted from the LLM's latent space via\ncross-layer sparse autoencoders (SAEs). We estimate the transition\nprobabilities between its features, and further categorize each rule by its\nsemantic soundness level (e.g., strict, plausible, noisy) with an LLM. Our key\ndiscovery is that high-potential models are inherently soundness-aware: their\ninternal probability distributions systematically shift across rules' soundness\nlevels, becoming highly distinct for \"strict\" versus \"noisy\" rules. In\ncontrast, weaker models are soundness-agnostic, collapsing to one distribution\nregardless of soundness levels. To quantify this, we introduce the\nSoundness-Aware Level (SAL), a microscopic metric using the Jensen-Shannon\nDivergence to measure the separation between these distributions. We show that\nSAL's predictions of post-RLVR reasoning performance follow a precise empirical\nlaw (R^2=0.87) across diverse model families (Qwen, Mistral, Llama, DeepSeek)\nand scales (0.5B-14B). This reveals that a model's reasoning potential is tied\nto its intrinsic, pre-trained ability to distinguish sound knowledge from\nunsound ones. These findings underscore the critical role of model pre-training\nin shaping reasoning and offer a practical metric grounded in the model's\ninternal mechanisms for selecting/designing stronger base models."}
{"id": "2510.15217", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15217", "abs": "https://arxiv.org/abs/2510.15217", "authors": ["Emily Alsentzer", "Marie-Laure Charpignon", "Bill Chen", "Niharika D'Souza", "Jason Fries", "Yixing Jiang", "Aparajita Kashyap", "Chanwoo Kim", "Simon Lee", "Aishwarya Mandyam", "Ashery Christopher Mbilinyi", "Nikita Mehandru", "Nitish Nagesh", "Brighton Nuwagira", "Emma Pierson", "Arvind Pillai", "Akane Sano", "Tanveer Syeda-Mahmood", "Shashank Yadav", "Elias Adhanom", "Muhammad Umar Afza", "Amelia Archer", "Suhana Bedi", "Vasiliki Bikia", "Trenton Chang", "George H. Chen", "Winston Chen", "Erica Chiang", "Edward Choi", "Octavia Ciora", "Paz Dozie-Nnamah", "Shaza Elsharief", "Matthew Engelhard", "Ali Eshragh", "Jean Feng", "Josh Fessel", "Scott Fleming", "Kei Sen Fong", "Thomas Frost", "Soham Gadgil", "Judy Gichoya", "Leeor Hershkovich", "Sujeong Im", "Bhavya Jain", "Vincent Jeanselme", "Furong Jia", "Qixuan", "Jin", "Yuxuan Jin", "Daniel Kapash", "Geetika Kapoor", "Behdokht Kiafar", "Matthias Kleiner", "Stefan Kraft", "Annika Kumar", "Daeun Kyung", "Zhongyuan Liang", "Joanna Lin", "Qianchu", "Liu", "Chang Liu", "Hongzhou Luan", "Chris Lunt", "Leopoldo Julían Lechuga López", "Matthew B. A. McDermott", "Shahriar Noroozizadeh", "Connor O'Brien", "YongKyung Oh", "Mixail Ota", "Stephen Pfohl", "Meagan Pi", "Tanmoy Sarkar Pias", "Emma Rocheteau", "Avishaan Sethi", "Toru Shirakawa", "Anita Silver", "Neha Simha", "Kamile Stankeviciute", "Max Sunog", "Peter Szolovits", "Shengpu Tang", "Jialu Tang", "Aaron Tierney", "John Valdovinos", "Byron Wallace", "Will Ke Wang", "Peter Washington", "Jeremy Weiss", "Daniel Wolfe", "Emily Wong", "Hye Sun Yun", "Xiaoman Zhang", "Xiao Yu Cindy Zhang", "Hayoung Jeong", "Kaveri A. Thakoor"], "title": "Reflections from Research Roundtables at the Conference on Health, Inference, and Learning (CHIL) 2025", "comment": null, "summary": "The 6th Annual Conference on Health, Inference, and Learning (CHIL 2025),\nhosted by the Association for Health Learning and Inference (AHLI), was held in\nperson on June 25-27, 2025, at the University of California, Berkeley, in\nBerkeley, California, USA. As part of this year's program, we hosted Research\nRoundtables to catalyze collaborative, small-group dialogue around critical,\ntimely topics at the intersection of machine learning and healthcare. Each\nroundtable was moderated by a team of senior and junior chairs who fostered\nopen exchange, intellectual curiosity, and inclusive engagement. The sessions\nemphasized rigorous discussion of key challenges, exploration of emerging\nopportunities, and collective ideation toward actionable directions in the\nfield. In total, eight roundtables were held by 19 roundtable chairs on topics\nof \"Explainability, Interpretability, and Transparency,\" \"Uncertainty, Bias,\nand Fairness,\" \"Causality,\" \"Domain Adaptation,\" \"Foundation Models,\" \"Learning\nfrom Small Medical Data,\" \"Multimodal Methods,\" and \"Scalable, Translational\nHealthcare Solutions.\""}
{"id": "2510.15218", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15218", "abs": "https://arxiv.org/abs/2510.15218", "authors": ["Han Ouyang", "Jesse Hamilton", "Saeed Amal"], "title": "Machine Learning for Early Detection of Meningitis: Stacked Ensemble Learning with EHR data", "comment": null, "summary": "We utilized a cohort of 214 meningitis patients and 46,303 non-meningitis\npatients from the MIMIC-III database. After extensive data preprocessing, which\nincluded ICD-based cohort selection, one-hot encoding of coding, and a\ntwo-stage feature selection process (for both the training set and the testing\nsets), clinically relevant features such as gender and high-risk ICD codes\n(including subarachnoid hemorrhage, secondary malignant neoplasm of the brain,\nand generalized epilepsy) are selected. Overall, these clinically reasonable\nand temporally adherent features provided excellent modeling performance. Three\nmodels (Random Forest, LightGBM, and Deep Neural Networks (DNN) are trained as\nbase models for Ensemble Learning. Base model outputs are aggregated and\nstacked into a meta model (Logistic Regression) that uses the base model\noutputs as input values in training. Ultimately, soldier outputs (AUC of\nTesting Set 1: 0.9637, AUC of Testing Set 2: 0.9472) are obtained through\nensemble learning.\n  We created a challenging condition for diagnosing meningitis, simulating a\nreal-world ER (Emergency Room) scenario to enhance clinical use in real-world\napplications. While directly deploying a diagnostic tool that clinicians can\nuse is challenging, this paper paves the way for a potential future AI-driven\ndiagnostic approach for meningitis using Ensemble Learning."}
{"id": "2510.15219", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15219", "abs": "https://arxiv.org/abs/2510.15219", "authors": ["Patricia Medina", "Rasika Karkare"], "title": "Integrating Product Coefficients for Improved 3D LiDAR Data Classification (Part II)", "comment": "16 pages, 6 figures, 5 tables", "summary": "This work extends our previous study on enhancing 3D LiDAR point-cloud\nclassification with product coefficients\n\\cite{medina2025integratingproductcoefficientsimproved}, measure-theoretic\ndescriptors that complement the original spatial Lidar features. Here, we show\nthat combining product coefficients with an autoencoder representation and a\nKNN classifier delivers consistent performance gains over both PCA-based\nbaselines and our earlier framework. We also investigate the effect of adding\nproduct coefficients level by level, revealing a clear trend: richer sets of\ncoefficients systematically improve class separability and overall accuracy.\nThe results highlight the value of combining hierarchical product-coefficient\nfeatures with autoencoders to push LiDAR classification performance further."}
{"id": "2510.15222", "categories": ["cs.LG", "math.ST", "stat.TH"], "pdf": "https://arxiv.org/pdf/2510.15222", "abs": "https://arxiv.org/abs/2510.15222", "authors": ["Gabriel Nixon Raj"], "title": "Stress-Aware Learning under KL Drift via Trust-Decayed Mirror Descent", "comment": null, "summary": "We study sequential decision-making under distribution drift. We propose\nentropy-regularized trust-decay, which injects stress-aware exponential tilting\ninto both belief updates and mirror-descent decisions. On the simplex, a\nFenchel-dual equivalence shows that belief tilt and decision tilt coincide. We\nformalize robustness via fragility (worst-case excess risk in a KL ball),\nbelief bandwidth (radius sustaining a target excess), and a decision-space\nFragility Index (drift tolerated at $O(\\sqrt{T})$ regret). We prove\nhigh-probability sensitivity bounds and establish dynamic-regret guarantees of\n$\\tilde{O}(\\sqrt{T})$ under KL-drift path length $S_T = \\sum_{t\\ge2}\\sqrt{{\\rm\nKL}(D_t|D_{t-1})/2}$. In particular, trust-decay achieves $O(1)$ per-switch\nregret, while stress-free updates incur $\\Omega(1)$ tails. A parameter-free\nhedge adapts the tilt to unknown drift, whereas persistent over-tilting yields\nan $\\Omega(\\lambda^2 T)$ stationary penalty. We further obtain\ncalibrated-stress bounds and extensions to second-order updates, bandit\nfeedback, outliers, stress variation, distributed optimization, and plug-in\nKL-drift estimation. The framework unifies dynamic-regret analysis,\ndistributionally robust objectives, and KL-regularized control within a single\nstress-adaptive update."}
{"id": "2510.15232", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.15232", "abs": "https://arxiv.org/abs/2510.15232", "authors": ["Tiansheng Hu", "Tongyan Hu", "Liuyang Bai", "Yilun Zhao", "Arman Cohan", "Chen Zhao"], "title": "FinTrust: A Comprehensive Benchmark of Trustworthiness Evaluation in Finance Domain", "comment": "EMNLP 2025 Main", "summary": "Recent LLMs have demonstrated promising ability in solving finance related\nproblems. However, applying LLMs in real-world finance application remains\nchallenging due to its high risk and high stakes property. This paper\nintroduces FinTrust, a comprehensive benchmark specifically designed for\nevaluating the trustworthiness of LLMs in finance applications. Our benchmark\nfocuses on a wide range of alignment issues based on practical context and\nfeatures fine-grained tasks for each dimension of trustworthiness evaluation.\nWe assess eleven LLMs on FinTrust and find that proprietary models like o4-mini\noutperforms in most tasks such as safety while open-source models like\nDeepSeek-V3 have advantage in specific areas like industry-level fairness. For\nchallenging task like fiduciary alignment and disclosure, all LLMs fall short,\nshowing a significant gap in legal awareness. We believe that FinTrust can be a\nvaluable benchmark for LLMs' trustworthiness evaluation in finance domain."}
{"id": "2510.15233", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15233", "abs": "https://arxiv.org/abs/2510.15233", "authors": ["Amitesh Badkul", "Lei Xie"], "title": "Adaptive Individual Uncertainty under Out-Of-Distribution Shift with Expert-Routed Conformal Prediction", "comment": null, "summary": "Reliable, informative, and individual uncertainty quantification (UQ) remains\nmissing in current ML community. This hinders the effective application of\nAI/ML to risk-sensitive domains. Most methods either fail to provide coverage\non new data, inflate intervals so broadly that they are not actionable, or\nassign uncertainties that do not track actual error, especially under a\ndistribution shift. In high-stakes drug discovery, protein-ligand affinity\n(PLI) prediction is especially challenging as assay noise is heterogeneous,\nchemical space is imbalanced and large, and practical evaluations routinely\ninvolve distribution shift. In this work, we introduce a novel uncertainty\nquantification method, Trustworthy Expert Split-conformal with Scaled\nEstimation for Efficient Reliable Adaptive intervals (TESSERA), that provides\nper-sample uncertainty with reliable coverage guarantee, informative and\nadaptive prediction interval widths that track the absolute error. We evaluate\non protein-ligand binding affinity prediction under both independent and\nidentically distributed (i.i.d.) and scaffold-based out-of-distribution (OOD)\nsplits, comparing against strong UQ baselines. TESSERA attains near-nominal\ncoverage and the best coverage-width trade-off as measured by the\nCoverage-Width Criterion (CWC), while maintaining competitive adaptivity\n(lowest Area Under the Sparsification Error (AUSE)). Size-Stratified Coverage\n(SSC) further confirms that intervals are right-sized, indicating width\nincreases when data are scarce or noisy, and remain tight when predictions are\nreliable. By unifying Mixture of Expert (MoE) diversity with conformal\ncalibration, TESSERA delivers trustworthy, tight, and adaptive uncertainties\nthat are well-suited to selective prediction and downstream decision-making in\nthe drug-discovery pipeline and other applications."}
{"id": "2510.15242", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15242", "abs": "https://arxiv.org/abs/2510.15242", "authors": ["Shengyu Feng", "Yun He", "Shuang Ma", "Beibin Li", "Yuanhao Xiong", "Vincent Li", "Karishma Mandyam", "Julian Katz-Samuels", "Shengjie Bi", "Licheng Yu", "Hejia Zhang", "Karthik Abinav Sankararaman", "Han Fang", "Riham Mansour", "Yiming Yang", "Manaal Faruqui"], "title": "Dual-Weighted Reinforcement Learning for Generative Preference Modeling", "comment": null, "summary": "Reinforcement learning (RL) has recently proven effective at scaling\nchain-of-thought (CoT) reasoning in large language models on tasks with\nverifiable answers. However, extending RL to more general non-verifiable tasks,\ntypically in the format of human preference pairs, remains both challenging and\nunderexplored. In this work, we propose Dual-Weighted Reinforcement Learning\n(DWRL), a new framework for preference modeling that integrates CoT reasoning\nwith the Bradley-Terry (BT) model via a dual-weighted RL objective that\npreserves preference-modeling inductive bias. DWRL approximates the\nmaximum-likelihood objective of the BT model with two complementary weights: an\ninstance-wise misalignment weight, which emphasizes under-trained pairs\nmisaligned with human preference, and a group-wise (self-normalized)\nconditional preference score, which promotes promising thoughts. In this paper,\nwe apply DWRL to preference modeling by training generative preference models\n(GPMs) to first generate a thought and then predict the human preference score.\nAcross multiple benchmarks and model scales (Llama3 and Qwen2.5), DWRL\nconsistently outperforms both GPM baselines and scalar models, while producing\ncoherent, interpretable thoughts. In summary, our results position DWRL as a\ngeneral framework for reasoning-enhanced preference learning beyond verifiable\ntasks."}
{"id": "2510.15254", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15254", "abs": "https://arxiv.org/abs/2510.15254", "authors": ["Dingya Feng", "Dingyuan Xue"], "title": "Spatiotemporal Transformers for Predicting Avian Disease Risk from Migration Trajectories", "comment": null, "summary": "Accurate forecasting of avian disease outbreaks is critical for wildlife\nconservation and public health. This study presents a Transformer-based\nframework for predicting the disease risk at the terminal locations of\nmigratory bird trajectories. We integrate multi-source datasets, including GPS\ntracking data from Movebank, outbreak records from the World Organisation for\nAnimal Health (WOAH), and geospatial context from GADM and Natural Earth. The\nraw coordinates are processed using H3 hierarchical geospatial encoding to\ncapture spatial patterns. The model learns spatiotemporal dependencies from\nbird movement sequences to estimate endpoint disease risk. Evaluation on a\nheld-out test set demonstrates strong predictive performance, achieving an\naccuracy of 0.9821, area under the ROC curve (AUC) of 0.9803, average precision\n(AP) of 0.9299, and an F1-score of 0.8836 at the optimal threshold. These\nresults highlight the potential of Transformer architectures to support\nearly-warning systems for avian disease surveillance, enabling timely\nintervention and prevention strategies."}
{"id": "2510.15260", "categories": ["cs.LG", "cs.AI", "cs.CL", "68T07, 68T50", "I.2.6; I.2.7; F.2.2"], "pdf": "https://arxiv.org/pdf/2510.15260", "abs": "https://arxiv.org/abs/2510.15260", "authors": ["Yangyang Li"], "title": "DRO-InstructZero: Distributionally Robust Prompt Optimization for Large Language Models", "comment": "Preprint. Under review at ICLR 2026. 11 pages, 2 figures", "summary": "Large language models are highly sensitive to prompt wording. However,\npopular automatic prompt search methods, including InstructZero, often degrade\nunder distribution shift and adversarial evaluation because they optimize\nexpected performance under a single evaluation distribution. Consequently,\nprompts that work in one setting frequently fail to transfer. To address this,\nDRO-InstructZero formulates zero-shot prompt optimization as robust Bayesian\noptimization. Specifically, an f-divergence ball defines an ambiguity set\naround the evaluation distribution, and a robust acquisition rule maximizes\nworst-case expected utility while retaining the query efficiency of Bayesian\nsearch. Therefore, the search explicitly targets reliability under distribution\nshift rather than average behavior alone. Experiments follow the\ninstruction-induction protocol with matched query budgets across formality\nrewriting, code debugging, and translation. For example, on BIG-Bench\ninformative-to-formal rewriting, accuracy improves from 61.3 +/- 0.7% to\napproximately 85-90%, yielding an absolute gain of about 25-30 points.\nMoreover, auto-debugging shows about +25-point gains under domain shift.\nMeanwhile, stable tasks such as cause-and-effect remain above 96%, indicating\nno loss on in-distribution cases. Furthermore, improvements are consistent\nacross divergence choices and decoding temperatures. Overall, DRO-InstructZero\nconnects distributionally robust optimization with prompt learning, offering a\nplug-and-play and general approach for reliable, transferable prompt alignment\nunder real-world uncertainty."}
{"id": "2510.15262", "categories": ["cs.LG", "cs.AI", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15262", "abs": "https://arxiv.org/abs/2510.15262", "authors": ["Zhiyuan Fan", "Yifeng Liu", "Qingyue Zhao", "Angela Yuan", "Quanquan Gu"], "title": "Robust Layerwise Scaling Rules by Proper Weight Decay Tuning", "comment": null, "summary": "Empirical scaling laws prescribe how to allocate parameters, data, and\ncompute, while maximal-update parameterization ($\\mu$P) enables learning-rate\ntransfer across widths by equalizing early-time update magnitudes. However, in\nmodern scale-invariant architectures, training quickly enters an\noptimizer-governed steady state where normalization layers create backward\nscale sensitivity and the effective learning rate becomes width dependent,\ndegrading $\\mu$P transfer. We address this by introducing a weight-decay\nscaling rule for AdamW that preserves sublayer gain across widths. Empirically,\nthe singular-value spectrum of each matrix parameter scales in norm as\n$\\sqrt{\\eta/\\lambda}$ with an approximately invariant shape; under width\nscaling $d$, we observe that the top singular value scales approximately as\n$\\sqrt{\\eta/\\lambda}\\cdot d^{0.75}$. Combining this observation with the $\\mu$P\nlearning-rate rule $\\eta_2\\propto d^{-1}$ for matrix-like parameters implies an\nempirical weight-decay scaling rule $\\lambda_2\\propto \\sqrt{d}$ that\napproximately keeps sublayer gains width invariant. Together with vector-like\nparameters trained at $\\eta_1=\\Theta_d(1)$ and $\\lambda_1=0$, this yields\n\\emph{zero-shot} transfer of both learning rate and weight decay from proxy to\ntarget widths, removing per-width sweeps. We validate the rule on LLaMA-style\nTransformers and in a minimal synthetic setting, and we provide a simple\ndiagnostic, matching top singular values, to check sublayer-gain invariance.\nOur results extend $\\mu$P beyond the near-init regime by explicitly controlling\nsteady-state scales set by the optimizer, offering a practical recipe for\nwidth-robust hyperparameter transfer under AdamW."}
{"id": "2510.15265", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15265", "abs": "https://arxiv.org/abs/2510.15265", "authors": ["Emam Hossain", "Muhammad Hasan Ferdous", "Devon Dunmire", "Aneesh Subramanian", "Md Osman Gani"], "title": "Causal Time Series Modeling of Supraglacial Lake Evolution in Greenland under Distribution Shift", "comment": "Accepted as full paper in ICMLA 2025 (Special Session 1: Deep\n  Learning and Applications)", "summary": "Causal modeling offers a principled foundation for uncovering stable,\ninvariant relationships in time-series data, thereby improving robustness and\ngeneralization under distribution shifts. Yet its potential is underutilized in\nspatiotemporal Earth observation, where models often depend on purely\ncorrelational features that fail to transfer across heterogeneous domains. We\npropose RIC-TSC, a regionally-informed causal time-series classification\nframework that embeds lag-aware causal discovery directly into sequence\nmodeling, enabling both predictive accuracy and scientific interpretability.\nUsing multi-modal satellite and reanalysis data-including Sentinel-1 microwave\nbackscatter, Sentinel-2 and Landsat-8 optical reflectance, and CARRA\nmeteorological variables-we leverage Joint PCMCI+ (J-PCMCI+) to identify\nregion-specific and invariant predictors of supraglacial lake evolution in\nGreenland. Causal graphs are estimated globally and per basin, with validated\npredictors and their time lags supplied to lightweight classifiers. On a\nbalanced benchmark of 1000 manually labeled lakes from two contrasting melt\nseasons (2018-2019), causal models achieve up to 12.59% higher accuracy than\ncorrelation-based baselines under out-of-distribution evaluation. These results\nshow that causal discovery is not only a means of feature selection but also a\npathway to generalizable and mechanistically grounded models of dynamic Earth\nsurface processes."}
{"id": "2510.15266", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15266", "abs": "https://arxiv.org/abs/2510.15266", "authors": ["Xueqing Sun", "Renzhen Wang", "Quanziang Wang", "Yichen Wu", "Xixi Jia", "Deyu Meng"], "title": "Semi-Supervised Regression with Heteroscedastic Pseudo-Labels", "comment": "Accepted by NeurIPS 2025", "summary": "Pseudo-labeling is a commonly used paradigm in semi-supervised learning, yet\nits application to semi-supervised regression (SSR) remains relatively\nunder-explored. Unlike classification, where pseudo-labels are discrete and\nconfidence-based filtering is effective, SSR involves continuous outputs with\nheteroscedastic noise, making it challenging to assess pseudo-label\nreliability. As a result, naive pseudo-labeling can lead to error accumulation\nand overfitting to incorrect labels. To address this, we propose an\nuncertainty-aware pseudo-labeling framework that dynamically adjusts\npseudo-label influence from a bi-level optimization perspective. By jointly\nminimizing empirical risk over all data and optimizing uncertainty estimates to\nenhance generalization on labeled data, our method effectively mitigates the\nimpact of unreliable pseudo-labels. We provide theoretical insights and\nextensive experiments to validate our approach across various benchmark SSR\ndatasets, and the results demonstrate superior robustness and performance\ncompared to existing methods. Our code is available at\nhttps://github.com/sxq/Heteroscedastic-Pseudo-Labels."}
{"id": "2510.15280", "categories": ["cs.LG", "cs.AI", "cs.DL"], "pdf": "https://arxiv.org/pdf/2510.15280", "abs": "https://arxiv.org/abs/2510.15280", "authors": ["Fan Liu", "Jindong Han", "Tengfei Lyu", "Weijia Zhang", "Zhe-Rui Yang", "Lu Dai", "Cancheng Liu", "Hao Liu"], "title": "Foundation Models for Scientific Discovery: From Paradigm Enhancement to Paradigm Transition", "comment": "NeurIPS 2025", "summary": "Foundation models (FMs), such as GPT-4 and AlphaFold, are reshaping the\nlandscape of scientific research. Beyond accelerating tasks such as hypothesis\ngeneration, experimental design, and result interpretation, they prompt a more\nfundamental question: Are FMs merely enhancing existing scientific\nmethodologies, or are they redefining the way science is conducted? In this\npaper, we argue that FMs are catalyzing a transition toward a new scientific\nparadigm. We introduce a three-stage framework to describe this evolution: (1)\nMeta-Scientific Integration, where FMs enhance workflows within traditional\nparadigms; (2) Hybrid Human-AI Co-Creation, where FMs become active\ncollaborators in problem formulation, reasoning, and discovery; and (3)\nAutonomous Scientific Discovery, where FMs operate as independent agents\ncapable of generating new scientific knowledge with minimal human intervention.\nThrough this lens, we review current applications and emerging capabilities of\nFMs across existing scientific paradigms. We further identify risks and future\ndirections for FM-enabled scientific discovery. This position paper aims to\nsupport the scientific community in understanding the transformative role of\nFMs and to foster reflection on the future of scientific discovery. Our project\nis available at\nhttps://github.com/usail-hkust/Awesome-Foundation-Models-for-Scientific-Discovery."}
{"id": "2510.15284", "categories": ["cs.LG", "math.ST", "stat.TH"], "pdf": "https://arxiv.org/pdf/2510.15284", "abs": "https://arxiv.org/abs/2510.15284", "authors": ["Zhilin Li", "Yao Zhou", "Xianglong Li", "Zeng Liu", "Zhaokuan Lu", "Shanlin Xu", "Seungnam Kim", "Guangyao Wang"], "title": "Small Ensemble-based Data Assimilation: A Machine Learning-Enhanced Data Assimilation Method with Limited Ensemble Size", "comment": null, "summary": "Ensemble-based data assimilation (DA) methods have become increasingly\npopular due to their inherent ability to address nonlinear dynamic problems.\nHowever, these methods often face a trade-off between analysis accuracy and\ncomputational efficiency, as larger ensemble sizes required for higher accuracy\nalso lead to greater computational cost. In this study, we propose a novel\nmachine learning-based data assimilation approach that combines the traditional\nensemble Kalman filter (EnKF) with a fully connected neural network (FCNN).\nSpecifically, our method uses a relatively small ensemble size to generate\npreliminary yet suboptimal analysis states via EnKF. A FCNN is then employed to\nlearn and predict correction terms for these states, thereby mitigating the\nperformance degradation induced by the limited ensemble size. We evaluate the\nperformance of our proposed EnKF-FCNN method through numerical experiments\ninvolving Lorenz systems and nonlinear ocean wave field simulations. The\nresults consistently demonstrate that the new method achieves higher accuracy\nthan traditional EnKF with the same ensemble size, while incurring negligible\nadditional computational cost. Moreover, the EnKF-FCNN method is adaptable to\ndiverse applications through coupling with different models and the use of\nalternative ensemble-based DA methods."}
{"id": "2510.15294", "categories": ["cs.LG", "cond-mat.dis-nn", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15294", "abs": "https://arxiv.org/abs/2510.15294", "authors": ["Danil Parkhomenko", "Pavel Ovchinnikov", "Konstantin Soldatov", "Vitalii Kapitan", "Gennady Y. Chitov"], "title": "Identifying internal patterns in (1+1)-dimensional directed percolation using neural networks", "comment": "7 pages, 10 figures, 2 tables", "summary": "In this paper we present a neural network-based method for the automatic\ndetection of phase transitions and classification of hidden percolation\npatterns in a (1+1)-dimensional replication process. The proposed network model\nis based on the combination of CNN, TCN and GRU networks, which are trained\ndirectly on raw configurations without any manual feature extraction. The\nnetwork reproduces the phase diagram and assigns phase labels to\nconfigurations. It shows that deep architectures are capable of extracting\nhierarchical structures from the raw data of numerical experiments."}
{"id": "2510.15300", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15300", "abs": "https://arxiv.org/abs/2510.15300", "authors": ["Jonas Kirch", "Sebastian Becker", "Tiago Koketsu Rodrigues", "Stefan Harmeling"], "title": "DFCA: Decentralized Federated Clustering Algorithm", "comment": null, "summary": "Clustered Federated Learning has emerged as an effective approach for\nhandling heterogeneous data across clients by partitioning them into clusters\nwith similar or identical data distributions. However, most existing methods,\nincluding the Iterative Federated Clustering Algorithm (IFCA), rely on a\ncentral server to coordinate model updates, which creates a bottleneck and a\nsingle point of failure, limiting their applicability in more realistic\ndecentralized learning settings. In this work, we introduce DFCA, a fully\ndecentralized clustered FL algorithm that enables clients to collaboratively\ntrain cluster-specific models without central coordination. DFCA uses a\nsequential running average to aggregate models from neighbors as updates\narrive, providing a communication-efficient alternative to batch aggregation\nwhile maintaining clustering performance. Our experiments on various datasets\ndemonstrate that DFCA outperforms other decentralized algorithms and performs\ncomparably to centralized IFCA, even under sparse connectivity, highlighting\nits robustness and practicality for dynamic real-world decentralized networks."}
{"id": "2510.15327", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15327", "abs": "https://arxiv.org/abs/2510.15327", "authors": ["Zailin Ma", "Jiansheng Yang", "Yaodong Yang"], "title": "On the Generalization Properties of Learning the Random Feature Models with Learnable Activation Functions", "comment": null, "summary": "This paper studies the generalization properties of a recently proposed\nkernel method, the Random Feature models with Learnable Activation Functions\n(RFLAF). By applying a data-dependent sampling scheme for generating features,\nwe provide by far the sharpest bounds on the required number of features for\nlearning RFLAF in both the regression and classification tasks. We provide a\nunified theorem that describes the complexity of the feature number $s$, and\ndiscuss the results for the plain sampling scheme and the data-dependent\nleverage weighted scheme. Through weighted sampling, the bound on $s$ in the\nMSE loss case is improved from $\\Omega(1/\\epsilon^2)$ to\n$\\tilde{\\Omega}((1/\\epsilon)^{1/t})$ in general $(t\\geq 1)$, and even to\n$\\Omega(1)$ when the Gram matrix has a finite rank. For the Lipschitz loss\ncase, the bound is improved from $\\Omega(1/\\epsilon^2)$ to\n$\\tilde{\\Omega}((1/\\epsilon^2)^{1/t})$. To learn the weighted RFLAF, we also\npropose an algorithm to find an approximate kernel and then apply the leverage\nweighted sampling. Empirical results show that the weighted RFLAF achieves the\nsame performances with a significantly fewer number of features compared to the\nplainly sampled RFLAF, validating our theories and the effectiveness of this\nmethod."}
{"id": "2510.15333", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15333", "abs": "https://arxiv.org/abs/2510.15333", "authors": ["Yuyuan Feng", "Bin Ma", "Enyan Dai"], "title": "Backdoor or Manipulation? Graph Mixture of Experts Can Defend Against Various Graph Adversarial Attacks", "comment": null, "summary": "Extensive research has highlighted the vulnerability of graph neural networks\n(GNNs) to adversarial attacks, including manipulation, node injection, and the\nrecently emerging threat of backdoor attacks. However, existing defenses\ntypically focus on a single type of attack, lacking a unified approach to\nsimultaneously defend against multiple threats. In this work, we leverage the\nflexibility of the Mixture of Experts (MoE) architecture to design a scalable\nand unified framework for defending against backdoor, edge manipulation, and\nnode injection attacks. Specifically, we propose an MI-based logic diversity\nloss to encourage individual experts to focus on distinct neighborhood\nstructures in their decision processes, thus ensuring a sufficient subset of\nexperts remains unaffected under perturbations in local structures. Moreover,\nwe introduce a robustness-aware router that identifies perturbation patterns\nand adaptively routes perturbed nodes to corresponding robust experts.\nExtensive experiments conducted under various adversarial settings demonstrate\nthat our method consistently achieves superior robustness against multiple\ngraph adversarial attacks."}
{"id": "2510.15366", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15366", "abs": "https://arxiv.org/abs/2510.15366", "authors": ["Jinwoo Kim", "Max Beier", "Petar Bevanda", "Nayun Kim", "Seunghoon Hong"], "title": "Sequence Modeling with Spectral Mean Flows", "comment": "30 pages, 9 figures", "summary": "A key question in sequence modeling with neural networks is how to represent\nand learn highly nonlinear and probabilistic state dynamics. Operator theory\nviews such dynamics as linear maps on Hilbert spaces containing mean embedding\nvectors of distributions, offering an appealing but currently overlooked\nperspective. We propose a new approach to sequence modeling based on an\noperator-theoretic view of a hidden Markov model (HMM). Instead of\nmaterializing stochastic recurrence, we embed the full sequence distribution as\na tensor in the product Hilbert space. A generative process is then defined as\nmaximum mean discrepancy (MMD) gradient flow in the space of sequences. To\novercome challenges with large tensors and slow sampling convergence, we\nintroduce spectral mean flows, a novel tractable algorithm integrating two core\nconcepts. First, we propose a new neural architecture by leveraging spectral\ndecomposition of linear operators to derive a scalable tensor network\ndecomposition of sequence mean embeddings. Second, we extend MMD gradient flows\nto time-dependent Hilbert spaces and connect them to flow matching via the\ncontinuity equation, enabling simulation-free learning and faster sampling. We\ndemonstrate competitive results on a range of time-series modeling datasets.\nCode is available at https://github.com/jw9730/spectral-mean-flow."}
{"id": "2510.15382", "categories": ["cs.LG", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2510.15382", "abs": "https://arxiv.org/abs/2510.15382", "authors": ["Kexin Zheng", "Lauriane Teyssier", "Yinan Zheng", "Yu Luo", "Xiayuan Zhan"], "title": "Towards Robust Zero-Shot Reinforcement Learning", "comment": "Neurips 2025, 36 pages, 18 figures", "summary": "The recent development of zero-shot reinforcement learning (RL) has opened a\nnew avenue for learning pre-trained generalist policies that can adapt to\narbitrary new tasks in a zero-shot manner. While the popular Forward-Backward\nrepresentations (FB) and related methods have shown promise in zero-shot RL, we\nempirically found that their modeling lacks expressivity and that extrapolation\nerrors caused by out-of-distribution (OOD) actions during offline learning\nsometimes lead to biased representations, ultimately resulting in suboptimal\nperformance. To address these issues, we propose Behavior-REgularizEd Zero-shot\nRL with Expressivity enhancement (BREEZE), an upgraded FB-based framework that\nsimultaneously enhances learning stability, policy extraction capability, and\nrepresentation learning quality. BREEZE introduces behavioral regularization in\nzero-shot RL policy learning, transforming policy optimization into a stable\nin-sample learning paradigm. Additionally, BREEZE extracts the policy using a\ntask-conditioned diffusion model, enabling the generation of high-quality and\nmultimodal action distributions in zero-shot RL settings. Moreover, BREEZE\nemploys expressive attention-based architectures for representation modeling to\ncapture the complex relationships between environmental dynamics. Extensive\nexperiments on ExORL and D4RL Kitchen demonstrate that BREEZE achieves the best\nor near-the-best performance while exhibiting superior robustness compared to\nprior offline zero-shot RL methods. The official implementation is available\nat: https://github.com/Whiterrrrr/BREEZE."}
{"id": "2510.15388", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15388", "abs": "https://arxiv.org/abs/2510.15388", "authors": ["Mingyang Sun", "Pengxiang Ding", "Weinan Zhang", "Donglin Wang"], "title": "Iterative Refinement of Flow Policies in Probability Space for Online Reinforcement Learning", "comment": null, "summary": "While behavior cloning with flow/diffusion policies excels at learning\ncomplex skills from demonstrations, it remains vulnerable to distributional\nshift, and standard RL methods struggle to fine-tune these models due to their\niterative inference process and the limitations of existing workarounds. In\nthis work, we introduce the Stepwise Flow Policy (SWFP) framework, founded on\nthe key insight that discretizing the flow matching inference process via a\nfixed-step Euler scheme inherently aligns it with the variational\nJordan-Kinderlehrer-Otto (JKO) principle from optimal transport. SWFP\ndecomposes the global flow into a sequence of small, incremental\ntransformations between proximate distributions. Each step corresponds to a JKO\nupdate, regularizing policy changes to stay near the previous iterate and\nensuring stable online adaptation with entropic regularization. This\ndecomposition yields an efficient algorithm that fine-tunes pre-trained flows\nvia a cascade of small flow blocks, offering significant advantages:\nsimpler/faster training of sub-models, reduced computational/memory costs, and\nprovable stability grounded in Wasserstein trust regions. Comprehensive\nexperiments demonstrate SWFP's enhanced stability, efficiency, and superior\nadaptation performance across diverse robotic control benchmarks."}
{"id": "2510.15403", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15403", "abs": "https://arxiv.org/abs/2510.15403", "authors": ["Anyi Li", "Jiacheng Cen", "Songyou Li", "Mingze Li", "Yang Yu", "Wenbing Huang"], "title": "Geometric Mixture Models for Electrolyte Conductivity Prediction", "comment": null, "summary": "Accurate prediction of ionic conductivity in electrolyte systems is crucial\nfor advancing numerous scientific and technological applications. While\nsignificant progress has been made, current research faces two fundamental\nchallenges: (1) the lack of high-quality standardized benchmarks, and (2)\ninadequate modeling of geometric structure and intermolecular interactions in\nmixture systems. To address these limitations, we first reorganize and enhance\nthe CALiSol and DiffMix electrolyte datasets by incorporating geometric graph\nrepresentations of molecules. We then propose GeoMix, a novel geometry-aware\nframework that preserves Set-SE(3) equivariance-an essential but challenging\nproperty for mixture systems. At the heart of GeoMix lies the Geometric\nInteraction Network (GIN), an equivariant module specifically designed for\nintermolecular geometric message passing. Comprehensive experiments demonstrate\nthat GeoMix consistently outperforms diverse baselines (including MLPs, GNNs,\nand geometric GNNs) across both datasets, validating the importance of\ncross-molecular geometric interactions and equivariant message passing for\naccurate property prediction. This work not only establishes new benchmarks for\nelectrolyte research but also provides a general geometric learning framework\nthat advances modeling of mixture systems in energy materials, pharmaceutical\ndevelopment, and beyond."}
{"id": "2510.15404", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15404", "abs": "https://arxiv.org/abs/2510.15404", "authors": ["Christopher Salazar", "Krithika Manohar", "Ashis G. Banerjee"], "title": "Online Kernel Dynamic Mode Decomposition for Streaming Time Series Forecasting with Adaptive Windowing", "comment": null, "summary": "Real-time forecasting from streaming data poses critical challenges: handling\nnon-stationary dynamics, operating under strict computational limits, and\nadapting rapidly without catastrophic forgetting. However, many existing\napproaches face trade-offs between accuracy, adaptability, and efficiency,\nparticularly when deployed in constrained computing environments. We introduce\nWORK-DMD (Windowed Online Random Kernel Dynamic Mode Decomposition), a method\nthat combines Random Fourier Features with online Dynamic Mode Decomposition to\ncapture nonlinear dynamics through explicit feature mapping, while preserving\nfixed computational cost and competitive predictive accuracy across evolving\ndata. WORK-DMD employs Sherman-Morrison updates within rolling windows,\nenabling continuous adaptation to evolving dynamics from only current data,\neliminating the need for lengthy training or large storage requirements for\nhistorical data. Experiments on benchmark datasets across several domains show\nthat WORK-DMD achieves higher accuracy than several state-of-the-art online\nforecasting methods, while requiring only a single pass through the data and\ndemonstrating particularly strong performance in short-term forecasting. Our\nresults show that combining kernel evaluations with adaptive matrix updates\nachieves strong predictive performance with minimal data requirements. This\nsample efficiency offers a practical alternative to deep learning for streaming\nforecasting applications."}
{"id": "2510.15425", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15425", "abs": "https://arxiv.org/abs/2510.15425", "authors": ["Wei Wang", "Xiao-Yong Wei", "Qing Li"], "title": "ParaFormer: Shallow Parallel Transformers with Progressive Approximation", "comment": null, "summary": "The widespread 'deeper is better' philosophy has driven the creation of\narchitectures like ResNet and Transformer, which achieve high performance by\nstacking numerous layers. However, increasing model depth comes with challenges\nsuch as longer training times, higher inference latency, and impracticality on\nresource-constrained devices. To address these issues, we propose ParaFormer, a\nshallow Transformer architecture designed for true parallelism in both\nstructure and computation. By formulating standard Transformers as function\napproximators in closed-form, our theoretical analysis shows that their\nperformance relies on inter-layer collaboration for progressive approximation,\nrather than depth itself. While deep Transformers enforce this collaboration\nthrough sequential designs, we demonstrate that such collaboration is not\ninherently tied to sequential structures. ParaFormer removes the sequential\nconstraint by organizing layers into parallel branches, enforcing inter-layer\ncollaboration algorithmically. Specifically, we implement progressive\napproximation, ensuring that each new branch further reduces the loss from\npreceding branches, enabling faster convergence. Extensive experiments validate\nParaFormer's effectiveness, outperforming standard Transformers like ViT.\nMoreover, ParaFormer supports up to 15.07x model compression and facilitates\nmodel expansion for adaptive continuous learning. Experimental results on\nmulti-GPU deployment demonstrate that ParaFormer is 3.30x faster than widely\nused parallelism solutions such as FairScale. These advancements stem from our\nclosed-form formulation of Transformers based on the Universal Approximation\nTheorem, which not only explains the ``depth belief'' but also opens new\navenues for designing efficient Transformer architectures. Source code:\nhttps://(open-upon-acceptance)"}
{"id": "2510.15429", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15429", "abs": "https://arxiv.org/abs/2510.15429", "authors": ["Shashank Gupta"], "title": "Safe, Efficient, and Robust Reinforcement Learning for Ranking and Diffusion Models", "comment": "PhD Thesis of Shashank Gupta defended at the University of Amsterdam\n  on October 13th 2025", "summary": "This dissertation investigates how reinforcement learning (RL) methods can be\ndesigned to be safe, sample-efficient, and robust. Framed through the unifying\nperspective of contextual-bandit RL, the work addresses two major application\ndomains - ranking and recommendation, and text-to-image diffusion models. The\nfirst part of the thesis develops theory and algorithms for safe deployment in\nranking systems. An exposure-based generalisation bound is derived, leading to\na counterfactual risk-minimisation objective whose solution is guaranteed not\nto underperform the logging policy, even with sparse feedback. This guarantee\nis extended to doubly robust estimators, enabling safety even under adversarial\nor misspecified user models and offering practitioners explicit control over\npermissible utility loss. The second part turns to single-action bandits, where\nvarious off-policy estimators are unified within a baseline-correction\nframework. A closed-form optimal baseline is proposed and shown to minimise\nboth evaluation and policy-gradient variance, thereby improving off-policy\nlearning reliability. The final part examines the trade-offs between efficiency\nand effectiveness in generative RL. A systematic study of PPO and REINFORCE\nmotivates the Leave-One-Out PPO (LOOP) algorithm, which combines multiple\ndiffusion trajectories with a REINFORCE-style baseline inside PPO's clipped\nobjective. LOOP achieves PPO-level sample efficiency while producing\ngenerations that align more faithfully with textual attributes."}
{"id": "2510.15444", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15444", "abs": "https://arxiv.org/abs/2510.15444", "authors": ["Zhi Zhou", "Yuhao Tan", "Zenan Li", "Yuan Yao", "Lan-Zhe Guo", "Yu-Feng Li", "Xiaoxing Ma"], "title": "A Theoretical Study on Bridging Internal Probability and Self-Consistency for LLM Reasoning", "comment": "Accepted by NeurIPS 2025", "summary": "Test-time scaling seeks to improve the reasoning performance of large\nlanguage models (LLMs) by adding computational resources. A prevalent approach\nwithin the field is sampling-based test-time scaling methods, which enhance\nreasoning by generating multiple reasoning paths for a given input during\ninference. However, despite its practical success, the theoretical foundations\nremain underexplored. In this paper, we provide the first theoretical framework\nfor analyzing sampling-based test-time scaling methods, grounded in the\nperspective of confidence estimation. Based on the framework, we analyze two\ndominant paradigms: self-consistency and perplexity, and reveal key\nlimitations: self-consistency suffers from high estimation error while\nperplexity exhibits substantial modeling error and possible degradation of the\nestimation error convergence. To address these limitations, we introduce RPC, a\nhybrid method that leverages our theoretical insights through two key\ncomponents: Perplexity Consistency and Reasoning Pruning. Perplexity\nConsistency combines the strengths of self-consistency and perplexity, boosting\nthe convergence rate of estimation error from linear to exponential while\npreserving model error. Reasoning Pruning prevents degradation by eliminating\nlow-probability reasoning paths. Both theoretical analysis and empirical\nresults across seven benchmark datasets demonstrate that RPC has a strong\npotential for reducing reasoning error. Notably, RPC achieves reasoning\nperformance comparable to self-consistency while not only enhancing confidence\nreliability but also reducing sampling costs by 50%. The code and resources are\navailable at https://wnjxyk.github.io/RPC."}
{"id": "2510.15447", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15447", "abs": "https://arxiv.org/abs/2510.15447", "authors": ["Shiqin Tang", "Shuxin Zhuang", "Rong Feng", "Runsheng Yu", "Hongzong Li", "Youzhi Zhang"], "title": "Particle Dynamics for Latent-Variable Energy-Based Models", "comment": null, "summary": "Latent-variable energy-based models (LVEBMs) assign a single normalized\nenergy to joint pairs of observed data and latent variables, offering\nexpressive generative modeling while capturing hidden structure. We recast\nmaximum-likelihood training as a saddle problem over distributions on the\nlatent and joint manifolds and view the inner updates as coupled Wasserstein\ngradient flows. The resulting algorithm alternates overdamped Langevin updates\nfor a joint negative pool and for conditional latent particles with stochastic\nparameter ascent, requiring no discriminator or auxiliary networks. We prove\nexistence and convergence under standard smoothness and dissipativity\nassumptions, with decay rates in KL divergence and Wasserstein-2 distance. The\nsaddle-point view further yields an ELBO strictly tighter than bounds obtained\nwith restricted amortized posteriors. Our method is evaluated on numerical\napproximations of physical systems and performs competitively against\ncomparable approaches."}
{"id": "2510.15456", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15456", "abs": "https://arxiv.org/abs/2510.15456", "authors": ["Jan Corazza", "Hadi Partovi Aria", "Daniel Neider", "Zhe Xu"], "title": "Expediting Reinforcement Learning by Incorporating Knowledge About Temporal Causality in the Environment", "comment": "Please cite the proceedings version. Source code:\n  https://github.com/corazza/tcrl", "summary": "Reinforcement learning (RL) algorithms struggle with learning optimal\npolicies for tasks where reward feedback is sparse and depends on a complex\nsequence of events in the environment. Probabilistic reward machines (PRMs) are\nfinite-state formalisms that can capture temporal dependencies in the reward\nsignal, along with nondeterministic task outcomes. While special RL algorithms\ncan exploit this finite-state structure to expedite learning, PRMs remain\ndifficult to modify and design by hand. This hinders the already difficult\ntasks of utilizing high-level causal knowledge about the environment, and\ntransferring the reward formalism into a new domain with a different causal\nstructure. This paper proposes a novel method to incorporate causal information\nin the form of Temporal Logic-based Causal Diagrams into the reward formalism,\nthereby expediting policy learning and aiding the transfer of task\nspecifications to new environments. Furthermore, we provide a theoretical\nresult about convergence to optimal policy for our method, and demonstrate its\nstrengths empirically."}
{"id": "2510.15464", "categories": ["cs.LG", "cs.AI", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15464", "abs": "https://arxiv.org/abs/2510.15464", "authors": ["Nirmit Joshi", "Gene Li", "Siddharth Bhandari", "Shiva Prasad Kasiviswanathan", "Cong Ma", "Nathan Srebro"], "title": "Learning to Answer from Correct Demonstrations", "comment": "Comments are welcome", "summary": "We study the problem of learning to generate an answer (or completion) to a\nquestion (or prompt), where there could be multiple correct answers, any one of\nwhich is acceptable at test time. Learning is based on demonstrations of some\ncorrect answer to each training question, as in Supervised Fine Tuning (SFT).\nWe formalize the problem as offline imitation learning in contextual bandits,\nwith demonstrations from some optimal policy, without explicitly observed\nrewards. Prior work assumes that the demonstrator belongs to a low-complexity\npolicy class, which motivates maximum likelihood estimation (i.e., log-loss\nminimization). In contrast, we propose relying only on the reward model\n(specifying which answers are correct) being in a low-cardinality class, which\nwe argue is a weaker assumption. We show that likelihood maximization methods\ncan fail in this case, and instead devise an alternative novel approach that\nlearns with sample complexity logarithmic in the cardinality of the reward\nclass. Our work motivates looking beyond likelihood maximization when learning\nfrom correct demonstrations."}
{"id": "2510.15479", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15479", "abs": "https://arxiv.org/abs/2510.15479", "authors": ["Shiqin Tang", "Rong Feng", "Shuxin Zhuang", "Hongzong Li", "Youzhi Zhang"], "title": "Adversary-Free Counterfactual Prediction via Information-Regularized Representations", "comment": null, "summary": "We study counterfactual prediction under assignment bias and propose a\nmathematically grounded, information-theoretic approach that removes\ntreatment-covariate dependence without adversarial training. Starting from a\nbound that links the counterfactual-factual risk gap to mutual information, we\nlearn a stochastic representation Z that is predictive of outcomes while\nminimizing I(Z; T). We derive a tractable variational objective that\nupper-bounds the information term and couples it with a supervised decoder,\nyielding a stable, provably motivated training criterion. The framework extends\nnaturally to dynamic settings by applying the information penalty to sequential\nrepresentations at each decision time. We evaluate the method on controlled\nnumerical simulations and a real-world clinical dataset, comparing against\nrecent state-of-the-art balancing, reweighting, and adversarial baselines.\nAcross metrics of likelihood, counterfactual error, and policy evaluation, our\napproach performs favorably while avoiding the training instabilities and\ntuning burden of adversarial schemes."}
{"id": "2510.15495", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15495", "abs": "https://arxiv.org/abs/2510.15495", "authors": ["Woo-Jin Ahn", "Sang-Ryul Baek", "Yong-Jun Lee", "Hyun-Duck Choi", "Myo-Taeg Lim"], "title": "OffSim: Offline Simulator for Model-based Offline Inverse Reinforcement Learning", "comment": null, "summary": "Reinforcement learning algorithms typically utilize an interactive simulator\n(i.e., environment) with a predefined reward function for policy training.\nDeveloping such simulators and manually defining reward functions, however, is\noften time-consuming and labor-intensive. To address this, we propose an\nOffline Simulator (OffSim), a novel model-based offline inverse reinforcement\nlearning (IRL) framework, to emulate environmental dynamics and reward\nstructure directly from expert-generated state-action trajectories. OffSim\njointly optimizes a high-entropy transition model and an IRL-based reward\nfunction to enhance exploration and improve the generalizability of the learned\nreward. Leveraging these learned components, OffSim can subsequently train a\npolicy offline without further interaction with the real environment.\nAdditionally, we introduce OffSim$^+$, an extension that incorporates a\nmarginal reward for multi-dataset settings to enhance exploration. Extensive\nMuJoCo experiments demonstrate that OffSim achieves substantial performance\ngains over existing offline IRL methods, confirming its efficacy and\nrobustness."}
{"id": "2510.15502", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15502", "abs": "https://arxiv.org/abs/2510.15502", "authors": ["Shijia Kang", "Muhan Zhang"], "title": "The Road Less Traveled: Enhancing Exploration in LLMs via Sequential Sampling", "comment": null, "summary": "Reinforcement learning (RL) has been pivotal in enhancing the reasoning\ncapabilities of large language models (LLMs), but it often suffers from limited\nexploration and entropy collapse, where models exploit a narrow set of\nsolutions, leading to a loss of sampling diversity and subsequently preventing\nRL from further improving performance. This issue is exacerbated in parallel\nsampling methods, where multiple outputs are drawn from the same distribution,\npotentially causing the model to converge to similar solutions. We propose\nSESA, a novel SEquential SAmpling framework that mitigates this challenge by\ngenerating diverse solution sketches sequentially before expanding them into\nfull reasoning paths. This approach ensures broader exploration by conditioning\neach new output on previous ones, promoting diversity throughout the process\nand preventing policy collapse. Our experiments on a synthetic task show that\nsequential sampling consistently outperforms traditional RL methods in terms of\npath diversity and recovery from collapse. Further evaluations on real-world\ntasks demonstrate that SESA improves both the exploration of valid strategies\nand the overall performance of LLMs. On three agent benchmarks, SESA lifts\nsuccess rates by $+0.25$, $+0.42$, and $+0.07$ absolute over the base model (up\nto an additional $211\\%$ relative improvement over baseline RL), underscoring\nits exploration advantage. This work introduces a structured approach to\nexploration, paving the way for more effective and diverse reasoning in\nRL-trained LLMs. Our code is released at https://github.com/MuLabPKU/sesa."}
{"id": "2510.15508", "categories": ["cs.LG", "cs.NA", "math.NA", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15508", "abs": "https://arxiv.org/abs/2510.15508", "authors": ["Naoki Yoshida", "Satoshi Hayakawa", "Yuhta Takida", "Toshimitsu Uesaka", "Hiromi Wakaki", "Yuki Mitsufuji"], "title": "Theoretical Refinement of CLIP by Utilizing Linear Structure of Optimal Similarity", "comment": null, "summary": "In this study, we propose an enhancement to the similarity computation\nmechanism in multi-modal contrastive pretraining frameworks such as CLIP. Prior\ntheoretical research has demonstrated that the optimal similarity metrics\nbetween paired modalities should correspond to the pointwise mutual information\n(PMI) between the two modalities. However, the current implementations of CLIP\nand its variants fail to fully utilize the underlying linear structure of PMI.\nWe therefore propose KME-CLIP, which leverages this structure through the inner\nproduct in a reproducing kernel Hilbert space. We theoretically prove that our\nmethod can approximate PMI with arbitrary accuracy and empirically demonstrate\nthat our approach overall outperforms the standard CLIP formulation across\nseveral retrieval and classification tasks."}
{"id": "2510.15511", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15511", "abs": "https://arxiv.org/abs/2510.15511", "authors": ["Giorgos Nikolaou", "Tommaso Mencattini", "Donato Crisostomi", "Andrea Santilli", "Yannis Panagakis", "Emanuele Rodola'"], "title": "Language Models are Injective and Hence Invertible", "comment": null, "summary": "Transformer components such as non-linear activations and normalization are\ninherently non-injective, suggesting that different inputs could map to the\nsame output and prevent exact recovery of the input from a model's\nrepresentations. In this paper, we challenge this view. First, we prove\nmathematically that transformer language models mapping discrete input\nsequences to their corresponding sequence of continuous representations are\ninjective and therefore lossless, a property established at initialization and\npreserved during training. Second, we confirm this result empirically through\nbillions of collision tests on six state-of-the-art language models, and\nobserve no collisions. Third, we operationalize injectivity: we introduce\nSipIt, the first algorithm that provably and efficiently reconstructs the exact\ninput text from hidden activations, establishing linear-time guarantees and\ndemonstrating exact invertibility in practice. Overall, our work establishes\ninjectivity as a fundamental and exploitable property of language models, with\ndirect implications for transparency, interpretability, and safe deployment."}
{"id": "2510.15516", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15516", "abs": "https://arxiv.org/abs/2510.15516", "authors": ["Giulia Lanzillotta", "Felix Sarnthein", "Gil Kur", "Thomas Hofmann", "Bobby He"], "title": "Revisiting Knowledge Distillation: The Hidden Role of Dataset Size", "comment": null, "summary": "The concept of knowledge distillation (KD) describes the training of a\nstudent model from a teacher model and is a widely adopted technique in deep\nlearning. However, it is still not clear how and why distillation works.\nPrevious studies focus on two central aspects of distillation: model size, and\ngeneralisation. In this work we study distillation in a third dimension:\ndataset size. We present a suite of experiments across a wide range of\ndatasets, tasks and neural architectures, demonstrating that the effect of\ndistillation is not only preserved but amplified in low-data regimes. We call\nthis newly discovered property the data efficiency of distillation. Equipped\nwith this new perspective, we test the predictive power of existing theories of\nKD as we vary the dataset size. Our results disprove the hypothesis that\ndistillation can be understood as label smoothing, and provide further evidence\nin support of the dark knowledge hypothesis. Finally, we analyse the impact of\nmodelling factors such as the objective, scale and relative number of samples\non the observed phenomenon. Ultimately, this work reveals that the dataset size\nmay be a fundamental but overlooked variable in the mechanisms underpinning\ndistillation."}
{"id": "2510.15535", "categories": ["cs.LG", "cs.GR", "I.3; I.4; I.2"], "pdf": "https://arxiv.org/pdf/2510.15535", "abs": "https://arxiv.org/abs/2510.15535", "authors": ["Abhay Kumar Dwivedi", "Shanu Saklani", "Soumya Dutta"], "title": "Compressive Modeling and Visualization of Multivariate Scientific Data using Implicit Neural Representation", "comment": "Accepted for publication in 16th Indian Conference on Computer\n  Vision, Graphics and Image Processing (ICVGIP 2025)", "summary": "The extensive adoption of Deep Neural Networks has led to their increased\nutilization in challenging scientific visualization tasks. Recent advancements\nin building compressed data models using implicit neural representations have\nshown promising results for tasks like spatiotemporal volume visualization and\nsuper-resolution. Inspired by these successes, we develop compressed neural\nrepresentations for multivariate datasets containing tens to hundreds of\nvariables. Our approach utilizes a single network to learn representations for\nall data variables simultaneously through parameter sharing. This allows us to\nachieve state-of-the-art data compression. Through comprehensive evaluations,\nwe demonstrate superior performance in terms of reconstructed data quality,\nrendering and visualization quality, preservation of dependency information\namong variables, and storage efficiency."}
{"id": "2510.15541", "categories": ["cs.LG", "cs.CV", "eess.IV"], "pdf": "https://arxiv.org/pdf/2510.15541", "abs": "https://arxiv.org/abs/2510.15541", "authors": ["Saumya B"], "title": "An Empirical Study on MC Dropout--Based Uncertainty--Error Correlation in 2D Brain Tumor Segmentation", "comment": "Code and results available at\n  https://github.com/Saumya4321/mc-dropout-boundary-correlation", "summary": "Accurate brain tumor segmentation from MRI is vital for diagnosis and\ntreatment planning. Although Monte Carlo (MC) Dropout is widely used to\nestimate model uncertainty, its effectiveness in identifying segmentation\nerrors -- especially near tumor boundaries -- remains unclear. This study\nempirically examines the relationship between MC Dropout--based uncertainty and\nsegmentation error in 2D brain tumor MRI segmentation using a U-Net trained\nunder four augmentation settings: none, horizontal flip, rotation, and scaling.\nUncertainty was computed from 50 stochastic forward passes and correlated with\npixel-wise errors using Pearson and Spearman coefficients. Results show weak\nglobal correlations ($r \\approx 0.30$--$0.38$) and negligible boundary\ncorrelations ($|r| < 0.05$). Although differences across augmentations were\nstatistically significant ($p < 0.001$), they lacked practical relevance. These\nfindings suggest that MC Dropout uncertainty provides limited cues for boundary\nerror localization, underscoring the need for alternative or hybrid uncertainty\nestimation methods in medical image segmentation."}
{"id": "2510.15555", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15555", "abs": "https://arxiv.org/abs/2510.15555", "authors": ["Sibo Xiao"], "title": "Doubly Robust Estimation of Causal Effects in Strategic Equilibrium Systems", "comment": null, "summary": "We introduce the Strategic Doubly Robust (SDR) estimator, a novel framework\nthat integrates strategic equilibrium modeling with doubly robust estimation\nfor causal inference in strategic environments. SDR addresses endogenous\ntreatment assignment arising from strategic agent behavior, maintaining double\nrobustness while incorporating strategic considerations. Theoretical analysis\nconfirms SDR's consistency and asymptotic normality under strategic\nunconfoundedness. Empirical evaluations demonstrate SDR's superior performance\nover baseline methods, achieving 7.6\\%-29.3\\% bias reduction across varying\nstrategic strengths and maintaining robust scalability with agent populations.\nThe framework provides a principled approach for reliable causal inference when\nagents respond strategically to interventions."}
{"id": "2510.15563", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15563", "abs": "https://arxiv.org/abs/2510.15563", "authors": ["Edward Tansley", "Estelle Massart", "Coralia Cartis"], "title": "On the Neural Feature Ansatz for Deep Neural Networks", "comment": null, "summary": "Understanding feature learning is an important open question in establishing\na mathematical foundation for deep neural networks. The Neural Feature Ansatz\n(NFA) states that after training, the Gram matrix of the first-layer weights of\na deep neural network is proportional to some power $\\alpha>0$ of the average\ngradient outer product (AGOP) of this network with respect to its inputs.\nAssuming gradient flow dynamics with balanced weight initialization, the NFA\nwas proven to hold throughout training for two-layer linear networks with\nexponent $\\alpha = 1/2$ (Radhakrishnan et al., 2024). We extend this result to\nnetworks with $L \\geq 2$ layers, showing that the NFA holds with exponent\n$\\alpha = 1/L$, thus demonstrating a depth dependency of the NFA. Furthermore,\nwe prove that for unbalanced initialization, the NFA holds asymptotically\nthrough training if weight decay is applied. We also provide counterexamples\nshowing that the NFA does not hold for some network architectures with\nnonlinear activations, even when these networks fit arbitrarily well the\ntraining data. We thoroughly validate our theoretical results through numerical\nexperiments across a variety of optimization algorithms, weight decay rates and\ninitialization schemes."}
{"id": "2510.15583", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15583", "abs": "https://arxiv.org/abs/2510.15583", "authors": ["Jixin Zhang", "Yong Lai"], "title": "Attn-JGNN: Attention Enhanced Join-Graph Neural Networks", "comment": null, "summary": "We propose an Attention Enhanced Join-Graph Neural Networks(Attn-JGNN) model\nfor solving #SAT problems, which significantly improves the solving accuracy.\nInspired by the Iterative Join Graph Propagation (IJGP) algorithm, Attn-JGNN\nuses tree decomposition to encode the CNF formula into a join-graph, then\nperforms iterative message passing on the join-graph, and finally approximates\nthe model number by learning partition functions. In order to further improve\nthe accuracy of the solution, we apply the attention mechanism in and between\nclusters of the join-graphs, which makes Attn-JGNN pay more attention to the\nkey variables and clusters in probabilistic inference, and reduces the\nredundant calculation. Finally, our experiments show that our Attn-JGNN model\nachieves better results than other neural network methods."}
{"id": "2510.15620", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15620", "abs": "https://arxiv.org/abs/2510.15620", "authors": ["Jiahao Zhou", "Chengliang Lin", "Dingji Li", "Mingkai Dong", "Haibo Chen"], "title": "GRATING: Low-Latency and Memory-Efficient Semantic Selection on Device", "comment": null, "summary": "Semantic top-K selection with cross-encoder rerankers underpins of on-device\nAI services, such as retrieval-augmented generation, agent memory, and\npersonalized recommendation. However, its latency and memory demands dominate\nend-to-end budgets on edge hardware. Revisiting the objective of top-K\nselection, we reveal that only relative rankings matter, not exact\nper-candidate scores. We further observe sequence-level sparsity: relative\nrankings stabilize early in intermediate layers, allowing pruning opportunities\nprior to completing full inference.\n  Building on this insight, we propose monolithic forwarding and develop a\ntraining-free inference system, GRATING. By maintaining a global view of all\ncandidates, it reduces latency through progressive cluster pruning. It also\nbounds peak memory usage by strategically overlapping I/O with computation via\ndual-layer sliding window and chunked execution. We evaluate GRATING against\nstate-of-the-art baselines on rerankers from 0.6B to 8B parameters across Apple\nM2 and RTX 5070. GRATING consistently reduces latency by up to 89.0% and peak\nmemory by up to 94.9% in microbenchmarks, without any loss in precision. Across\nthree real-world on-device AI applications, GRATING lowers latency by\n11.6%-51.0% and peak memory by 18.6%-77.8%, demonstrating substantial\nimprovements in efficiency and deployability."}
{"id": "2510.15623", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15623", "abs": "https://arxiv.org/abs/2510.15623", "authors": ["Parsa Abbasi", "Stefan Heindorf"], "title": "CQD-SHAP: Explainable Complex Query Answering via Shapley Values", "comment": null, "summary": "Complex query answering (CQA) goes beyond the well-studied link prediction\ntask by addressing more sophisticated queries that require multi-hop reasoning\nover incomplete knowledge graphs (KGs). Research on neural and neurosymbolic\nCQA methods is still an emerging field. Almost all of these methods can be\nregarded as black-box models, which may raise concerns about user trust.\nAlthough neurosymbolic approaches like CQD are slightly more interpretable,\nallowing intermediate results to be tracked, the importance of different parts\nof the query remains unexplained. In this paper, we propose CQD-SHAP, a novel\nframework that computes the contribution of each query part to the ranking of a\nspecific answer. This contribution explains the value of leveraging a neural\npredictor that can infer new knowledge from an incomplete KG, rather than a\nsymbolic approach relying solely on existing facts in the KG. CQD-SHAP is\nformulated based on Shapley values from cooperative game theory and satisfies\nall the fundamental Shapley axioms. Automated evaluation of these explanations\nin terms of necessary and sufficient explanations, and comparisons with various\nbaselines, shows the effectiveness of this approach for most query types."}
{"id": "2510.15644", "categories": ["cs.LG", "eess.SP", "math.OC", "68W10, 68W15, 68W40, 90C06, 90C35, 90C26", "G.1.6; F.2.1; E.4"], "pdf": "https://arxiv.org/pdf/2510.15644", "abs": "https://arxiv.org/abs/2510.15644", "authors": ["Tomas Ortega", "Hamid Jafarkhani"], "title": "Decentralized Parameter-Free Online Learning", "comment": null, "summary": "We propose the first parameter-free decentralized online learning algorithms\nwith network regret guarantees, which achieve sublinear regret without\nrequiring hyperparameter tuning. This family of algorithms connects multi-agent\ncoin-betting and decentralized online learning via gossip steps. To enable our\ndecentralized analysis, we introduce a novel \"betting function\" formulation for\ncoin-betting that simplifies the multi-agent regret analysis. Our analysis\nshows sublinear network regret bounds and is validated through experiments on\nsynthetic and real datasets. This family of algorithms is applicable to\ndistributed sensing, decentralized optimization, and collaborative ML\napplications."}
{"id": "2510.15651", "categories": ["cs.LG", "cs.NA", "math.NA", "math.OC", "AMS Subject Classification: 65M99, 47-08, 68T07, 65D15"], "pdf": "https://arxiv.org/pdf/2510.15651", "abs": "https://arxiv.org/abs/2510.15651", "authors": ["Ziqian Li", "Kang Liu", "Yongcun Song", "Hangrui Yue", "Enrique Zuazua"], "title": "Deep Neural ODE Operator Networks for PDEs", "comment": null, "summary": "Operator learning has emerged as a promising paradigm for developing\nefficient surrogate models to solve partial differential equations (PDEs).\nHowever, existing approaches often overlook the domain knowledge inherent in\nthe underlying PDEs and hence suffer from challenges in capturing temporal\ndynamics and generalization issues beyond training time frames. This paper\nintroduces a deep neural ordinary differential equation (ODE) operator network\nframework, termed NODE-ONet, to alleviate these limitations. The framework\nadopts an encoder-decoder architecture comprising three core components: an\nencoder that spatially discretizes input functions, a neural ODE capturing\nlatent temporal dynamics, and a decoder reconstructing solutions in physical\nspaces. Theoretically, error analysis for the encoder-decoder architecture is\ninvestigated. Computationally, we propose novel physics-encoded neural ODEs to\nincorporate PDE-specific physical properties. Such well-designed neural ODEs\nsignificantly reduce the framework's complexity while enhancing numerical\nefficiency, robustness, applicability, and generalization capacity. Numerical\nexperiments on nonlinear diffusion-reaction and Navier-Stokes equations\ndemonstrate high accuracy, computational efficiency, and prediction\ncapabilities beyond training time frames. Additionally, the framework's\nflexibility to accommodate diverse encoders/decoders and its ability to\ngeneralize across related PDE families further underscore its potential as a\nscalable, physics-encoded tool for scientific machine learning."}
{"id": "2510.15653", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15653", "abs": "https://arxiv.org/abs/2510.15653", "authors": ["Yefan Zeng", "Shengyu Duan", "Rishad Shafik", "Alex Yakovlev"], "title": "Fast and Compact Tsetlin Machine Inference on CPUs Using Instruction-Level Optimization", "comment": null, "summary": "The Tsetlin Machine (TM) offers high-speed inference on resource-constrained\ndevices such as CPUs. Its logic-driven operations naturally lend themselves to\nparallel execution on modern CPU architectures. Motivated by this, we propose\nan efficient software implementation of the TM by leveraging instruction-level\nbitwise operations for compact model representation and accelerated processing.\nTo further improve inference speed, we introduce an early exit mechanism, which\nexploits the TM's AND-based clause evaluation to avoid unnecessary\ncomputations. Building upon this, we propose a literal Reorder strategy\ndesigned to maximize the likelihood of early exits. This strategy is applied\nduring a post-training, pre-inference stage through statistical analysis of all\nliterals and the corresponding actions of their associated Tsetlin Automata\n(TA), introducing negligible runtime overhead. Experimental results using the\ngem5 simulator with an ARM processor show that our optimized implementation\nreduces inference time by up to 96.71% compared to the conventional\ninteger-based TM implementations while maintaining comparable code density."}
{"id": "2510.15655", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15655", "abs": "https://arxiv.org/abs/2510.15655", "authors": ["Lino Gerlach", "Liv Våge", "Thore Gerlach", "Elliott Kauffman"], "title": "WARP-LUTs - Walsh-Assisted Relaxation for Probabilistic Look Up Tables", "comment": "Preprint. Under review", "summary": "Fast and efficient machine learning is of growing interest to the scientific\ncommunity and has spurred significant research into novel model architectures\nand hardware-aware design. Recent hard? and software co-design approaches have\ndemonstrated impressive results with entirely multiplication-free models.\nDifferentiable Logic Gate Networks (DLGNs), for instance, provide a\ngradient-based framework for learning optimal combinations of low-level logic\ngates, setting state-of-the-art trade-offs between accuracy, resource usage,\nand latency. However, these models suffer from high computational cost during\ntraining and do not generalize well to logic blocks with more inputs. In this\nwork, we introduce Walsh-Assisted Relaxation for Probabilistic Look-Up Tables\n(WARP-LUTs) - a novel gradient-based method that efficiently learns\ncombinations of logic gates with substantially fewer trainable parameters. We\ndemonstrate that WARP-LUTs achieve significantly faster convergence on CIFAR-10\ncompared to DLGNs, while maintaining comparable accuracy. Furthermore, our\napproach suggests potential for extension to higher-input logic blocks,\nmotivating future research on extremely efficient deployment on modern FPGAs\nand its real-time science applications."}
{"id": "2510.15674", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15674", "abs": "https://arxiv.org/abs/2510.15674", "authors": ["Yung-Chen Tang", "Pin-Yu Chen", "Andrea Cavallaro"], "title": "CarBoN: Calibrated Best-of-N Sampling Improves Test-time Reasoning", "comment": null, "summary": "Allocating more computation during inference time (test-time scaling)\nimproves language model performance, especially for reasoning tasks. However,\npopular methods like Best-of-$N$ sampling often show diminishing returns as $N$\nincreases. To address this inefficiency, we introduce a general test-time\ncalibration framework that adaptively modifies the model toward high-reward\nreasoning paths, with theoretical guarantees of improving the lower bound of\nexpected reward under finite sampling, all without large language model (LLM)\nretraining. Within this framework, we propose CarBoN (Calibrated Best-of-$N$),\na two-phase method that first explores the solution space and then learns a\ncalibration of the logits via an input-specific temperature $T$ and additive\nshift vector $\\delta$, guiding generation toward more reliable reasoning.\nExperiments on MATH-500 and AIME-2024 show that CarBoN improves efficiency,\nwith up to $4\\times$ fewer rollouts to reach the same accuracy, while often\nachieving higher accuracy under fixed budgets. We also analyze the\ncomplementary roles of $T$ and $\\delta$ in balancing output diversity and\ncorrectness, and demonstrate that the framework also generalizes to step-level\nsampling strategies such as beam search. For more information, please refer to\nour project page at huggingface.co/spaces/TrustSafeAI/Test-Time-Calibration."}
{"id": "2510.15688", "categories": ["cs.LG", "cs.AI", "I.2"], "pdf": "https://arxiv.org/pdf/2510.15688", "abs": "https://arxiv.org/abs/2510.15688", "authors": ["Kivanc Dogan", "Ahmet Orhan"], "title": "KS-Net: Multi-layer network model for determining the rotor type from motor parameters in interior PMSMs", "comment": "This study was presented at the 3rd International Conference on\n  Advances and Innovations in Engineering (ICAIE) and published in the\n  conference proceedings", "summary": "The demand for high efficiency and precise control in electric drive systems\nhas led to the widespread adoption of Interior Permanent Magnet Synchronous\nMotors (IPMSMs). The performance of these motors is significantly influenced by\nrotor geometry. Traditionally, rotor shape analysis has been conducted using\nthe finite element method (FEM), which involves high computational costs. This\nstudy aims to classify the rotor shape (2D type, V type, Nabla type) of IPMSMs\nusing electromagnetic parameters through machine learning-based methods and to\ndemonstrate the applicability of this approach as an alternative to classical\nmethods. In this context, a custom deep learning model, KS-Net, developed by\nthe user, was comparatively evaluated against Cubic SVM, Quadratic SVM, Fine\nKNN, Cosine KNN, and Fine Tree algorithms. The balanced dataset, consisting of\n9,000 samples, was tested using 10-fold cross-validation, and performance\nmetrics such as accuracy, precision, recall, and F1-score were employed. The\nresults indicate that the Cubic SVM and Quadratic SVM algorithms classified all\nsamples flawlessly, achieving 100% accuracy, while the KS-Net model achieved\n99.98% accuracy with only two misclassifications, demonstrating competitiveness\nwith classical methods. This study shows that the rotor shape of IPMSMs can be\npredicted with high accuracy using data-driven approaches, offering a fast and\ncost-effective alternative to FEM-based analyses. The findings provide a solid\nfoundation for accelerating motor design processes, developing automated rotor\nidentification systems, and enabling data-driven fault diagnosis in engineering\napplications."}
{"id": "2510.15699", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15699", "abs": "https://arxiv.org/abs/2510.15699", "authors": ["Virendra Nishad", "Bhaskar Mukhoty", "Hilal AlQuabeh", "Sandeep K. Shukla", "Sayak Ray Chowdhury"], "title": "Constrained Adversarial Perturbation", "comment": null, "summary": "Deep neural networks have achieved remarkable success in a wide range of\nclassification tasks. However, they remain highly susceptible to adversarial\nexamples - inputs that are subtly perturbed to induce misclassification while\nappearing unchanged to humans. Among various attack strategies, Universal\nAdversarial Perturbations (UAPs) have emerged as a powerful tool for both\nstress testing model robustness and facilitating scalable adversarial training.\nDespite their effectiveness, most existing UAP methods neglect domain specific\nconstraints that govern feature relationships. Violating such constraints, such\nas debt to income ratios in credit scoring or packet flow invariants in network\ncommunication, can render adversarial examples implausible or easily\ndetectable, thereby limiting their real world applicability.\n  In this work, we advance universal adversarial attacks to constrained feature\nspaces by formulating an augmented Lagrangian based min max optimization\nproblem that enforces multiple, potentially complex constraints of varying\nimportance. We propose Constrained Adversarial Perturbation (CAP), an efficient\nalgorithm that solves this problem using a gradient based alternating\noptimization strategy. We evaluate CAP across diverse domains including\nfinance, IT networks, and cyber physical systems, and demonstrate that it\nachieves higher attack success rates while significantly reducing runtime\ncompared to existing baselines. Our approach also generalizes seamlessly to\nindividual adversarial perturbations, where we observe similar strong\nperformance gains. Finally, we introduce a principled procedure for learning\nfeature constraints directly from data, enabling broad applicability across\ndomains with structured input spaces."}
{"id": "2510.15700", "categories": ["cs.LG", "cs.AI", "cs.PL"], "pdf": "https://arxiv.org/pdf/2510.15700", "abs": "https://arxiv.org/abs/2510.15700", "authors": ["Alex Gu", "Bartosz Piotrowski", "Fabian Gloeckle", "Kaiyu Yang", "Aram H. Markosyan"], "title": "ProofOptimizer: Training Language Models to Simplify Proofs without Human Demonstrations", "comment": "52 pages, 16 figures, website: http://proof-optimizer.github.io/", "summary": "Neural theorem proving has advanced rapidly in the past year, reaching IMO\ngold-medalist capabilities and producing formal proofs that span thousands of\nlines. Although such proofs are mechanically verified by formal systems like\nLean, their excessive length renders them difficult for humans to comprehend\nand limits their usefulness for mathematical insight. Proof simplification is\ntherefore a critical bottleneck. Yet, training data for this task is scarce,\nand existing methods -- mainly agentic scaffolding with off-the-shelf LLMs --\nstruggle with the extremely long proofs generated by RL-trained provers. We\nintroduce ProofOptimizer, the first language model trained to simplify Lean\nproofs without requiring additional human supervision. ProofOptimizer is\ntrained via expert iteration and reinforcement learning, using Lean to verify\nsimplifications and provide training signal. At inference time, it operates\nwithin an iterative proof-shortening workflow, progressively reducing proof\nlength. Experiments show that ProofOptimizer substantially compresses proofs\ngenerated by state-of-the-art RL-trained provers on standard benchmarks,\nreducing proof length by 87% on miniF2F, 57% on PutnamBench, and 49% on\nSeed-Prover's IMO 2025 proofs. Beyond conciseness, the simplified proofs check\nfaster in Lean and further improve downstream prover performance when reused as\ntraining data for supervised finetuning."}
{"id": "2510.15720", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15720", "abs": "https://arxiv.org/abs/2510.15720", "authors": ["Edwin Hamel-De le Court", "Gaspard Ohlmann", "Francesco Belardinelli"], "title": "ProSh: Probabilistic Shielding for Model-free Reinforcement Learning", "comment": null, "summary": "Safety is a major concern in reinforcement learning (RL): we aim at\ndeveloping RL systems that not only perform optimally, but are also safe to\ndeploy by providing formal guarantees about their safety. To this end, we\nintroduce Probabilistic Shielding via Risk Augmentation (ProSh), a model-free\nalgorithm for safe reinforcement learning under cost constraints. ProSh\naugments the Constrained MDP state space with a risk budget and enforces safety\nby applying a shield to the agent's policy distribution using a learned cost\ncritic. The shield ensures that all sampled actions remain safe in expectation.\nWe also show that optimality is preserved when the environment is\ndeterministic. Since ProSh is model-free, safety during training depends on the\nknowledge we have acquired about the environment. We provide a tight\nupper-bound on the cost in expectation, depending only on the backup-critic\naccuracy, that is always satisfied during training. Under mild, practically\nachievable assumptions, ProSh guarantees safety even at training time, as shown\nin the experiments."}
{"id": "2510.15728", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15728", "abs": "https://arxiv.org/abs/2510.15728", "authors": ["Mahyar Alinejad", "Alvaro Velasquez", "Yue Wang", "George Atia"], "title": "RLAF: Reinforcement Learning from Automaton Feedback", "comment": null, "summary": "Reinforcement Learning (RL) in environments with complex, history-dependent\nreward structures poses significant challenges for traditional methods. In this\nwork, we introduce a novel approach that leverages automaton-based feedback to\nguide the learning process, replacing explicit reward functions with\npreferences derived from a deterministic finite automaton (DFA). Unlike\nconventional approaches that use automata for direct reward specification, our\nmethod employs the structure of the DFA to generate preferences over\ntrajectories that are used to learn a reward function, eliminating the need for\nmanual reward engineering. Our framework introduces a static approach that uses\nthe learned reward function directly for policy optimization and a dynamic\napproach that involves continuous refining of the reward function and policy\nthrough iterative updates until convergence.\n  Our experiments in both discrete and continuous environments demonstrate that\nour approach enables the RL agent to learn effective policies for tasks with\ntemporal dependencies, outperforming traditional reward engineering and\nautomaton-based baselines such as reward machines and LTL-guided methods. Our\nresults highlight the advantages of automaton-based preferences in handling\nnon-Markovian rewards, offering a scalable, efficient, and human-independent\nalternative to traditional reward modeling. We also provide a convergence\nguarantee showing that under standard assumptions our automaton-guided\npreference-based framework learns a policy that is near-optimal with respect to\nthe true non-Markovian objective."}
{"id": "2510.15750", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15750", "abs": "https://arxiv.org/abs/2510.15750", "authors": ["Nayan Kumar Singh"], "title": "A Comprehensive Evaluation of Graph Neural Networks and Physics Informed Learning for Surrogate Modelling of Finite Element Analysis", "comment": "14 pages, 6 figures, 5 tables. Code available\n  at:https://github.com/SinghNayanKumar/DL-surrogate-modelling", "summary": "Although Finite Element Analysis (FEA) is an integral part of the product\ndesign lifecycle, the analysis is computationally expensive, making it\nunsuitable for many design optimization problems. The deep learning models can\nbe a great solution. However, selecting the architecture that emulates the FEA\nwith great accuracy is a challenge. This paper presents a comprehensive\nevaluation of graph neural networks (GNNs) and 3D U-Nets as surrogates for FEA\nof parametric I-beams. We introduce a Physics-Informed Neural Network (PINN)\nframework, governed by the Navier Cauchy equations, to enforce physical laws.\nCrucially, we demonstrate that a curriculum learning strategy, pretraining on\ndata followed by physics informed fine tuning, is essential for stabilizing\ntraining. Our results show that GNNs fundamentally outperform the U-Net. Even\nthe worst performer among GNNs, the GCN framework, achieved a relative L2 error\nof 8.7% while the best framework among U Net, U Net with attention mechanism\ntrained on high resolution data, achieved 13.0% score. Among the graph-based\narchitectures, the Message Passing Neural Networks (MPNN) and Graph\nTransformers achieved the highest accuracy, achieving a relative L2 score of\n3.5% and 2.6% respectively. The inclusion of physics fundamental laws (PINN)\nsignificantly improved the generalization, reducing error by up to 11.3% on\nhigh-signal tasks. While the Graph Transformer is the most accurate model, it\nis more 37.5% slower during inference when compared to second best model, MPNN\nPINN. The PINN enhanced MPNN (MPNN PINN) provides the most practical solution.\nIt offers a good compromise between predictive performance, model size, and\ninference speed."}
{"id": "2510.15751", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15751", "abs": "https://arxiv.org/abs/2510.15751", "authors": ["Trung-Anh Dang", "Vincent Nguyen", "Ngoc-Son Vu", "Christel Vrain"], "title": "SAMix: Calibrated and Accurate Continual Learning via Sphere-Adaptive Mixup and Neural Collapse", "comment": null, "summary": "While most continual learning methods focus on mitigating forgetting and\nimproving accuracy, they often overlook the critical aspect of network\ncalibration, despite its importance. Neural collapse, a phenomenon where\nlast-layer features collapse to their class means, has demonstrated advantages\nin continual learning by reducing feature-classifier misalignment. Few works\naim to improve the calibration of continual models for more reliable\npredictions. Our work goes a step further by proposing a novel method that not\nonly enhances calibration but also improves performance by reducing\noverconfidence, mitigating forgetting, and increasing accuracy. We introduce\nSphere-Adaptive Mixup (SAMix), an adaptive mixup strategy tailored for neural\ncollapse-based methods. SAMix adapts the mixing process to the geometric\nproperties of feature spaces under neural collapse, ensuring more robust\nregularization and alignment. Experiments show that SAMix significantly boosts\nperformance, surpassing SOTA methods in continual learning while also improving\nmodel calibration. SAMix enhances both across-task accuracy and the broader\nreliability of predictions, making it a promising advancement for robust\ncontinual learning systems."}
{"id": "2510.15757", "categories": ["cs.LG", "cs.CV", "cs.NE"], "pdf": "https://arxiv.org/pdf/2510.15757", "abs": "https://arxiv.org/abs/2510.15757", "authors": ["Pieris Panagi", "Savvas Karatsiolis", "Kyriacos Mosphilis", "Nicholas Hadjisavvas", "Andreas Kamilaris", "Nicolas Nicolaou", "Efstathios Stavrakis", "Vassilis Vassiliades"], "title": "Poultry Farm Intelligence: An Integrated Multi-Sensor AI Platform for Enhanced Welfare and Productivity", "comment": null, "summary": "Poultry farming faces increasing pressure to meet productivity targets while\nensuring animal welfare and environmental compliance. Yet many small and\nmedium-sized farms lack affordable, integrated tools for continuous monitoring\nand decision-making, relying instead on manual, reactive inspections. This\npaper presents Poultry Farm Intelligence (PoultryFI) - a modular,\ncost-effective platform that integrates six AI-powered modules: Camera\nPlacement Optimizer, Audio-Visual Monitoring, Analytics & Alerting, Real-Time\nEgg Counting, Production & Profitability Forecasting, and a Recommendation\nModule.\n  Camera layouts are first optimized offline using evolutionary algorithms for\nfull poultry house coverage with minimal hardware. The Audio-Visual Monitoring\nmodule extracts welfare indicators from synchronized video, audio, and feeding\ndata. Analytics & Alerting produces daily summaries and real-time\nnotifications, while Real-Time Egg Counting uses an edge vision model to\nautomate production tracking. Forecasting models predict egg yield and feed\nconsumption up to 10 days in advance, and the Recommendation Module integrates\nforecasts with weather data to guide environmental and operational adjustments.\n  This is among the first systems to combine low-cost sensing, edge analytics,\nand prescriptive AI to continuously monitor flocks, predict production, and\noptimize performance. Field trials demonstrate 100% egg-count accuracy on\nRaspberry Pi 5, robust anomaly detection, and reliable short-term forecasting.\nPoultryFI bridges the gap between isolated pilot tools and scalable, farm-wide\nintelligence, empowering producers to proactively safeguard welfare and\nprofitability."}
{"id": "2510.15796", "categories": ["cs.LG", "cs.SY", "eess.SY"], "pdf": "https://arxiv.org/pdf/2510.15796", "abs": "https://arxiv.org/abs/2510.15796", "authors": ["Anton Raskovalov"], "title": "Cavity Duplexer Tuning with 1d Resnet-like Neural Networks", "comment": null, "summary": "This paper presents machine learning method for tuning of cavity duplexer\nwith a large amount of adjustment screws. After testing we declined\nconventional reinforcement learning approach and reformulated our task in the\nsupervised learning setup. The suggested neural network architecture includes\n1d ResNet-like backbone and processing of some additional information about\nS-parameters, like the shape of curve and peaks positions and amplitudes. This\nneural network with external control algorithm is capable to reach almost the\ntuned state of the duplexer within 4-5 rotations per screw."}
{"id": "2510.15808", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15808", "abs": "https://arxiv.org/abs/2510.15808", "authors": ["Benedikt Alkin", "Richard Kurle", "Louis Serrano", "Dennis Just", "Johannes Brandstetter"], "title": "AB-UPT for Automotive and Aerospace Applications", "comment": null, "summary": "The recently proposed Anchored-Branched Universal Physics Transformers\n(AB-UPT) shows strong capabilities to replicate automotive computational fluid\ndynamics simulations requiring orders of magnitudes less compute than\ntraditional numerical solvers. In this technical report, we add two new\ndatasets to the body of empirically evaluated use-cases of AB-UPT, combining\nhigh-quality data generation with state-of-the-art neural surrogates. Both\ndatasets were generated with the Luminary Cloud platform containing automotives\n(SHIFT-SUV) and aircrafts (SHIFT-Wing). We start by detailing the data\ngeneration. Next, we show favorable performances of AB-UPT against previous\nstate-of-the-art transformer-based baselines on both datasets, followed by\nextensive qualitative and quantitative evaluations of our best AB-UPT model.\nAB-UPT shows strong performances across the board. Notably, it obtains near\nperfect prediction of integrated aerodynamic forces within seconds from a\nsimple isotopically tesselate geometry representation and is trainable within a\nday on a single GPU, paving the way for industry-scale applications."}
{"id": "2510.15821", "categories": ["cs.LG", "cs.AI", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15821", "abs": "https://arxiv.org/abs/2510.15821", "authors": ["Abdul Fatir Ansari", "Oleksandr Shchur", "Jaris Küken", "Andreas Auer", "Boran Han", "Pedro Mercado", "Syama Sundar Rangapuram", "Huibin Shen", "Lorenzo Stella", "Xiyuan Zhang", "Mononito Goswami", "Shubham Kapoor", "Danielle C. Maddix", "Pablo Guerron", "Tony Hu", "Junming Yin", "Nick Erickson", "Prateek Mutalik Desai", "Hao Wang", "Huzefa Rangwala", "George Karypis", "Yuyang Wang", "Michael Bohlke-Schneider"], "title": "Chronos-2: From Univariate to Universal Forecasting", "comment": null, "summary": "Pretrained time series models have enabled inference-only forecasting systems\nthat produce accurate predictions without task-specific training. However,\nexisting approaches largely focus on univariate forecasting, limiting their\napplicability in real-world scenarios where multivariate data and covariates\nplay a crucial role. We present Chronos-2, a pretrained model capable of\nhandling univariate, multivariate, and covariate-informed forecasting tasks in\na zero-shot manner. Chronos-2 employs a group attention mechanism that\nfacilitates in-context learning (ICL) through efficient information sharing\nacross multiple time series within a group, which may represent sets of related\nseries, variates of a multivariate series, or targets and covariates in a\nforecasting task. These general capabilities are achieved through training on\nsynthetic datasets that impose diverse multivariate structures on univariate\nseries. Chronos-2 delivers state-of-the-art performance across three\ncomprehensive benchmarks: fev-bench, GIFT-Eval, and Chronos Benchmark II. On\nfev-bench, which emphasizes multivariate and covariate-informed forecasting,\nChronos-2's universal ICL capabilities lead to substantial improvements over\nexisting models. On tasks involving covariates, it consistently outperforms\nbaselines by a wide margin. Case studies in the energy and retail domains\nfurther highlight its practical advantages. The in-context learning\ncapabilities of Chronos-2 establish it as a general-purpose forecasting model\nthat can be used \"as is\" in real-world forecasting pipelines."}
{"id": "2510.15830", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.15830", "abs": "https://arxiv.org/abs/2510.15830", "authors": ["Dominik Kallusky", "Vinay Rao", "Vishal Nandavanam", "Hao-Jun Michael Shi"], "title": "SNOO: Step-K Nesterov Outer Optimizer - The Surprising Effectiveness of Nesterov Momentum Applied to Pseudo-Gradients", "comment": null, "summary": "The rapid development of large language models (LLMs) has driven the demand\nfor more efficient optimization techniques. Among these, the Lookahead family\nof optimizers employs a two-loop framework, maintaining fast and slow sets of\nmodel weights. Multiple inner optimizer steps on the fast weights produce a\ntrajectory - the pseudo-gradient - that is used to update the slow weights.\nDiLoCo, a notable example originally designed for distributed training, applies\nNesterov momentum to the averaged pseudo-gradient from multiple workers,\nclaiming to even outperform AdamW in a non-distributed setup. In this paper, we\nempirically show that DiLoCo's surprising effectiveness stems primarily from\napplying Nesterov momentum to the pseudo-gradient, which improves training in a\nnon-distributed setting. We call this Lookahead variant the Step-$K$ Nesterov\nOuter Optimizer (SNOO). We demonstrate that SNOO achieves compute factor gains\nof 1.5 - 2.5$\\times$ in a non-distributed setting up to a scale of 1e23\ntraining FLOPs, with improvements that increase with model size. Because of its\nminimal compute and memory overhead and compatibility with model sharding, SNOO\nis a practical enhancement for a variety of inner optimizers, including AdamW\nand Muon."}
{"id": "2510.15833", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15833", "abs": "https://arxiv.org/abs/2510.15833", "authors": ["Hoang M. Ngo", "Tamer Kahveci", "My T. Thai"], "title": "FIDDLE: Reinforcement Learning for Quantum Fidelity Enhancement", "comment": null, "summary": "Quantum computing has the potential to revolutionize fields like quantum\noptimization and quantum machine learning. However, current quantum devices are\nhindered by noise, reducing their reliability. A key challenge in gate-based\nquantum computing is improving the reliability of quantum circuits, measured by\nprocess fidelity, during the transpilation process, particularly in the routing\nstage. In this paper, we address the Fidelity Maximization in Routing Stage\n(FMRS) problem by introducing FIDDLE, a novel learning framework comprising two\nmodules: a Gaussian Process-based surrogate model to estimate process fidelity\nwith limited training samples and a reinforcement learning module to optimize\nrouting. Our approach is the first to directly maximize process fidelity,\noutperforming traditional methods that rely on indirect metrics such as circuit\ndepth or gate count. We rigorously evaluate FIDDLE by comparing it with\nstate-of-the-art fidelity estimation techniques and routing optimization\nmethods. The results demonstrate that our proposed surrogate model is able to\nprovide a better estimation on the process fidelity compared to existing\nlearning techniques, and our end-to-end framework significantly improves the\nprocess fidelity of quantum circuits across various noise models."}
{"id": "2510.15837", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15837", "abs": "https://arxiv.org/abs/2510.15837", "authors": ["Vikash Singh"], "title": "Transfer Orthology Networks", "comment": "4 pages", "summary": "We present Transfer Orthology Networks (TRON), a novel neural network\narchitecture designed for cross-species transfer learning. TRON leverages\northologous relationships, represented as a bipartite graph between species, to\nguide knowledge transfer. Specifically, we prepend a learned species conversion\nlayer, whose weights are masked by the biadjacency matrix of this bipartite\ngraph, to a pre-trained feedforward neural network that predicts a phenotype\nfrom gene expression data in a source species. This allows for efficient\ntransfer of knowledge to a target species by learning a linear transformation\nthat maps gene expression from the source to the target species' gene space.\nThe learned weights of this conversion layer offer a potential avenue for\ninterpreting functional orthology, providing insights into how genes across\nspecies contribute to the phenotype of interest. TRON offers a biologically\ngrounded and interpretable approach to cross-species transfer learning, paving\nthe way for more effective utilization of available transcriptomic data. We are\nin the process of collecting cross-species transcriptomic/phenotypic data to\ngain experimental validation of the TRON architecture."}
{"id": "2510.15839", "categories": ["cs.LG", "econ.EM", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.15839", "abs": "https://arxiv.org/abs/2510.15839", "authors": ["Yeshwanth Cherapanamjeri", "Constantinos Daskalakis", "Gabriele Farina", "Sobhan Mohammadpour"], "title": "Learning Correlated Reward Models: Statistical Barriers and Opportunities", "comment": null, "summary": "Random Utility Models (RUMs) are a classical framework for modeling user\npreferences and play a key role in reward modeling for Reinforcement Learning\nfrom Human Feedback (RLHF). However, a crucial shortcoming of many of these\ntechniques is the Independence of Irrelevant Alternatives (IIA) assumption,\nwhich collapses \\emph{all} human preferences to a universal underlying utility\nfunction, yielding a coarse approximation of the range of human preferences. On\nthe other hand, statistical and computational guarantees for models avoiding\nthis assumption are scarce. In this paper, we investigate the statistical and\ncomputational challenges of learning a \\emph{correlated} probit model, a\nfundamental RUM that avoids the IIA assumption. First, we establish that the\nclassical data collection paradigm of pairwise preference data is\n\\emph{fundamentally insufficient} to learn correlational information,\nexplaining the lack of statistical and computational guarantees in this\nsetting. Next, we demonstrate that \\emph{best-of-three} preference data\nprovably overcomes these shortcomings, and devise a statistically and\ncomputationally efficient estimator with near-optimal performance. These\nresults highlight the benefits of higher-order preference data in learning\ncorrelated utilities, allowing for more fine-grained modeling of human\npreferences. Finally, we validate these theoretical guarantees on several\nreal-world datasets, demonstrating improved personalization of human\npreferences."}
{"id": "2510.15850", "categories": ["cs.LG", "cs.AI", "math.OC"], "pdf": "https://arxiv.org/pdf/2510.15850", "abs": "https://arxiv.org/abs/2510.15850", "authors": ["Michael Klamkin", "Mathieu Tanneau", "Pascal Van Hentenryck"], "title": "Self-Certifying Primal-Dual Optimization Proxies for Large-Scale Batch Economic Dispatch", "comment": null, "summary": "Recent research has shown that optimization proxies can be trained to high\nfidelity, achieving average optimality gaps under 1% for large-scale problems.\nHowever, worst-case analyses show that there exist in-distribution queries that\nresult in orders of magnitude higher optimality gap, making it difficult to\ntrust the predictions in practice. This paper aims at striking a balance\nbetween classical solvers and optimization proxies in order to enable\ntrustworthy deployments with interpretable speed-optimality tradeoffs based on\na user-defined optimality threshold. To this end, the paper proposes a hybrid\nsolver that leverages duality theory to efficiently bound the optimality gap of\npredictions, falling back to a classical solver for queries where optimality\ncannot be certified. To improve the achieved speedup of the hybrid solver, the\npaper proposes an alternative training procedure that combines the primal and\ndual proxy training. Experiments on large-scale transmission systems show that\nthe hybrid solver is highly scalable. The proposed hybrid solver achieves\nspeedups of over 1000x compared to a parallelized simplex-based solver while\nguaranteeing a maximum optimality gap of 2%."}
{"id": "2510.15106", "categories": ["cs.CR", "cs.LG", "I.2.7; I.2.6"], "pdf": "https://arxiv.org/pdf/2510.15106", "abs": "https://arxiv.org/abs/2510.15106", "authors": ["Issam Seddik", "Sami Souihi", "Mohamed Tamaazousti", "Sara Tucci Piergiovanni"], "title": "PoTS: Proof-of-Training-Steps for Backdoor Detection in Large Language Models", "comment": "10 pages, 6 figures, 1 table. Accepted for presentation at FLLM 2025\n  (Vienna, Nov 2025)", "summary": "As Large Language Models (LLMs) gain traction across critical domains,\nensuring secure and trustworthy training processes has become a major concern.\nBackdoor attacks, where malicious actors inject hidden triggers into training\ndata, are particularly insidious and difficult to detect. Existing\npost-training verification solutions like Proof-of-Learning are impractical for\nLLMs due to their requirement for full retraining, lack of robustness against\nstealthy manipulations, and inability to provide early detection during\ntraining. Early detection would significantly reduce computational costs. To\naddress these limitations, we introduce Proof-of-Training Steps, a verification\nprotocol that enables an independent auditor (Alice) to confirm that an LLM\ndeveloper (Bob) has followed the declared training recipe, including data\nbatches, architecture, and hyperparameters. By analyzing the sensitivity of the\nLLMs' language modeling head (LM-Head) to input perturbations, our method can\nexpose subtle backdoor injections or deviations in training. Even with backdoor\ntriggers in up to 10 percent of the training data, our protocol significantly\nreduces the attacker's ability to achieve a high attack success rate (ASR). Our\nmethod enables early detection of attacks at the injection step, with\nverification steps being 3x faster than training steps. Our results highlight\nthe protocol's potential to enhance the accountability and security of LLM\ndevelopment, especially against insider threats."}
{"id": "2510.15109", "categories": ["cs.NI", "cs.AI", "cs.DC", "cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2510.15109", "abs": "https://arxiv.org/abs/2510.15109", "authors": ["Utku Demir", "Tugba Erpek", "Yalin E. Sagduyu", "Sastry Kompella", "Mengran Xue"], "title": "Targeted Attacks and Defenses for Distributed Federated Learning in Vehicular Networks", "comment": null, "summary": "In emerging networked systems, mobile edge devices such as ground vehicles\nand unmanned aerial system (UAS) swarms collectively aggregate vast amounts of\ndata to make machine learning decisions such as threat detection in remote,\ndynamic, and infrastructure-constrained environments where power and bandwidth\nare scarce. Federated learning (FL) addresses these constraints and privacy\nconcerns by enabling nodes to share local model weights for deep neural\nnetworks instead of raw data, facilitating more reliable decision-making than\nindividual learning. However, conventional FL relies on a central server to\ncoordinate model updates in each learning round, which imposes significant\ncomputational burdens on the central node and may not be feasible due to the\nconnectivity constraints. By eliminating dependence on a central server,\ndistributed federated learning (DFL) offers scalability, resilience to node\nfailures, learning robustness, and more effective defense strategies. Despite\nthese advantages, DFL remains vulnerable to increasingly advanced and stealthy\ncyberattacks. In this paper, we design sophisticated targeted training data\npoisoning and backdoor (Trojan) attacks, and characterize the emerging\nvulnerabilities in a vehicular network. We analyze how DFL provides resilience\nagainst such attacks compared to individual learning and present effective\ndefense mechanisms to further strengthen DFL against the emerging cyber\nthreats."}
{"id": "2510.15188", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15188", "abs": "https://arxiv.org/abs/2510.15188", "authors": ["Ahmed Aly", "Essam Mansour", "Amr Youssef"], "title": "OCR-APT: Reconstructing APT Stories from Audit Logs using Subgraph Anomaly Detection and LLMs", "comment": null, "summary": "Advanced Persistent Threats (APTs) are stealthy cyberattacks that often evade\ndetection in system-level audit logs. Provenance graphs model these logs as\nconnected entities and events, revealing relationships that are missed by\nlinear log representations. Existing systems apply anomaly detection to these\ngraphs but often suffer from high false positive rates and coarse-grained\nalerts. Their reliance on node attributes like file paths or IPs leads to\nspurious correlations, reducing detection robustness and reliability. To fully\nunderstand an attack's progression and impact, security analysts need systems\nthat can generate accurate, human-like narratives of the entire attack. To\naddress these challenges, we introduce OCR-APT, a system for APT detection and\nreconstruction of human-like attack stories. OCR-APT uses Graph Neural Networks\n(GNNs) for subgraph anomaly detection, learning behavior patterns around nodes\nrather than fragile attributes such as file paths or IPs. This approach leads\nto a more robust anomaly detection. It then iterates over detected subgraphs\nusing Large Language Models (LLMs) to reconstruct multi-stage attack stories.\nEach stage is validated before proceeding, reducing hallucinations and ensuring\nan interpretable final report. Our evaluations on the DARPA TC3, OpTC, and\nNODLINK datasets show that OCR-APT outperforms state-of-the-art systems in both\ndetection accuracy and alert interpretability. Moreover, OCR-APT reconstructs\nhuman-like reports that comprehensively capture the attack story."}
{"id": "2510.15365", "categories": ["eess.SY", "cs.LG", "cs.MA", "cs.SY"], "pdf": "https://arxiv.org/pdf/2510.15365", "abs": "https://arxiv.org/abs/2510.15365", "authors": ["Maonan Wang", "Yirong Chen", "Yuxin Cai", "Aoyu Pang", "Yuejiao Xie", "Zian Ma", "Chengcheng Xu", "Kemou Jiang", "Ding Wang", "Laurent Roullet", "Chung Shue Chen", "Zhiyong Cui", "Yuheng Kan", "Michael Lepech", "Man-On Pun"], "title": "TranSimHub:A Unified Air-Ground Simulation Platform for Multi-Modal Perception and Decision-Making", "comment": "9 pages, 4 figures", "summary": "Air-ground collaborative intelligence is becoming a key approach for\nnext-generation urban intelligent transportation management, where aerial and\nground systems work together on perception, communication, and decision-making.\nHowever, the lack of a unified multi-modal simulation environment has limited\nprogress in studying cross-domain perception, coordination under communication\nconstraints, and joint decision optimization. To address this gap, we present\nTranSimHub, a unified simulation platform for air-ground collaborative\nintelligence. TranSimHub offers synchronized multi-view rendering across RGB,\ndepth, and semantic segmentation modalities, ensuring consistent perception\nbetween aerial and ground viewpoints. It also supports information exchange\nbetween the two domains and includes a causal scene editor that enables\ncontrollable scenario creation and counterfactual analysis under diverse\nconditions such as different weather, emergency events, and dynamic obstacles.\nWe release TranSimHub as an open-source platform that supports end-to-end\nresearch on perception, fusion, and control across realistic air and ground\ntraffic scenes. Our code is available at\nhttps://github.com/Traffic-Alpha/TranSimHub."}
