{"id": "2511.14849", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.14849", "abs": "https://arxiv.org/abs/2511.14849", "authors": ["Adeel Mahmood", "Aaron B. Wagner"], "title": "Channel Coding for Gaussian Channels with Multifaceted Power Constraints", "comment": null, "summary": "Motivated by refined asymptotic results based on the normal approximation, we study how higher-order coding performance depends on the mean power $Γ$ as well as on finer statistics of the input power. We introduce a multifaceted power model in which the expectation of an arbitrary number of arbitrary functions of the normalized average power is constrained. The framework generalizes existing models, recovering the standard maximal and expected power constraints and the recent mean and variance constraint as special cases. Under certain growth and continuity assumptions on the functions, our main theorem gives an exact characterization of the minimum average error probability for Gaussian channels as a function of the first- and second-order coding rates. The converse proof reduces the code design problem to minimization over a compact (under the Prokhorov metric) set of probability distributions, characterizes the extreme points of this set and invokes the Bauer's maximization principle."}
{"id": "2511.14906", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.14906", "abs": "https://arxiv.org/abs/2511.14906", "authors": ["Yasser Al Eryani"], "title": "Beyond the \"G\" Frontier: A Time Traveler's Century-Long Vision for Wireless Intelligence", "comment": null, "summary": "This article travels one century into the future--from 2025 to 2125--through the analytical lens of the Information--Curvature Efficiency Law (ICEL). It contends that wireless evolution will not proceed through incremental generations such as 6G or 7G, but through a curvature-managed integration of electromagnetics, biology, thermodynamics, and cognition. The resulting infrastructure will constitute a global ecology of self-aware information flow, where geometry and communication converge to sustain both technological and biological life."}
{"id": "2511.15041", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15041", "abs": "https://arxiv.org/abs/2511.15041", "authors": ["Jingchen Peng", "Chaowen Deng", "Yili Deng", "Boxiang Ren", "Lu Yang"], "title": "Hyper-VIB: A Hypernetwork-Enhanced Information Bottleneck Approach for Task-Oriented Communications", "comment": null, "summary": "This paper presents Hyper-VIB, a hypernetwork-enhanced information bottleneck (IB) approach designed to enable efficient task-oriented communications in 6G collaborative intelligent systems. Leveraging IB theory, our approach enables an optimal end-to-end joint training of device and network models, in terms of the maximal task execution accuracy as well as the minimal communication overhead, through optimizing the trade-off hyperparameter. To address computational intractability in high-dimensional IB optimization, a tractable variational upper-bound approximation is derived. Unlike conventional grid or random search methods that require multiple training rounds with substantial computational costs, Hyper-VIB introduces a hypernetwork that generates approximately optimal DNN parameters for different values of the hyperparameter within a single training phase. Theoretical analysis in the linear case validates the hypernetwork design. Experimental results demonstrate our Hyper-VIB's superior accuracy and training efficiency over conventional VIB approaches in both classification and regression tasks."}
{"id": "2511.15051", "categories": ["cs.IT", "cs.CR"], "pdf": "https://arxiv.org/pdf/2511.15051", "abs": "https://arxiv.org/abs/2511.15051", "authors": ["Pengcheng Su", "Haibo Cheng", "Ping Wang"], "title": "Mutual Information Bounds in the Shuffle Model", "comment": null, "summary": "The shuffle model enhances privacy by anonymizing users' reports through random permutation. This paper presents the first systematic study of the single-message shuffle model from an information-theoretic perspective. We analyze two regimes: the shuffle-only setting, where each user directly submits its message ($Y_i=X_i$), and the shuffle-DP setting, where each user first applies a local $\\varepsilon_0$-differentially private mechanism before shuffling ($Y_i=\\mathcal{R}(X_i)$). Let $\\boldsymbol{Z} = (Y_{σ(i)})_i$ denote the shuffled sequence produced by a uniformly random permutation $σ$, and let $K = σ^{-1}(1)$ represent the position of user 1's message after shuffling.\n  For the shuffle-only setting, we focus on a tractable yet expressive \\emph{basic configuration}, where the target user's message follows $Y_1 \\sim P$ and the remaining users' messages are i.i.d.\\ samples from $Q$, i.e., $Y_2,\\dots,Y_n \\sim Q$. We derive asymptotic expressions for the mutual information quantities $I(Y_1;\\boldsymbol{Z})$ and $I(K;\\boldsymbol{Z})$ as $n \\to \\infty$, and demonstrate how this analytical framework naturally extends to settings with heterogeneous user distributions.\n  For the shuffle-DP setting, we establish information-theoretic upper bounds on total information leakage. When each user applies an $\\varepsilon_0$-DP mechanism, the overall leakage satisfies $I(K; \\boldsymbol{Z}) \\le 2\\varepsilon_0$ and $I(X_1; \\boldsymbol{Z}\\mid (X_i)_{i=2}^n) \\le (e^{\\varepsilon_0}-1)/(2n) + O(n^{-3/2})$. These results bridge shuffle differential privacy and mutual-information-based privacy."}
{"id": "2511.14808", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.14808", "abs": "https://arxiv.org/abs/2511.14808", "authors": ["Mikael von Strauss"], "title": "Transformer Injectivity & Geometric Robustness - Analytic Margins and Bi-Lipschitz Uniformity of Sequence-Level Hidden States", "comment": "22 pages, 5 figures", "summary": "Under real-analytic assumptions on decoder-only Transformers, recent work shows that the map from discrete prompts to last-token hidden states is generically injective on finite prompt sets. We refine this picture: for each layer $\\ell$ we define a collision discriminant $Δ^\\ell \\subset Θ$ and injective stratum $U^\\ell = Θ\\setminus Δ^\\ell$, and prove a dichotomy -- either the model is nowhere injective on the set, or $U^\\ell$ is open and dense and every $F^\\ell_θ$ is injective. Under mild non-singularity assumptions on the optimizer and an absolutely continuous initialization, generic injectivity persists along smooth training trajectories over any fixed horizon. We also treat symmetry groups $G$, showing that discriminants and injective strata descend to the quotient $Θ/G$, so injectivity is naturally a property of functional equivalence classes.\n  We complement these results with an empirical study of layerwise geometric diagnostics. We define a separation margin and a co-Lipschitz (lower Lipschitz) constant between prompt space and last-token representation space, estimated via nearest-neighbor statistics on large prompt sets. Applying these diagnostics to pretrained LLaMA-3 and Qwen models, we study behavior across layers, sequence lengths, model scales, and 8- and 4-bit activation quantization. On our sampled prompts we see no collisions in full precision or at 8 bits, while 4-bit quantization induces a small number of collisions and markedly shrinks co-Lipschitz estimates. For a small GPT-2 trained from scratch, normalized metrics remain stable over training. Overall, the results suggest that Transformer representations are generically and persistently injective in the continuous-parameter idealization, while their practical invertibility can be probed using simple geometric diagnostics."}
{"id": "2511.14876", "categories": ["cs.CR", "cs.CV", "cs.LG", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.14876", "abs": "https://arxiv.org/abs/2511.14876", "authors": ["Henry Wong", "Clement Fung", "Weiran Lin", "Karen Li", "Stanley Chen", "Lujo Bauer"], "title": "Attacking Autonomous Driving Agents with Adversarial Machine Learning: A Holistic Evaluation with the CARLA Leaderboard", "comment": "12 pages", "summary": "To autonomously control vehicles, driving agents use outputs from a combination of machine-learning (ML) models, controller logic, and custom modules. Although numerous prior works have shown that adversarial examples can mislead ML models used in autonomous driving contexts, it remains unclear if these attacks are effective at producing harmful driving actions for various agents, environments, and scenarios.\n  To assess the risk of adversarial examples to autonomous driving, we evaluate attacks against a variety of driving agents, rather than against ML models in isolation. To support this evaluation, we leverage CARLA, an urban driving simulator, to create and evaluate adversarial examples. We create adversarial patches designed to stop or steer driving agents, stream them into the CARLA simulator at runtime, and evaluate them against agents from the CARLA Leaderboard, a public repository of best-performing autonomous driving agents from an annual research competition. Unlike prior work, we evaluate attacks against autonomous driving systems without creating or modifying any driving-agent code and against all parts of the agent included with the ML model.\n  We perform a case-study investigation of two attack strategies against three open-source driving agents from the CARLA Leaderboard across multiple driving scenarios, lighting conditions, and locations. Interestingly, we show that, although some attacks can successfully mislead ML models into predicting erroneous stopping or steering commands, some driving agents use modules, such as PID control or GPS-based rules, that can overrule attacker-manipulated predictions from ML models."}
{"id": "2511.14921", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2511.14921", "abs": "https://arxiv.org/abs/2511.14921", "authors": ["Mohamed Rouili", "Yang Xiao", "Sihang Liu", "Raouf Boutaba"], "title": "RAID: In-Network RA Signaling Storm Detection for 5G Open RAN", "comment": null, "summary": "The disaggregation and virtualization of 5G Open RAN (O-RAN) introduces new vulnerabilities in the control plane that can greatly impact the quality of service (QoS) of latency-sensitive 5G applications and services. One critical issue is Random Access (RA) signaling storms where, a burst of illegitimate or misbehaving user equipments (UEs) send Radio Resource Control (RRC) connection requests that rapidly saturate a Central Unit's (CU) processing pipeline. Such storms trigger widespread connection failures within the short contention resolution window defined by 3GPP. Existing detection and mitigation approaches based on near-real-time RAN Intelligent Controller (n-RT RIC) applications cannot guarantee a timely reaction to such attacks as RIC control loops incur tens to hundreds of milliseconds of latency due to the non-deterministic nature of their general purpose processor (GPP) based architectures. This paper presents RAID, an in-network RA signaling storm detection and mitigation system that leverages P4-programmable switch ASICs to enable real-time protection from malicious attacks. RAID embeds a lightweight Random Forest (RF) classifier into a programmable Tofino switch, enabling line-rate flow classification with deterministic microsecond-scale inference delay. By performing ML-based detection directly in the data plane, RAID catches and filters malicious RA requests before they reach and overwhelm the RRC. RAID achieves above 94% detection accuracy with a fixed per-flow inference delay on the order of 3.4 microseconds, effectively meeting strict O-RAN control-plane deadlines. These improvements are sustained across multiple traffic loads, making RAID a fast and scalable solution for the detection and mitigation of signaling storms in 5G O-RAN."}
{"id": "2511.14890", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.14890", "abs": "https://arxiv.org/abs/2511.14890", "authors": ["Helmut Repp"], "title": "Ein Fenster zur gleichzeitigen Messung der Uebertragungsfunktion eines realen Systems und des Leistungsdichtespektrums des ueberlagerten Rauschens am Systemausgang (Teil 1)", "comment": "256 pages, in German, MATLAB and SCILAB programs for calculating a window in a ZIP folder attached as ancillary file", "summary": "There is already a method known from the literature with which it is possible to measure both the transfer function and the noise power spectral density of the superimposed noise at the output of a disturbed, time-invariant, real system with nonlinearities in one measurement. By using a suitable window, the frequency selectivity of the measurement of the power spectral density of the superimposed noise can be noticeably improved without significantly increasing the computational complexity of the method. The unbiasedness and consistency of the measurement method with a suitable window are proven. The measurement of the power spectral density of a zero-mean, stationary process without measuring the transfer function is investigated as a special case for both real-valued and complex-valued signals. It is derived which requirements a suitable window should meet and how it can be calculated with high numerical accuracy.\n  --\n  Es gibt bereits eine aus der Literatur bekannte Methode mit der es moeglich ist in einer Messung sowohl die Uebertragungsfunktion als auch das Rauschleistungsdichtespektrum des ueberlagerten Rauschens am Ausgang eines gestoerten, zeitinvarianten, realen Systems mit Nichtlinearitaeten zu messen. Durch den Einsatz eines geeigneten Fensters kann die Frequenzselektivitaet der Messung des Leistungsdichtespektrums der Stoerung deutlich verbessert werden, ohne den Aufwand der Berechnungen des Verfahrens nennenswert zu erhoehen. Die Erwartungstreue und die Konsistenz des Messverfahren mit Fensterung wird gezeigt. Die Messung des Leistungsdichtespektrums eines mittelwertfreien, stationaeren Prozesses ohne Messung der Uebertragungsfunktion wird als Sonderfall sowohl fuer reellwertige, als auch fuer komplexwertige Signale untersucht. Es wird hergeleitet, welche Forderungen ein geeignetes Fenster erfuellen sollte und wie es sich numerisch hochgenau berechnen laesst."}
{"id": "2511.14896", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.14896", "abs": "https://arxiv.org/abs/2511.14896", "authors": ["Thijs Lenssen", "Aleksandr Talitckii", "Matthew Peet", "Amritam Das"], "title": "A $μ$-Analysis and Synthesis Framework for Partial Integral Equations using IQCs", "comment": null, "summary": "We develop a $μ$-analysis and synthesis framework for infinite-dimensional systems that leverages the Integral Quadratic Constraints (IQCs) to compute the structured singular value's upper bound. The methodology formulates robust stability and performance conditions jointly as Linear Partial Integral Inequalities within the Partial Integral Equation framework, establishing connections between IQC multipliers and $μ$-theory. Computational implementation via PIETOOLS enables computational tools that practically applicable to spatially distributed infinite dimensional systems. Illustrations with the help of Partial and Delay Differential Equations validate the effectiveness of the framework, showing a significant reduction in conservatism compared to unstructured methods and providing systematic tools for stability-performance trade-off analysis."}
{"id": "2511.15207", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15207", "abs": "https://arxiv.org/abs/2511.15207", "authors": ["Chaofeng Guan", "Gaojun Luo", "Lan Luo", "Yangyang Fei", "Hong Wang"], "title": "Generalized Repetition Codes and Their Application to HARQ", "comment": "15 pages, 5 figures", "summary": "The inherent uncertainty of communication channels implies that any coding scheme has a non-zero probability of failing to correct errors, making retransmission mechanisms essential. To ensure message reliability and integrity, a dual-layer redundancy framework is typically employed: error correction codes mitigate noise-induced impairments at the physical layer, while cyclic redundancy checks verify message integrity after decoding. Retransmission is initiated if verification fails. This operational model can be categorized into two types of repeated communication models: Type-I systems repeatedly transmit identical codewords, whereas Type-II systems transmit distinct coded representations of the same message. The core challenge lies in maximizing the probability of correct message decoding within a limited number of transmission rounds through verification-based feedback mechanisms.\n  In this paper, we consider a scenario where the same error-correcting code is used for repeated transmissions, and we specifically propose two classes of generalized repetition codes (GRCs), corresponding to the two repeated communication models. In contrast to classical theory, we regard GRCs as error-correcting codes under multiple metrics--that is, GRCs possess multiple minimum distances. This design enables GRCs to perform multi-round error correction under different metrics, achieving stronger error-correction capabilities than classical error-correcting codes. However, the special structure of GRCs makes their construction more challenging, as it requires simultaneously optimizing multiple minimum distances. To address this, we separately investigate the bounds and constructions for Type-I and Type-II GRCs, and obtain numerous optimal Type-I and Type-II GRCs."}
{"id": "2511.14813", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.14813", "abs": "https://arxiv.org/abs/2511.14813", "authors": ["Yifan Li", "Qin Li", "Min Zhang", "Min Zhang", "Peixin Wang"], "title": "DEVAL: A Framework for Evaluating and Improving the Derivation Capability of Large Language Models", "comment": null, "summary": "Assessing the reasoning ability of Large Language Models (LLMs) over data remains an open and pressing research question. Compared with LLMs, human reasoning can derive corresponding modifications to the output based on certain kinds of changes to the input. This reasoning pattern, which relies on abstract rules that govern relationships between changes of data, has not been comprehensively described or evaluated in LLMs. In this paper, we formally define this reasoning pattern as the Derivation Relation (DR) and introduce the concept of Derivation Capability (DC), i.e. applying DR by making the corresponding modification to the output whenever the input takes certain changes. To assess DC, a systematically constructed evaluation framework named DEVAL is proposed and used to evaluate five popular LLMs and one Large Reasoning Model in seven mainstream tasks. The evaluation results show that mainstream LLMs, such as GPT-4o and Claude3.5, exhibit moderate DR recognition capabilities but reveal significant drop-offs on applying DR effectively in problem-solving scenarios. To improve this, we propose a novel prompt engineering approach called Derivation Prompting (DP). It achieves an average improvement of 15.2% in DC for all tested LLMs, outperforming commonly used prompt engineering techniques."}
{"id": "2511.14908", "categories": ["cs.CR", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.14908", "abs": "https://arxiv.org/abs/2511.14908", "authors": ["Gefté Almeida", "Marcio Pohlmann", "Alex Severo", "Diego Kreutz", "Tiago Heinrich", "Lourenço Pereira"], "title": "On-Premise SLMs vs. Commercial LLMs: Prompt Engineering and Incident Classification in SOCs and CSIRTs", "comment": "5 pages, 3 figures, 3 tables, submitted to ERRC/WRSeg 2025", "summary": "In this study, we evaluate open-source models for security incident classification, comparing them with proprietary models. We utilize a dataset of anonymized real incidents, categorized according to the NIST SP 800-61r3 taxonomy and processed using five prompt-engineering techniques (PHP, SHP, HTP, PRP, and ZSL). The results indicate that, although proprietary models still exhibit higher accuracy, locally deployed open-source models provide advantages in privacy, cost-effectiveness, and data sovereignty."}
{"id": "2511.15251", "categories": ["cs.LG", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15251", "abs": "https://arxiv.org/abs/2511.15251", "authors": ["Chengze Du", "Heng Xu", "Zhiwei Yu", "Bo Liu", "Jialong Li"], "title": "PLATONT: Learning a Platonic Representation for Unified Network Tomography", "comment": null, "summary": "Network tomography aims to infer hidden network states, such as link performance, traffic load, and topology, from external observations. Most existing methods solve these problems separately and depend on limited task-specific signals, which limits generalization and interpretability. We present PLATONT, a unified framework that models different network indicators (e.g., delay, loss, bandwidth) as projections of a shared latent network state. Guided by the Platonic Representation Hypothesis, PLATONT learns this latent state through multimodal alignment and contrastive learning. By training multiple tomography tasks within a shared latent space, it builds compact and structured representations that improve cross-task generalization. Experiments on synthetic and real-world datasets show that PLATONT consistently outperforms existing methods in link estimation, topology inference, and traffic prediction, achieving higher accuracy and stronger robustness under varying network conditions."}
{"id": "2511.14895", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.14895", "abs": "https://arxiv.org/abs/2511.14895", "authors": ["Mohammad Cheraghinia", "Eli De Poorter", "Jaron Fontaine", "Kwang Soon Kim", "Merouane Debbah", "Adnan Shahid"], "title": "Lightweight Foundation Model for Wireless Time Series Downstream Tasks on Edge Devices", "comment": "6 pages, 4 figures, 5 tables. Accepted to a workshop in the IEEE GLOBECOM 2025", "summary": "While machine learning is widely used to optimize wireless networks, training a separate model for each task in communication and localization is becoming increasingly unsustainable due to the significant costs associated with training and deployment. Foundation models offer a more scalable alternative by enabling a single model to be adapted across multiple tasks through fine-tuning with limited samples. However, current foundation models mostly rely on large-scale Transformer architectures, resulting in computationally intensive models unsuitable for deployment on typical edge devices. This paper presents a lightweight foundation model based on simple Multi-Layer-Perceptron (MLP) encoders that independently process input patches. Our model supports 4 types of downstream tasks (long-range technology recognition, short-range technology recognition, modulation recognition and line-of-sight-detection) from multiple input types (IQ and CIR) and different sampling rates. We show that, unlike Transformers, which can exhibit performance drops as downstream tasks are added, our MLP model maintains robust generalization performance, achieving over 97% accurate fine-tuning results for previously unseen data classes. These results are achieved despite having only 21K trainable parameters, allowing an inference time of 0.33 ms on common edge devices, making the model suitable for constrained real-time deployments."}
{"id": "2511.14928", "categories": ["eess.SY", "cs.CE"], "pdf": "https://arxiv.org/pdf/2511.14928", "abs": "https://arxiv.org/abs/2511.14928", "authors": ["Akshay K. Rao", "Fletcher T. Chapin", "Erin Musabandesu", "Adhithyan Sakthivelu", "Carson Tucker", "Daly Wettermark", "Meagan S. Mauter"], "title": "How much can we save? Upper bound cost and emissions benefits from commercial and industrial load flexibility", "comment": null, "summary": "Load shifting by commercial and industrial power consumers reduces costs and Scope 2 emissions for the consumer and the grid. Incentivizing this behavior requires tools for valuing flexibility amidst the heterogeneity in load characteristics across diverse sectors and the spatiotemporal variation in electricity prices and emissions factors. This work presents a top-down approach to screen and broadly understand the benefits of flexibility based on system uptime, power capacity (PC), energy capacity (EC), and round- trip efficiency (RTE). Depending on the region and season, cost savings from flexibility range from 0 to over 100% and emissions savings are generally bounded between 5-40%. We also find the magnitude and cost of emissions abatement from flexibility is highly variable and, in some cases, up to four orders of magnitude less than regional renewable energy credits or common investing or policy benchmarks like the social cost of carbon. While the value of flexibility is highly dynamic, estimating savings as a function of load characteristics and incentives can inform heuristic design of new systems, siting strategies, comparison of flexibility to other decarbonization options, and new avenues for incentivizing flexibility."}
{"id": "2511.15255", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15255", "abs": "https://arxiv.org/abs/2511.15255", "authors": ["Yassine Hamdi", "Aaron B. Wagner", "Deniz Gündüz"], "title": "The Rate-Distortion-Perception Trade-Off with Algorithmic Realism", "comment": null, "summary": "Realism constraints (or constraints on perceptual quality) have received considerable recent attention within the context of lossy compression, particularly of images. Theoretical studies of lossy compression indicate that high-rate common randomness between the compressor and the decompressor is a valuable resource for achieving realism. On the other hand, the utility of significant amounts of common randomness has not been noted in practice. We offer an explanation for this discrepancy by considering a realism constraint that requires satisfying a universal critic that inspects realizations of individual compressed reconstructions, or batches thereof. We characterize the optimal rate-distortion trade-off under such a realism constraint, and show that it is asymptotically achievable without any common randomness, unless the batch size is impractically large."}
{"id": "2511.14823", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2511.14823", "abs": "https://arxiv.org/abs/2511.14823", "authors": ["Akbar Anbar Jafari", "Cagri Ozcinar", "Gholamreza Anbarjafari"], "title": "Dynamic Nested Hierarchies: Pioneering Self-Evolution in Machine Learning Architectures for Lifelong Intelligence", "comment": "12 pages, 1 figure", "summary": "Contemporary machine learning models, including large language models, exhibit remarkable capabilities in static tasks yet falter in non-stationary environments due to rigid architectures that hinder continual adaptation and lifelong learning. Building upon the nested learning paradigm, which decomposes models into multi-level optimization problems with fixed update frequencies, this work proposes dynamic nested hierarchies as the next evolutionary step in advancing artificial intelligence and machine learning. Dynamic nested hierarchies empower models to autonomously adjust the number of optimization levels, their nesting structures, and update frequencies during training or inference, inspired by neuroplasticity to enable self-evolution without predefined constraints. This innovation addresses the anterograde amnesia in existing models, facilitating true lifelong learning by dynamically compressing context flows and adapting to distribution shifts. Through rigorous mathematical formulations, theoretical proofs of convergence, expressivity bounds, and sublinear regret in varying regimes, alongside empirical demonstrations of superior performance in language modeling, continual learning, and long-context reasoning, dynamic nested hierarchies establish a foundational advancement toward adaptive, general-purpose intelligence."}
{"id": "2511.14937", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.14937", "abs": "https://arxiv.org/abs/2511.14937", "authors": ["Niloofar Mireshghallah", "Neal Mangaokar", "Narine Kokhlikyan", "Arman Zharmagambetov", "Manzil Zaheer", "Saeed Mahloujifar", "Kamalika Chaudhuri"], "title": "CIMemories: A Compositional Benchmark for Contextual Integrity of Persistent Memory in LLMs", "comment": null, "summary": "Large Language Models (LLMs) increasingly use persistent memory from past interactions to enhance personalization and task performance. However, this memory introduces critical risks when sensitive information is revealed in inappropriate contexts. We present CIMemories, a benchmark for evaluating whether LLMs appropriately control information flow from memory based on task context. CIMemories uses synthetic user profiles with over 100 attributes per user, paired with diverse task contexts in which each attribute may be essential for some tasks but inappropriate for others. Our evaluation reveals that frontier models exhibit up to 69% attribute-level violations (leaking information inappropriately), with lower violation rates often coming at the cost of task utility. Violations accumulate across both tasks and runs: as usage increases from 1 to 40 tasks, GPT-5's violations rise from 0.1% to 9.6%, reaching 25.1% when the same prompt is executed 5 times, revealing arbitrary and unstable behavior in which models leak different attributes for identical prompts. Privacy-conscious prompting does not solve this - models overgeneralize, sharing everything or nothing rather than making nuanced, context-dependent decisions. These findings reveal fundamental limitations that require contextually aware reasoning capabilities, not just better prompting or scaling."}
{"id": "2511.15278", "categories": ["cs.CR", "cs.DC", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15278", "abs": "https://arxiv.org/abs/2511.15278", "authors": ["Nilesh Vyas", "Benjamin Zhao", "Aygün Baltaci", "Gustavo de Carvalho Bertoli", "Hassan Asghar", "Markus Klügel", "Gerrit Schramm", "Martin Kubisch", "Dali Kaafar"], "title": "Privacy-Preserving IoT in Connected Aircraft Cabin", "comment": "8 pages, 2 figures. Under review", "summary": "The proliferation of IoT devices in shared, multi-vendor environments like the modern aircraft cabin creates a fundamental conflict between the promise of data collaboration and the risks to passenger privacy, vendor intellectual property (IP), and regulatory compliance. While emerging standards like the Cabin Secure Media-Independent Messaging (CSMIM) protocol provide a secure communication backbone, they do not resolve data governance challenges at the application layer, leaving a privacy gap that impedes trust. This paper proposes and evaluates a framework that closes this gap by integrating a configurable layer of Privacy-Enhancing Technologies (PETs) atop a CSMIM-like architecture. We conduct a rigorous, empirical analysis of two pragmatic PETs: Differential Privacy (DP) for statistical sharing, and an additive secret sharing scheme (ASS) for data obfuscation. Using a high-fidelity testbed with resource-constrained hardware, we quantify the trade-offs between data privacy, utility, and computing performance. Our results demonstrate that the computational overhead of PETs is often negligible compared to inherent network and protocol latencies. We prove that architectural choices, such as on-device versus virtualized processing, have a far greater impact on end-to-end latency and computational performance than the PETs themselves. The findings provide a practical roadmap for system architects to select and configure appropriate PETs, enabling the design of trustworthy collaborative IoT ecosystems in avionics and other critical domains."}
{"id": "2511.14957", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.14957", "abs": "https://arxiv.org/abs/2511.14957", "authors": ["Helmut Repp"], "title": "Ein Fenster zur gleichzeitigen Messung der Uebertragungsfunktion eines realen Systems und des Leistungsdichtespektrums des ueberlagerten Rauschens am Systemausgang (Teil 2)", "comment": "288 pages, in German", "summary": "The method described in the first part for frequency-selectively measuring the transfer function and the noise power spectral density of the superimposed noise at the output of a disturbed, real system with nonlinearities using windowing was limited to time-invariant systems with stationary and zero-mean processes. Here, we investigate how this measurement method can be extended so that all correlations existing between the input and output signals can also be measured using windowing for a periodically time-varying system disturbed by a cyclostationary noise process. An extended version of the window construction algorithm presented in the first part is introduced, in which some degrees of freedom not used there can be used to appropriately influence the properties of the window sequence depending on the application.\n  --\n  Das im ersten Teil beschriebene Verfahren die Uebertragungsfunktion und das Rauschleistungsdichtespektrum des ueberlagerten Rauschens am Ausgang eines gestoerten, realen Systems mit Nichtlinearitaeten mit Hilfe der Fensterung frequenzselektiv zu vermessen beschraenkte sich auf zeitinvariante Systeme mit stationaeren und mittelwertfreien Prozessen. Hier wird untersucht, wie dieses Messverfahren zu erweitern ist, so dass man damit auch alle Korrelationen, die zwischen Ein- und Ausgangssignal bestehen, bei einem periodisch zeitvarianten System, das von einem zyklostationaeren Rauschprozess gestoert wird, mit einer Fensterung messen kann. Es wird eine erweiterte Variante des im ersten Teil vorgestellten Algorithmus zur Konstruktion des Fensters angegeben, bei der einige dort nicht genutzte Freiheitsgrade dazu verwendet werden koennen, die Eigenschaften der Fensterfolge je nach Applikation geeignet zu beeinflussen."}
{"id": "2511.14986", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.14986", "abs": "https://arxiv.org/abs/2511.14986", "authors": ["Jade Pinkenburg", "Changuk Lee", "Mohammad Meraj Ghanbari", "Cem Yalcin", "Miguel Montalban", "Rikky Muller"], "title": "DustNet: A Wireless Network of Ultrasonic Neural Implants", "comment": null, "summary": "Spatially distributed peripheral nerve recordings can be used to reconstruct motor intention and improve natural control of prosthetics in patients with limb deficiencies. However, many existing clinical solutions rely on percutaneous wires to access peripheral nerves; these sites are prone to infection and electrode degradation, preventing chronic use. To enable longterm recording of deeply-seated peripheral nerves, this paper presents DustNet: a network of ultrasonically-powered neural recording implants capable of supporting up to 8 simultaneously recording nodes over a single ultrasound link. To enable high throughput multi-implant communication, DustNet implements a time-division multiple-access (TDMA) protocol with up to 16-level amplitude modulation of the ultrasound backscatter that achieves up to 4x higher data rates than traditional on-off keying methods. Each neural implant consists of a 0.7x0.7x0.7 mm^3 piezoceramic transducer, a 10 nF off-chip capacitor, and an IC mounted on a flexible PCB. The implant IC was fabricated in a 28nm CMOS process and occupies an area of 0.43 mm^2. System functionality was verified within FDA power limits at 90mm depth, achieving a maximum data rate of 400 kb/s at 2 MHz ultrasound carrier frequency, with each implant transmitting uplink data at 50 kb/s and dissipating just 7 μW of power"}
{"id": "2511.15404", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15404", "abs": "https://arxiv.org/abs/2511.15404", "authors": ["Zizhen Zhou", "Ying-Chang Liang", "Yanyu Cheng", "Wei Yang Bryan Lim"], "title": "Communication-Pipelined Split Federated Learning for Foundation Model Fine-Tuning in UAV Networks", "comment": "This work has been submitted to the IEEE for possible publication", "summary": "Deploying foundation models (FMs) on uncrewed aerial vehicles (UAVs) promises broad ``low-altitude economy'' applications. Split federated learning (SFL)-based fine-tuning leverages distributed data while keeping raw data local and reduces client-side burden by partitioning the model between client and server. However, the per-round training latency is dominated by stragglers. Training paradigms featuring parallel gradient transmission (GT) allocate dedicated portions of downlink communication resources to each client. They may leave resources idle and suffer from prolonged GT latency, especially in UAV networks, where the communication latency typically far exceeds the computation latency. To address this, we propose a sequential GT paradigm, where the server dedicates all downlink resources for the current GT. We further propose communication-pipelined SFL (CPSFL), characterized by downlink GT priority scheduling and intra-round asynchronous training. We investigate CPSFL-based LoRA fine-tuning of FMs in UAV networks and formulate an optimization problem to minimize a weighted sum of per-round training latency and worst-case client energy consumption by optimizing the split point selection (SPS) and the computing and communication resource allocation (CCRA) (the uplink bandwidth allocation and the server computing frequency allocation). To solve this problem, we develop an attention-based deep reinforcement learning (DRL) framework, where the base station agent decides the split point and the CCRA in each round by leveraging previous round information, including UAV trajectories. Simulation results show that the proposed DRL-based CPSFL scheme outperforms the parallel GT benchmarks, the ablation variants, the fixed CCRA scheme, while approaching the best fixed-SPS scheme."}
{"id": "2511.14846", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.14846", "abs": "https://arxiv.org/abs/2511.14846", "authors": ["Yifeng Ding", "Hung Le", "Songyang Han", "Kangrui Ruan", "Zhenghui Jin", "Varun Kumar", "Zijian Wang", "Anoop Deoras"], "title": "Empowering Multi-Turn Tool-Integrated Reasoning with Group Turn Policy Optimization", "comment": null, "summary": "Training Large Language Models (LLMs) for multi-turn Tool-Integrated Reasoning (TIR) - where models iteratively reason, generate code, and verify through execution - remains challenging for existing reinforcement learning (RL) approaches. Current RL methods, exemplified by Group Relative Policy Optimization (GRPO), suffer from coarse-grained, trajectory-level rewards that provide insufficient learning signals for complex multi-turn interactions, leading to training stagnation. To address this issue, we propose Group Turn Policy Optimization (GTPO), a novel RL algorithm specifically designed for training LLMs on multi-turn TIR tasks. GTPO introduces three key innovations: (1) turn-level reward assignment that provides fine-grained feedback for individual turns, (2) return-based advantage estimation where normalized discounted returns are calculated as advantages, and (3) self-supervised reward shaping that exploits self-supervision signals from generated code to densify sparse binary outcome-based rewards. Our comprehensive evaluation demonstrates that GTPO outperforms GRPO by 3.0% on average across diverse reasoning benchmarks, establishing its effectiveness for advancing complex mathematical reasoning in the real world."}
{"id": "2511.14963", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.14963", "abs": "https://arxiv.org/abs/2511.14963", "authors": ["Adrian Shuai Li", "Elisa Bertino"], "title": "LFreeDA: Label-Free Drift Adaptation for Windows Malware Detection", "comment": null, "summary": "Machine learning (ML)-based malware detectors degrade over time as concept drift introduces new and evolving families unseen during training. Retraining is limited by the cost and time of manual labeling or sandbox analysis. Existing approaches mitigate this via drift detection and selective labeling, but fully label-free adaptation remains largely unexplored. Recent self-training methods use a previously trained model to generate pseudo-labels for unlabeled data and then train a new model on these labels. The unlabeled data are used only for inference and do not participate in training the earlier model. We argue that these unlabeled samples still carry valuable information that can be leveraged when incorporated appropriately into training. This paper introduces LFreeDA, an end-to-end framework that adapts malware classifiers to drift without manual labeling or drift detection. LFreeDA first performs unsupervised domain adaptation on malware images, jointly training on labeled and unlabeled samples to infer pseudo-labels and prune noisy ones. It then adapts a classifier on CFG representations using the labeled and selected pseudo-labeled data, leveraging the scalability of images for pseudo-labeling and the richer semantics of CFGs for final adaptation. Evaluations on the real-world MB-24+ dataset show that LFreeDA improves accuracy by up to 12.6% and F1 by 11.1% over no-adaptation lower bounds, and is only 4% and 3.4% below fully supervised upper bounds in accuracy and F1, respectively. It also matches the performance of state-of-the-art methods provided with ground truth labels for 300 target samples. Additional results on two controlled-drift benchmarks further confirm that LFreeDA maintains malware detection performance as malware evolves without human labeling."}
{"id": "2511.15026", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15026", "abs": "https://arxiv.org/abs/2511.15026", "authors": ["Zengrui Han", "Lu Bai", "Xuesong Cai", "Xiang Cheng"], "title": "WiCo-MG: Wireless Channel Foundation Model for Multipath Generation via Synesthesia of Machines", "comment": null, "summary": "Precise modeling of channel multipath is essential for understanding wireless propagation environments and optimizing communication systems. In particular, sixth-generation (6G) artificial intelligence (AI)-native communication systems demand massive and high-quality multipath channel data to enable intelligent model training and performance optimization. In this paper, we propose a wireless channel foundation model (WiCo) for multipath generation (WiCo-MG) via Synesthesia of Machines (SoM). To provide a solid training foundation for WiCo-MG, a new synthetic intelligent sensing-communication dataset for uncrewed aerial vehicle (UAV)-to-ground (U2G) communications is constructed. To overcome the challenges of cross-modal alignment and mapping, a two-stage training framework is proposed. In the first stage, sensing images are embedded into discrete-continuous SoM feature spaces, and multipath maps are embedded into a sensing-initialized discrete SoM space to align the representations. In the second stage, a mixture of shared and routed experts (S-R MoE) Transformer with frequency-aware expert routing learns the mapping from sensing to channel SoM feature spaces, enabling decoupled and adaptive multipath generation. Experimental results demonstrate that WiCo-MG achieves state-of-the-art in-distribution generation performance and superior out-of-distribution generalization, reducing NMSE by more than 2.59 dB over baselines, while exhibiting strong scalability in model and dataset growth and extensibility to new multipath parameters and tasks. Owing to higher accuracy, stronger generalization, and better scalability, WiCo-MG is expected to enable massive and high-fidelity channel data generation for the development of 6G AI-native communication systems."}
{"id": "2511.15014", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15014", "abs": "https://arxiv.org/abs/2511.15014", "authors": ["Ibrahim Shahbaz", "Eman Hammad", "Abdallah Farraj"], "title": "An Interpretable Federated Learning Control Framework Design for Smart Grid Resilience", "comment": "Accepted for the IEEE T&D 2026 conference", "summary": "Power systems remain highly vulnerable to disturbances and cyber-attacks, underscoring the need for resilient and adaptive control strategies. In this work, we investigate a data-driven Federated Learning Control (FLC) framework for transient stability resilience under cyber-physical disturbances. The FLC employs interpretable neural controllers based on the Chebyshev Kolmogorov-Arnold Network (ChebyKAN), trained on a shared centralized control policy and deployed for distributed execution. Simulation results on the IEEE 39-bus New England system show that the proposed FLC consistently achieves faster stabilization than distributed baselines at moderate control levels (10\\%--60\\%), highlighting its potential as a scalable, resilient, and interpretable learning-based control solution for modern power grids."}
{"id": "2511.15555", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15555", "abs": "https://arxiv.org/abs/2511.15555", "authors": ["Yajun Zhao", "Mengnan Jian", "Yifei Yuan"], "title": "RIS-Enabled UAV Communications and Sensing: Opportunities, Challenges, and Key Technologies", "comment": "21 pages, 9 figures. Submitted to TCCN", "summary": "Unmanned Aerial Vehicles (UAVs) play a pivotal role in the emerging low-altitude economy. However, they face significant challenges in achieving reliable network coverage during transit operations. This paper provides an in-depth investigation into the characteristics and challenges of communication networks tailored for UAVs. First, we outline typical operational scenarios, traffic patterns, and a dual-layer heterogeneous network topology. This topology is essential for enabling three-dimensional continuous coverage and ensuring seamless network coexistence between UAVs and other network entities. Moreover, the paper delves into the channel characteristics and specific challenges faced by UAV Integrated Sensing and Communication (ISAC) networks. It highlights the limitations of traditional Active Phased Array Antenna (APAA)-based networks, particularly regarding cost, complexity, and site deployment constraints. We then introduce Reconfigurable Intelligent Surface (RIS)-assisted networks as a promising solution for enhancing UAV signal coverage. The key technical features of RIS are discussed, including design principles, antenna tilt configurations, new beam types, and beam tracking mechanisms. In addition, we examine the impact of highfrequency bands and their absorption peaks on signal attenuation. The paper further explores network architecture designs aimed at improving UAV signal coverage, facilitating network coexistence, and supporting RIS-enhanced UAV sensing. Field trial results evaluating the effectiveness of RIS in improving UAV coverage are presented. Finally, we outline future technological trends and highlight potential advancements to further optimize UAV communication systems. We also emphasize the importance of engineering implementation and standardization efforts in RIS-based UAV-ISAC networks."}
{"id": "2511.14865", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.14865", "abs": "https://arxiv.org/abs/2511.14865", "authors": ["Dwipam Katariya", "Snehita Varma", "Akshat Shreemali", "Benjamin Wu", "Kalanand Mishra", "Pranab Mohanty"], "title": "FinTRec: Transformer Based Unified Contextual Ads Targeting and Personalization for Financial Applications", "comment": "10 pages, 7 figures, Accepted at CARS @ RecSys 2025", "summary": "Transformer-based architectures are widely adopted in sequential recommendation systems, yet their application in Financial Services (FS) presents distinct practical and modeling challenges for real-time recommendation. These include:a) long-range user interactions (implicit and explicit) spanning both digital and physical channels generating temporally heterogeneous context, b) the presence of multiple interrelated products require coordinated models to support varied ad placements and personalized feeds, while balancing competing business goals. We propose FinTRec, a transformer-based framework that addresses these challenges and its operational objectives in FS. While tree-based models have traditionally been preferred in FS due to their explainability and alignment with regulatory requirements, our study demonstrate that FinTRec offers a viable and effective shift toward transformer-based architectures. Through historic simulation and live A/B test correlations, we show FinTRec consistently outperforms the production-grade tree-based baseline. The unified architecture, when fine-tuned for product adaptation, enables cross-product signal sharing, reduces training cost and technical debt, while improving offline performance across all products. To our knowledge, this is the first comprehensive study of unified sequential recommendation modeling in FS that addresses both technical and business considerations."}
{"id": "2511.14989", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.14989", "abs": "https://arxiv.org/abs/2511.14989", "authors": ["Saeefa Rubaiyet Nowmi", "Jesus Lopez", "Md Mahmudul Alam Imon", "Shahrooz Pouryouse", "Mohammad Saidur Rahman"], "title": "Critical Evaluation of Quantum Machine Learning for Adversarial Robustness", "comment": null, "summary": "Quantum Machine Learning (QML) integrates quantum computational principles into learning algorithms, offering improved representational capacity and computational efficiency. Nevertheless, the security and robustness of QML systems remain underexplored, especially under adversarial conditions. In this paper, we present a systematization of adversarial robustness in QML, integrating conceptual organization with empirical evaluation across three threat models-black-box, gray-box, and white-box. We implement representative attacks in each category, including label-flipping for black-box, QUID encoder-level data poisoning for gray-box, and FGSM and PGD for white-box, using Quantum Neural Networks (QNNs) trained on two datasets from distinct domains: MNIST from computer vision and AZ-Class from Android malware, across multiple circuit depths (2, 5, 10, and 50 layers) and two encoding schemes (angle and amplitude). Our evaluation shows that amplitude encoding yields the highest clean accuracy (93% on MNIST and 67% on AZ-Class) in deep, noiseless circuits; however, it degrades sharply under adversarial perturbations and depolarization noise (p=0.01), dropping accuracy below 5%. In contrast, angle encoding, while offering lower representational capacity, remains more stable in shallow, noisy regimes, revealing a trade-off between capacity and robustness. Moreover, the QUID attack attains higher attack success rates, though quantum noise channels disrupt the Hilbert-space correlations it exploits, weakening its impact in image domains. This suggests that noise can act as a natural defense mechanism in Noisy Intermediate-Scale Quantum (NISQ) systems. Overall, our findings guide the development of secure and resilient QML architectures for practical deployment. These insights underscore the importance of designing threat-aware models that remain reliable under real-world noise in NISQ settings."}
{"id": "2511.15030", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15030", "abs": "https://arxiv.org/abs/2511.15030", "authors": ["Mingran Sun", "Lu Bai", "Ziwei Huang", "Xuesong Cai", "Xiang Cheng", "Jianjun Wu"], "title": "WiCo-PG: Wireless Channel Foundation Model for Pathloss Map Generation via Synesthesia of Machines", "comment": null, "summary": "A wireless channel foundation model for pathloss map generation (WiCo-PG) via Synesthesia of Machines (SoM) is developed for the first time. Considering sixth-generation (6G) uncrewed aerial vehicle (UAV)-to-ground (U2G) scenarios, a new multi-modal sensing-communication dataset is constructed for WiCo-PG pre-training, including multiple U2G scenarios, diverse flight altitudes, and diverse frequency bands. Based on the constructed dataset, the proposed WiCo-PG enables cross-modal pathloss map generation by leveraging RGB images from different scenarios and flight altitudes. In WiCo-PG, a novel network architecture designed for cross-modal pathloss map generation based on dual vector quantized generative adversarial networks (VQGANs) and Transformer is proposed. Furthermore, a novel frequency-guided shared-routed mixture of experts (S-R MoE) architecture is designed for cross-modal pathloss map generation. Simulation results demonstrate that the proposed WiCo-PG achieves improved pathloss map generation accuracy through pre-training with a normalized mean squared error (NMSE) of 0.012, outperforming the large language model (LLM)-based scheme, i.e., LLM4PG, and the conventional deep learning-based scheme by more than 6.98 dB. The enhanced generality of the proposed WiCo-PG can further outperform the LLM4PG by at least 1.37 dB using 2.7% samples in few-shot generalization."}
{"id": "2511.15034", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15034", "abs": "https://arxiv.org/abs/2511.15034", "authors": ["Kaixin Lu", "Ziliang Lyu", "Haoyong Yu"], "title": "Inverse optimal design of input-to-state stabilizing homogeneous controllers for nonlinear homogeneous systems", "comment": "Accepted for Publication in Automatica", "summary": "This work studies the inverse optimality of input-to-state stabilizing controllers with input-output stability guarantees for nonlinear homogeneous systems. We formulate a new inverse optimal control problem, where the cost functional incorporates penalties on the output, in addition to the state, control and disturbance as in current related works. One benefit of penalizing the output is that the resulting inverse optimal controllers can ensure both input-to-state stability and input-output stability. We propose a technique for constructing the corresponding meaningful cost functional by using homogeneity properties, and provide sufficient conditions on solving the inverse optimal gain assignment problem. We show that homogeneous stabilizability of homogeneous systems in the case without disturbance is sufficient for the solvability of inverse optimal gain assignment problem for homogeneous systems."}
{"id": "2511.14887", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.14887", "abs": "https://arxiv.org/abs/2511.14887", "authors": ["Nathan M. Roberts", "Xiaosong Du"], "title": "Transformer-Guided Deep Reinforcement Learning for Optimal Takeoff Trajectory Design of an eVTOL Drone", "comment": "Conference version with 12 pages and 2 figures", "summary": "The rapid advancement of electric vertical take-off and landing (eVTOL) aircraft offers a promising opportunity to alleviate urban traffic congestion. Thus, developing optimal takeoff trajectories for minimum energy consumption becomes essential for broader eVTOL aircraft applications. Conventional optimal control methods (such as dynamic programming and linear quadratic regulator) provide highly efficient and well-established solutions but are limited by problem dimensionality and complexity. Deep reinforcement learning (DRL) emerges as a special type of artificial intelligence tackling complex, nonlinear systems; however, the training difficulty is a key bottleneck that limits DRL applications. To address these challenges, we propose the transformer-guided DRL to alleviate the training difficulty by exploring a realistic state space at each time step using a transformer. The proposed transformer-guided DRL was demonstrated on an optimal takeoff trajectory design of an eVTOL drone for minimal energy consumption while meeting takeoff conditions (i.e., minimum vertical displacement and minimum horizontal velocity) by varying control variables (i.e., power and wing angle to the vertical). Results presented that the transformer-guided DRL agent learned to take off with $4.57\\times10^6$ time steps, representing 25% of the $19.79\\times10^6$ time steps needed by a vanilla DRL agent. In addition, the transformer-guided DRL achieved 97.2% accuracy on the optimal energy consumption compared against the simulation-based optimal reference while the vanilla DRL achieved 96.3% accuracy. Therefore, the proposed transformer-guided DRL outperformed vanilla DRL in terms of both training efficiency as well as optimal design verification."}
{"id": "2511.15031", "categories": ["cs.CR", "cs.DC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15031", "abs": "https://arxiv.org/abs/2511.15031", "authors": ["Yifan Cai", "Linh Thi Xuan Phan"], "title": "GeoShield: Byzantine Fault Detection and Recovery for Geo-Distributed Real-Time Cyber-Physical Systems", "comment": null, "summary": "Large-scale cyber-physical systems (CPS), such as railway control systems and smart grids, consist of geographically distributed subsystems that are connected via unreliable, asynchronous inter-region networks. Their scale and distribution make them especially vulnerable to faults and attacks. Unfortunately, existing fault-tolerant methods either consume excessive resources or provide only eventual guarantees, making them unsuitable for real-time resource-constrained CPS.\n  We present GeoShield, a resource-efficient solution for defending geo-distributed CPS against Byzantine faults. GeoShield leverages the property that CPS are designed to tolerate brief disruptions and maintain safety, as long as they recover (i.e., resume normal operations or transition to a safe mode) within a bounded amount of time following a fault. Instead of masking faults, it detects them and recovers the system within bounded time, thus guaranteeing safety with much fewer resources. GeoShield introduces protocols for Byzantine fault-resilient network measurement and inter-region omission fault detection that proactively detect malicious message delays, along with recovery mechanisms that guarantee timely recovery while maximizing operational robustness. It is the first bounded-time recovery solution that operates effectively under unreliable networks without relying on trusted hardware. Evaluations using real-world case studies show that it significantly outperforms existing methods in both effectiveness and resource efficiency."}
{"id": "2511.15064", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15064", "abs": "https://arxiv.org/abs/2511.15064", "authors": ["Eros Kuikel", "Sidrah Javed", "Baha Eddine Youcef Belmekki", "Yunfei Chen", "Ning Wang", "Mohamed-Slim Alouini"], "title": "The Triple-C Paradigm: Cooperative, Complementary, and Competitive Modes for TBS-HAPS-LEO Integration", "comment": null, "summary": "The growing demands of ubiquitous and resilient global coverage have pushed existing networks to their operational limits, making it increasingly difficult to meet all requirements on their own. Integrating \\emph{Terrestrial Base Stations (TBS), High Altitude Platform Stations (HAPS)} and \\emph{Low-Earth-Orbit (LEO)} satellites is envisioned as a promising solution, yet the coordination across these heterogeneous platforms remains an open challenge. This paper proposes a novel unifying \\emph{Triple-C framework: Cooperation, Complementarity, and Competition}, that systematically defines the TBS-HAPS-LEO interaction to deliver seamless resilient and scalable connectivity. For each C, we detail the architectural methodology, required pre-requisites, and measurable deliverables that govern when and how the three layers should collaborate, complement each other, or contend. We further identify the enabling technologies across physical, logical, and cognitive layers to operationalize the proposed 3C paradigm. A rich portfolio of use cases and targeted applications demonstrates how this technological leap will make such integration both feasible and impactful. Comprehensive performance analysis and emulation results quantify the trade-offs of such integrated networks. In addition, we examine the economical, environmental, safety, privacy, standardization, and regulatory implications that shape the real-world implementation of the proposed framework. eventually, we provide the gap analysis, outline key technical/non-technical challenges, and a road-map of future research directions needed to unlock the full potential of Cooperation, Complementarity, and Competition operations in TBS-HAPS-LEO integrated networks."}
{"id": "2511.15044", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15044", "abs": "https://arxiv.org/abs/2511.15044", "authors": ["Gang Wang", "Wenjie Liu", "Yifei Li", "Xin Wang", "Jian Sun", "Jie Chen"], "title": "Data-driven control of network systems: Accounting for communication adaptivity and security", "comment": "to be published in Science China Information Sciences", "summary": "Over the past decades, network systems have surged in significance, driven by merging technological advancements. These systems play pivotal roles in diverse applications ranging from autonomous driving to smart grids, yet they confront complexities arising from network imperfections and intricate interconnections, which challenge system identification, controller design, as well as stability and performance analysis. This survey provides an in-depth exploration of network systems from most recent data-driven perspective, across four key issues: communication delay, aperiodic sampling, network security, and distributed configurations. By doing so, this survey enhances our comprehension of the challenges and theoretical innovations within the realm of network systems."}
{"id": "2511.15108", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15108", "abs": "https://arxiv.org/abs/2511.15108", "authors": ["Liujia Yao", "Changsheng You", "Chao Zhou", "Beixiong Zheng", "Weidong Mei"], "title": "Position Optimization for Two-layer Movable Antenna Systems", "comment": null, "summary": "Movable antenna (MA) is a promising technology for improving the performance of wireless communication systems by providing new degrees-of-freedom (DoFs) in antenna position optimization. However, existing works on MA systems have mostly considered element-wise single-layer MA (SL-MA) arrays, where all the MAs move within the given movable region, hence inevitably incurring high control complexity and hardware cost in practice. To address this issue, we propose in this letter a new two-layer MA array (TL-MA), where the positions of MAs are jointly determined by the large-scale movement of multiple subarrays and the small-scale fine-tuning of per-subarray MAs. In particular, an optimization problem is formulated to maximize the sum-rate of the TL-MA-aided communication system by jointly optimizing the subarray-positions, per-subarray (relative) MA positions, and receive beamforming. To solve this non-convex problem, we propose an alternating optimization (AO)-based particle swarm optimization (PSO) algorithm, which alternately optimizes the positions of subarrays and per-subarray MAs, given the optimal receive beamforming. Numerical results verify that the proposed TL-MA significantly reduces the sum-displacement of MA motors (i.e., the total moving distances of all motors) of element-wise SL-MA, while achieving comparable rate performance."}
{"id": "2511.14889", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.14889", "abs": "https://arxiv.org/abs/2511.14889", "authors": ["Grace Kim", "Filip Svoboda", "Nicholas Lane"], "title": "Bringing Federated Learning to Space", "comment": "15 pages, 9 figures, 3 tables accepted to IEEE Aeroconf 2026", "summary": "As Low Earth Orbit (LEO) satellite constellations rapidly expand to hundreds and thousands of spacecraft, the need for distributed on-board machine learning becomes critical to address downlink bandwidth limitations. Federated learning (FL) offers a promising framework to conduct collaborative model training across satellite networks. Realizing its benefits in space naturally requires addressing space-specific constraints, from intermittent connectivity to dynamics imposed by orbital motion. This work presents the first systematic feasibility analysis of adapting off-the-shelf FL algorithms for satellite constellation deployment. We introduce a comprehensive \"space-ification\" framework that adapts terrestrial algorithms (FedAvg, FedProx, FedBuff) to operate under orbital constraints, producing an orbital-ready suite of FL algorithms. We then evaluate these space-ified methods through extensive parameter sweeps across 768 constellation configurations that vary cluster sizes (1-10), satellites per cluster (1-10), and ground station networks (1-13). Our analysis demonstrates that space-adapted FL algorithms efficiently scale to constellations of up to 100 satellites, achieving performance close to the centralized ideal. Multi-month training cycles can be reduced to days, corresponding to a 9x speedup through orbital scheduling and local coordination within satellite clusters. These results provide actionable insights for future mission designers, enabling distributed on-board learning for more autonomous, resilient, and data-driven satellite operations."}
{"id": "2511.15033", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2511.15033", "abs": "https://arxiv.org/abs/2511.15033", "authors": ["Thanh-Cong Nguyen", "Ngoc-Thanh Nguyen", "Van-Giau Ung", "Duc-Ly Vu"], "title": "Towards Classifying Benign And Malicious Packages Using Machine Learning", "comment": "5 pages, 2 figures, 3 tables", "summary": "Recently, the number of malicious open-source packages in package repositories has been increasing dramatically. While major security scanners focus on identifying known Common Vulnerabilities and Exposures (CVEs) in open-source packages, there are very few studies on detecting malicious packages. Malicious open-source package detection typically requires static, dynamic analysis, or both. Dynamic analysis is more effective as it can expose a package's behaviors at runtime. However, current dynamic analysis tools (e.g., ossf's package-analysis) lack an automatic method to differentiate malicious packages from benign packages. In this paper, we propose an approach to extract the features from dynamic analysis (e.g., executed commands) and leverage machine learning techniques to automatically classify packages as benign or malicious. Our evaluation of nearly 2000 packages on npm shows that the machine learning classifier achieves an AUC of 0.91 with a false positive rate of nearly 0%."}
{"id": "2511.15093", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15093", "abs": "https://arxiv.org/abs/2511.15093", "authors": ["Weijie Xiong", "Jingran Lin", "Cunhua Pan", "Yilong Zeng", "Qiang Li"], "title": "Enhancing Physical Layer Security in MIMO Systems Assisted by Beyond-Diagonal Reconfigurable Intelligent Surfaces", "comment": null, "summary": "Reconfigurable intelligent surfaces (RISs) hold significant promise for enhancing physical layer security (PLS). However, conventional RISs are typically modeled using diagonal scattering matrices, capturing only independent reflections from each reflecting element, which limits their flexibility in channel manipulation. In contrast, beyond-diagonal RISs (BD-RISs) employ non-diagonal scattering matrices enabled by active and tunable inter-element connections through a shared impedance network. This architecture significantly enhances channel shaping capabilities, creating new opportunities for advanced PLS techniques. This paper investigates PLS in a multiple-input multiple-output (MIMO) system assisted by BD-RISs, where a multi-antenna transmitter sends confidential information to a multi-antenna legitimate user while a multi-antenna eavesdropper attempts interception. To maximize the secrecy rate (SR), we formulate it as a non-convex optimization problem by jointly optimizing the transmit beamforming and BD-RIS REs under power and structural constraints. To solve this problem, we first introduce an auxiliary variable to decouple BD-RIS constraints. We then propose a low-complexity penalty product Riemannian conjugate gradient descent (P-PRCGD) method, which combines the augmented Lagrangian (AL) approach with the product manifold gradient descent (PMGD) method to obtain a Karush-Kuhn-Tucker (KKT) solution. Simulation results confirm that BD-RIS-assisted systems significantly outperform conventional RIS-assisted systems in PLS performance."}
{"id": "2511.15119", "categories": ["eess.SY", "cs.RO", "math.DS", "math.OC"], "pdf": "https://arxiv.org/pdf/2511.15119", "abs": "https://arxiv.org/abs/2511.15119", "authors": ["Velimir Todorovski", "Kwang Hak Kim", "Alessandro Astolfi", "Miroslav Krstic"], "title": "Nonholonomic Robot Parking by Feedback -- Part I: Modular Strict CLF Designs", "comment": null, "summary": "It has been known in the robotics literature since about 1995 that, in polar coordinates, the nonholonomic unicycle is asymptotically stabilizable by smooth feedback, even globally. We introduce a modular design framework that selects the forward velocity to decouple the radial coordinate, allowing the steering subsystem to be stabilized independently. Within this structure, we develop families of feedback laws using passivity, backstepping, and integrator forwarding. Each law is accompanied by a strict control Lyapunov function, including barrier variants that enforce angular constraints. These strict CLFs provide constructive class KL convergence estimates and enable eigenvalue assignment at the target equilibrium. The framework generalizes and extends prior modular and nonmodular approaches, while preparing the ground for inverse optimal and adaptive redesigns in the sequel paper."}
{"id": "2511.15175", "categories": ["cs.LG", "cs.IT", "quant-ph"], "pdf": "https://arxiv.org/pdf/2511.15175", "abs": "https://arxiv.org/abs/2511.15175", "authors": ["Le Tung Giang", "Vu Hoang Viet", "Nguyen Xuan Tung", "Trinh Van Chien", "Won-Joo Hwang"], "title": "Vehicle Routing Problems via Quantum Graph Attention Network Deep Reinforcement Learning", "comment": "11 pages, 3 figures, 2 tables. Accepted by SOICT 2025", "summary": "The vehicle routing problem (VRP) is a fundamental NP-hard task in intelligent transportation systems with broad applications in logistics and distribution. Deep reinforcement learning (DRL) with Graph Neural Networks (GNNs) has shown promise, yet classical models rely on large multi-layer perceptrons (MLPs) that are parameter-heavy and memory-bound. We propose a Quantum Graph Attention Network (Q-GAT) within a DRL framework, where parameterized quantum circuits (PQCs) replace conventional MLPs at critical readout stages. The hybrid model maintains the expressive capacity of graph attention encoders while reducing trainable parameters by more than 50%. Using proximal policy optimization (PPO) with greedy and stochastic decoding, experiments on VRP benchmarks show that Q-GAT achieves faster convergence and reduces routing cost by about 5% compared with classical GAT baselines. These results demonstrate the potential of PQC-enhanced GNNs as compact and effective solvers for large-scale routing and logistics optimization."}
{"id": "2511.14903", "categories": ["cs.LG", "cs.SE"], "pdf": "https://arxiv.org/pdf/2511.14903", "abs": "https://arxiv.org/abs/2511.14903", "authors": ["Ruixin Zhang", "Jon Donnelly", "Zhicheng Guo", "Ghazal Khalighinejad", "Haiyang Huang", "Alina Jade Barnett", "Cynthia Rudin"], "title": "It's LIT! Reliability-Optimized LLMs with Inspectable Tools", "comment": "Accepted to the 39th Conference on Neural Information Processing Systems (NeurIPS 2025) Workshop on Multi-Turn Interactions in Large Language Models", "summary": "Large language models (LLMs) have exhibited remarkable capabilities across various domains. The ability to call external tools further expands their capability to handle real-world tasks. However, LLMs often follow an opaque reasoning process, which limits their usefulness in high-stakes domains where solutions need to be trustworthy to end users. LLMs can choose solutions that are unreliable and difficult to troubleshoot, even if better options are available. We address this issue by forcing LLMs to use external -- more reliable -- tools to solve problems when possible. We present a framework built on the tool-calling capabilities of existing LLMs to enable them to select the most reliable and easy-to-troubleshoot solution path, which may involve multiple sequential tool calls. We refer to this framework as LIT (LLMs with Inspectable Tools). In order to support LIT, we introduce a new and challenging benchmark dataset of 1,300 questions and a customizable set of reliability cost functions associated with a collection of specialized tools. These cost functions summarize how reliable each tool is and how easy it is to troubleshoot. For instance, a calculator is reliable across domains, whereas a linear prediction model is not reliable if there is distribution shift, but it is easy to troubleshoot. A tool that constructs a random forest is neither reliable nor easy to troubleshoot. These tools interact with the Harvard USPTO Patent Dataset and a new dataset of NeurIPS 2023 papers to solve mathematical, coding, and modeling problems of varying difficulty levels. We demonstrate that LLMs can achieve more reliable and informed problem-solving while maintaining task performance using our framework."}
{"id": "2511.15071", "categories": ["cs.CR", "cs.LO"], "pdf": "https://arxiv.org/pdf/2511.15071", "abs": "https://arxiv.org/abs/2511.15071", "authors": ["Ashwin Karthikeyan", "Hengyu Liu", "Kuldeep S. Meel", "Ning Luo"], "title": "Towards Practical Zero-Knowledge Proof for PSPACE", "comment": null, "summary": "Efficient zero-knowledge proofs (ZKPs) have been restricted to NP statements so far, whereas they exist for all statements in PSPACE. This work presents the first practical zero-knowledge (ZK) protocols for PSPACE-complete statements by enabling ZK proofs of QBF (Quantified Boolean Formula) evaluation. The core idea is to validate quantified resolution proofs (Q-Res) in ZK. We develop an efficient polynomial encoding of Q-Res proofs, enabling proof validation through low-overhead arithmetic checks. We also design a ZK protocol to prove knowledge of a winning strategy related to the QBF, which is often equally important in practice. We implement our protocols and evaluate them on QBFEVAL. The results show that our protocols can verify 72% of QBF evaluations via Q-Res proof and 82% of instances' winning strategies within 100 seconds, for instances where such proofs or strategies can be obtained."}
{"id": "2511.15095", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15095", "abs": "https://arxiv.org/abs/2511.15095", "authors": ["Weijie Xiong", "Jingran Lin", "Zhiling Xiao", "Qiang Li"], "title": "Constant-Modulus Secure Analog Beamforming for an IRS-Assisted Communication System with Large-Scale Antenna Array", "comment": null, "summary": "Physical layer security (PLS) is an important technology in wireless communication systems to safeguard communication privacy and security between transmitters and legitimate users. The integration of large-scale antenna arrays (LSAA) and intelligent reflecting surfaces (IRS) has emerged as a promising approach to enhance PLS. However, LSAA requires a dedicated radio frequency (RF) chain for each antenna element, and IRS comprises hundreds of reflecting micro-antennas, leading to increased hardware costs and power consumption. To address this, cost-effective solutions like constant modulus analog beamforming (CMAB) have gained attention. This paper investigates PLS in IRS-assisted communication systems with a focus on jointly designing the CMAB at the transmitter and phase shifts at the IRS to maximize the secrecy rate. The resulting secrecy rate maximization (SRM) problem is non-convex. To solve the problem efficiently, we propose two algorithms: (1) the time-efficient Dinkelbach-BSUM algorithm, which reformulates the fractional problem into a series of quadratic programs using the Dinkelbach method and solves them via block successive upper-bound minimization (BSUM), and (2) the product manifold conjugate gradient descent (PMCGD) algorithm, which provides a better solution at the cost of slightly higher computational time by transforming the problem into an unconstrained optimization on a Riemannian product manifold and solving it using the conjugate gradient descent (CGD) algorithm. Simulation results validate the effectiveness of the proposed algorithms and highlight their distinct advantages."}
{"id": "2511.15219", "categories": ["eess.SY", "math.OC"], "pdf": "https://arxiv.org/pdf/2511.15219", "abs": "https://arxiv.org/abs/2511.15219", "authors": ["Kwang Hak Kim", "Velimir Todorovski", "Miroslav Krstić"], "title": "Nonholonomic Robot Parking by Feedback -- Part II: Nonmodular, Inverse Optimal, Adaptive, Prescribed/Fixed-Time and Safe Designs", "comment": "16 pages", "summary": "For the unicycle system, we provide constructive methods for the design of feedback laws that have one or more of the following properties: being nonmodular and globally exponentially stabilizing, inverse optimal, robust to arbitrary decrease or increase of input coefficients, adaptive, prescribed/fixed-time stabilizing, and safe (ensuring the satisfaction of state constraints). Our nonmodular backstepping feedbacks are implementable with either unidirectional or bidirectional velocity actuation. Thanks to constructing families of strict CLFs for the unicycle, we introduce a general design framework and families of feedback laws for the unicycle, which are inverse optimal with respect to meaningful costs. These inverse optimal feedback laws are endowed with robustness to actuator uncertainty and arbitrarily low input saturation due to the unicycle's driftlessness. Besides ensuring robustness to unknown input coefficients, we also develop adaptive laws for these unknown coefficients, enabling the achievement of good transient performance with lower initial control effort. Additionally, we develop controllers that achieve stabilization within a user-specified time horizon using two systematic methods: time-dilated prescribed-time design with smooth-in-time convergence to zero of both the states and the inputs and homogeneity-based fixed-time control that provides an explicit bound on the settling time. Finally, with a nonovershooting design we guarantee strictly forward motion without curb violation. This article, along with its Part I, lays a broad constructive design foundation for stabilization of the nonholonomic unicycle."}
{"id": "2511.15206", "categories": ["cs.CR", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15206", "abs": "https://arxiv.org/abs/2511.15206", "authors": ["Bui Duc Son", "Trinh Van Chien", "Dong In Kim"], "title": "Trustworthy GenAI over 6G: Integrated Applications and Security Frameworks", "comment": "8 pages, 5 figures. Submitted for publication", "summary": "The integration of generative artificial intelligence (GenAI) into 6G networks promises substantial performance gains while simultaneously exposing novel security vulnerabilities rooted in multimodal data processing and autonomous reasoning. This article presents a unified perspective on cross-domain vulnerabilities that arise across integrated sensing and communication (ISAC), federated learning (FL), digital twins (DTs), diffusion models (DMs), and large telecommunication models (LTMs). We highlight emerging adversarial agents such as compromised DTs and LTMs that can manipulate both the physical and cognitive layers of 6G systems. To address these risks, we propose an adaptive evolutionary defense (AED) concept that continuously co-evolves with attacks through GenAI-driven simulation and feedback, combining physical-layer protection, secure learning pipelines, and cognitive-layer resilience. A case study using an LLM-based port prediction model for fluid-antenna systems demonstrates the susceptibility of GenAI modules to adversarial perturbations and the effectiveness of the proposed defense concept. Finally, we summarize open challenges and future research directions toward building trustworthy, quantum-resilient, and adaptive GenAI-enabled 6G networks."}
{"id": "2511.14920", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.14920", "abs": "https://arxiv.org/abs/2511.14920", "authors": ["Zhengyang Shen", "Hua Tu", "Mayue Shi"], "title": "Structured Contrastive Learning for Interpretable Latent Representations", "comment": "Comments: 10 pages, 6 figures. Applications to medical signal retrieval and activity recognition. Correspondence: m.shi16@imperial.ac.uk", "summary": "Neural networks exhibit severe brittleness to semantically irrelevant transformations. A mere 75ms electrocardiogram (ECG) phase shift degrades latent cosine similarity from 1.0 to 0.2, while sensor rotations collapse activity recognition performance with inertial measurement units (IMUs). We identify the root cause as \"laissez-faire\" representation learning, where latent spaces evolve unconstrained provided task performance is satisfied. We propose Structured Contrastive Learning (SCL), a framework that partitions latent space representations into three semantic groups: invariant features that remain consistent under given transformations (e.g., phase shifts or rotations), variant features that actively differentiate transformations via a novel variant mechanism, and free features that preserve task flexibility. This creates controllable push-pull dynamics where different latent dimensions serve distinct, interpretable purposes. The variant mechanism enhances contrastive learning by encouraging variant features to differentiate within positive pairs, enabling simultaneous robustness and interpretability. Our approach requires no architectural modifications and integrates seamlessly into existing training pipelines. Experiments on ECG phase invariance and IMU rotation robustness demonstrate superior performance: ECG similarity improves from 0.25 to 0.91 under phase shifts, while WISDM activity recognition achieves 86.65% accuracy with 95.38% rotation consistency, consistently outperforming traditional data augmentation. This work represents a paradigm shift from reactive data augmentation to proactive structural learning, enabling interpretable latent representations in neural networks."}
{"id": "2511.15097", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15097", "abs": "https://arxiv.org/abs/2511.15097", "authors": ["Vineeth Sai Narajala", "Manish Bhatt", "Idan Habler", "Ronald F. Del Rosario"], "title": "MAIF: Enforcing AI Trust and Provenance with an Artifact-Centric Agentic Paradigm", "comment": "7 Pages, 2 Figures, 6 Tables, Repo: https://github.com/vineethsai/maifscratch-1", "summary": "The AI trustworthiness crisis threatens to derail the artificial intelligence revolution, with regulatory barriers, security vulnerabilities, and accountability gaps preventing deployment in critical domains. Current AI systems operate on opaque data structures that lack the audit trails, provenance tracking, or explainability required by emerging regulations like the EU AI Act. We propose an artifact-centric AI agent paradigm where behavior is driven by persistent, verifiable data artifacts rather than ephemeral tasks, solving the trustworthiness problem at the data architecture level. Central to this approach is the Multimodal Artifact File Format (MAIF), an AI-native container embedding semantic representations, cryptographic provenance, and granular access controls. MAIF transforms data from passive storage into active trust enforcement, making every AI operation inherently auditable. Our production-ready implementation demonstrates ultra-high-speed streaming (2,720.7 MB/s), optimized video processing (1,342 MB/s), and enterprise-grade security. Novel algorithms for cross-modal attention, semantic compression, and cryptographic binding achieve up to 225 compression while maintaining semantic fidelity. Advanced security features include stream-level access control, real-time tamper detection, and behavioral anomaly analysis with minimal overhead. This approach directly addresses the regulatory, security, and accountability challenges preventing AI deployment in sensitive domains, offering a viable path toward trustworthy AI systems at scale."}
{"id": "2511.15096", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15096", "abs": "https://arxiv.org/abs/2511.15096", "authors": ["Weijie Xiong", "Kai Zhong", "Zhiling Xiao", "Jingran Lin", "Qiang Li"], "title": "Joint Analog Beamforming and Antenna Position Design for Secure Communication systems With Movable Antennas", "comment": null, "summary": "Movable antennas (MA) are a novel technology that allows for the flexible adjustment of antenna positions within a specified region, thereby enhancing the performance of wireless communication systems. In this paper, we explore the use of MA to improve physical layer security in an analog beamforming (AB) communication system. Our goal is to maximize the secrecy rate by jointly optimizing the transmit AB and MA position, subject to constant modulus (CM) constraints on the AB and position constraints for the MA. The resulting problem is non-convex, and we propose a penalty product manifold (PPM) method to solve it efficiently. Specifically, we convert the inequality constraints related to MA position into a penalty function using smoothing techniques, thereby reformulating the problem as an unconstrained optimization on the product manifold space (PMS). We then derive a parallel conjugate gradient descent (PCGD) algorithm to update both the AB and MA position on the PMS. This method is efficient, providing an analytical solution at each step and ensuring convergence to a KKT point. Simulation results show that the MA system achieves a higher secrecy rate than systems with fixed-position antennas."}
{"id": "2511.15238", "categories": ["eess.SY", "cs.FL", "cs.SC"], "pdf": "https://arxiv.org/pdf/2511.15238", "abs": "https://arxiv.org/abs/2511.15238", "authors": ["Ihab Tabbara", "Eliya Badr", "Hussein Sibai"], "title": "Computing Sound and Accurate Upper and Lower Bounds on Hamilton-Jacobi Reachability Value Functions", "comment": null, "summary": "Hamilton-Jacobi (HJ) reachability analysis is a fundamental tool for safety verification and control synthesis for nonlinear-control systems. Classical HJ reachability analysis methods discretize the continuous state space and solve the HJ partial differential equation over a grid, but these approaches do not account for discretization errors and can under-approximate backward reachable sets, which represent unsafe sets of states. We present a framework for computing sound upper and lower bounds on the HJ value functions via value iteration over grids. Additionally, we develop a refinement algorithm that splits cells that were not possible to classify as safe or unsafe given the computed bounds. This algorithm enables computing accurate over-approximations of backward reachable sets even when starting from coarse grids. Finally, we validate the effectiveness of our method in two case studies."}
{"id": "2511.15490", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15490", "abs": "https://arxiv.org/abs/2511.15490", "authors": ["Mohamed Siala", "Noura Sellami"], "title": "Collision Resolution in RFID Systems Using Antenna Arrays and Mix Source Separation", "comment": "4 pages, 3 figures", "summary": "In this letter, we propose an efficient mix source separation algorithm for collision resolution in radio frequency identification (RFID) systems equipped with an antenna array at the reader. We first introduce an approach that exploits the zero constant modulus (ZCM) criterion to separate colliding tags through gradient descent, without using pilot symbols. We show that the ZCM characteristic, considered alone, in the design of the objective function can lead to significant ambiguities in the determination of the beamformers used in the recovery of tag messages. To address this limitation, we propose a more sophisticated approach, relying on a hybrid objective function, incorporating a new ambiguity-raising criterion in addition to the ZCM criterion."}
{"id": "2511.14922", "categories": ["cs.LG", "stat.ME"], "pdf": "https://arxiv.org/pdf/2511.14922", "abs": "https://arxiv.org/abs/2511.14922", "authors": ["Pranay Kumar Peddi", "Dhrubajyoti Ghosh"], "title": "Integrating Causal Inference with Graph Neural Networks for Alzheimer's Disease Analysis", "comment": null, "summary": "Deep graph learning has advanced Alzheimer's (AD) disease classification from MRI, but most models remain correlational, confounding demographic and genetic factors with disease specific features. We present Causal-GCN, an interventional graph convolutional framework that integrates do-calculus-based back-door adjustment to identify brain regions exerting stable causal influence on AD progression. Each subject's MRI is represented as a structural connectome where nodes denote cortical and subcortical regions and edges encode anatomical connectivity. Confounders such as age, sec, and APOE4 genotype are summarized via principal components and included in the causal adjustment set. After training, interventions on individual regions are simulated by serving their incoming edges and altering node features to estimate average causal effects on disease probability. Applied to 484 subjects from the ADNI cohort, Causal-GCN achieves performance comparable to baseline GNNs while providing interpretable causal effect rankings that highlight posterior, cingulate, and insular hubs consistent with established AD neuropathology."}
{"id": "2511.15165", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15165", "abs": "https://arxiv.org/abs/2511.15165", "authors": ["Jingzhuo Zhou"], "title": "Can MLLMs Detect Phishing? A Comprehensive Security Benchmark Suite Focusing on Dynamic Threats and Multimodal Evaluation in Academic Environments", "comment": null, "summary": "The rapid proliferation of Multimodal Large Language Models (MLLMs) has introduced unprecedented security challenges, particularly in phishing detection within academic environments. Academic institutions and researchers are high-value targets, facing dynamic, multilingual, and context-dependent threats that leverage research backgrounds, academic collaborations, and personal information to craft highly tailored attacks. Existing security benchmarks largely rely on datasets that do not incorporate specific academic background information, making them inadequate for capturing the evolving attack patterns and human-centric vulnerability factors specific to academia. To address this gap, we present AdapT-Bench, a unified methodological framework and benchmark suite for systematically evaluating MLLM defense capabilities against dynamic phishing attacks in academic settings."}
{"id": "2511.15108", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15108", "abs": "https://arxiv.org/abs/2511.15108", "authors": ["Liujia Yao", "Changsheng You", "Chao Zhou", "Beixiong Zheng", "Weidong Mei"], "title": "Position Optimization for Two-layer Movable Antenna Systems", "comment": null, "summary": "Movable antenna (MA) is a promising technology for improving the performance of wireless communication systems by providing new degrees-of-freedom (DoFs) in antenna position optimization. However, existing works on MA systems have mostly considered element-wise single-layer MA (SL-MA) arrays, where all the MAs move within the given movable region, hence inevitably incurring high control complexity and hardware cost in practice. To address this issue, we propose in this letter a new two-layer MA array (TL-MA), where the positions of MAs are jointly determined by the large-scale movement of multiple subarrays and the small-scale fine-tuning of per-subarray MAs. In particular, an optimization problem is formulated to maximize the sum-rate of the TL-MA-aided communication system by jointly optimizing the subarray-positions, per-subarray (relative) MA positions, and receive beamforming. To solve this non-convex problem, we propose an alternating optimization (AO)-based particle swarm optimization (PSO) algorithm, which alternately optimizes the positions of subarrays and per-subarray MAs, given the optimal receive beamforming. Numerical results verify that the proposed TL-MA significantly reduces the sum-displacement of MA motors (i.e., the total moving distances of all motors) of element-wise SL-MA, while achieving comparable rate performance."}
{"id": "2511.15286", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15286", "abs": "https://arxiv.org/abs/2511.15286", "authors": ["Seongyeon Kim", "Ki-Hyun Kim", "Shenghui Cui", "Jae-Jung Jung"], "title": "Transient Stability Analysis of Grid-Forming Converters with Current Limiting Considering Asymmetrical Grid Faults", "comment": null, "summary": "Under asymmetrical faults, analyzing the transient stability of grid-forming voltage-source converters (GFM-VSCs) becomes essential because their behavior fundamentally differs from that under symmetrical faults. When current limiting is activated under asymmetrical faults, the point-of-common-coupling voltage of a GFM-VSC contains both positive- and negative-sequence components, and the interaction between these components generates a non-negligible negative-sequence-driven active power. However, the transient stability of GFM-VSCs under asymmetrical faults has not been sufficiently investigated, and the influence of negative-sequence-driven active power remains unclear. Accordingly, this letter derives the P-δ curve of a GFM-VSC with an elliptical current limiter under asymmetrical faults by explicitly accounting for negative-sequence effects. This enables a more accurate transient stability assessment when extending conventional symmetrical-fault analyses to asymmetrical conditions. The theoretical analysis is validated by the agreement between the derived P-δ curve and both simulation and experimental results."}
{"id": "2511.15523", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15523", "abs": "https://arxiv.org/abs/2511.15523", "authors": ["Noura Sellami", "Mohamed Siala"], "title": "Randomized Power Transmission with Optimized Level Selection Probabilities in Uncoordinated Uplink NOMA", "comment": "5 pages, 7 figures", "summary": "We consider uncoordinated random uplink non-orthogonal multiple access (NOMA) systems using a set of predetermined power levels. We propose to optimize the probabilities of selection of power levels in order to minimize performance metrics as block error probability (BLEP) or bit error probability (BEP). When the multiuser detection algorithm at the BS treats at most two colliding users' packets, our optimization problem is a quadratic programming problem. For more colliding users' packets, we solve the problem iteratively. Our solution is original because it applies to any multiuser detection algorithm and any set of power levels."}
{"id": "2511.14936", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2511.14936", "abs": "https://arxiv.org/abs/2511.14936", "authors": ["Mathieu Dufour", "Andrew Duncan"], "title": "How to Train Private Clinical Language Models: A Comparative Study of Privacy-Preserving Pipelines for ICD-9 Coding", "comment": "10 pages, 5 figures. Accepted to the Privacy-Preserving Machine Learning Workshop at EurIPS 2025", "summary": "Large language models trained on clinical text risk exposing sensitive patient information, yet differential privacy (DP) methods often severely degrade the diagnostic accuracy needed for deployment. Despite rapid progress in DP optimisation and text generation, it remains unclear which privacy-preserving strategy actually works best for clinical language tasks. We present the first systematic head-to-head comparison of four training pipelines for automated diagnostic coding from hospital discharge summaries. All pipelines use identical 1B-parameter models and matched privacy budgets to predict ICD-9 codes. At moderate and relaxed privacy budgets ($\\varepsilon \\in \\{4, 6\\}$), knowledge distillation from DP-trained teachers outperforms both direct DP-SGD and DP-synthetic data training, recovering up to 63\\% of the non-private performance whilst maintaining strong empirical privacy (membership-inference AUC $\\approx$ 0.5). These findings expose large differences in the privacy-utility trade-off across architectures and identify knowledge distillation as the most practical route to privacy-preserving clinical NLP."}
{"id": "2511.15203", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15203", "abs": "https://arxiv.org/abs/2511.15203", "authors": ["Zimo Ji", "Xunguang Wang", "Zongjie Li", "Pingchuan Ma", "Yudong Gao", "Daoyuan Wu", "Xincheng Yan", "Tian Tian", "Shuai Wang"], "title": "Taxonomy, Evaluation and Exploitation of IPI-Centric LLM Agent Defense Frameworks", "comment": null, "summary": "Large Language Model (LLM)-based agents with function-calling capabilities are increasingly deployed, but remain vulnerable to Indirect Prompt Injection (IPI) attacks that hijack their tool calls. In response, numerous IPI-centric defense frameworks have emerged. However, these defenses are fragmented, lacking a unified taxonomy and comprehensive evaluation. In this Systematization of Knowledge (SoK), we present the first comprehensive analysis of IPI-centric defense frameworks. We introduce a comprehensive taxonomy of these defenses, classifying them along five dimensions. We then thoroughly assess the security and usability of representative defense frameworks. Through analysis of defensive failures in the assessment, we identify six root causes of defense circumvention. Based on these findings, we design three novel adaptive attacks that significantly improve attack success rates targeting specific frameworks, demonstrating the severity of the flaws in these defenses. Our paper provides a foundation and critical insights for the future development of more secure and usable IPI-centric agent defense frameworks."}
{"id": "2511.15162", "categories": ["eess.SP", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15162", "abs": "https://arxiv.org/abs/2511.15162", "authors": ["Ahmed Aboulfotouh", "Hatem Abou-Zeid"], "title": "Multimodal Wireless Foundation Models", "comment": null, "summary": "Wireless foundation models (WFMs) have recently demonstrated promising capabilities, jointly performing multiple wireless functions and adapting effectively to new environments. However, while current WFMs process only one modality, depending on the task and operating conditions, the most informative modality changes and no single modality is best for all tasks. WFMs should therefore be designed to accept multiple modalities to enable a broader and more diverse range of tasks and scenarios. In this work, we propose and build the first multimodal wireless foundation model capable of processing both raw IQ streams and image-like wireless modalities (e.g., spectrograms and CSI) and performing multiple tasks across both. We introduce masked wireless modeling for the multimodal setting, a self-supervised objective and pretraining recipe that learns a joint representation from IQ streams and image-like wireless modalities. We evaluate the model on five tasks across both modality families: image-based (human activity sensing, RF signal classification, 5G NR positioning) and IQ-based (RF device fingerprinting, interference detection/classification). The multimodal WFM is competitive with single-modality WFMs, and in several cases surpasses their performance. Our results demonstrates the strong potential of developing multimodal WFMs that support diverse wireless tasks across different modalities. We believe this provides a concrete step toward both AI-native 6G and the vision of joint sensing, communication, and localization."}
{"id": "2511.15318", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15318", "abs": "https://arxiv.org/abs/2511.15318", "authors": ["Plouton Grammatikos", "Ali Mohamed Ali", "Fabrizio Sossan"], "title": "Formulation and Experimental Validation of Price-Based Control of Flexible Prosumers in Distribution Grids with the Alternating Direction Method of Multipliers", "comment": null, "summary": "This paper describes a method for computing price signals for prosumers, incentivizing them to adjust their consumption according to the constraints of the distribution grids to which they are connected, thereby preventing voltage violations and line congestion. The proposed method leverages an interpretation of the Alternating Direction Method of Multipliers (ADMM), which enables the extraction of a price signal to coordinate the operations of prosumers and the distribution grid's constraints while limiting the sharing of sensitive information among them. The method can be used by Distribution System Operators (DSOs) to dynamically adjust a pre-existing retail electricity tariff (e.g., a constant or time-of-use tariff), thereby triggering grid-support actions from prosumers. The method is validated experimentally in a 9-node low-voltage distribution grid laboratory with real components (lines and controllable power converters). The experiments validate the algorithm's performance in terms of convergence and operational efficiency, demonstrating its viability in a real-life setting."}
{"id": "2511.14961", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2511.14961", "abs": "https://arxiv.org/abs/2511.14961", "authors": ["Artur A. Oliveira", "Mateus Espadoto", "Roberto M. Cesar", "Roberto Hirata"], "title": "Knowledge Graphs as Structured Memory for Embedding Spaces: From Training Clusters to Explainable Inference", "comment": "Submitted to GRIVAPP 2026 (21st International Conference on Computer Graphics, Interaction, Visualization Theory and Applications), Marbella, Spain, March 9-11 2026", "summary": "We introduce Graph Memory (GM), a structured non-parametric framework that augments embedding-based inference with a compact, relational memory over region-level prototypes. Rather than treating each training instance in isolation, GM summarizes the embedding space into prototype nodes annotated with reliability indicators and connected by edges that encode geometric and contextual relations. This design unifies instance retrieval, prototype-based reasoning, and graph-based label propagation within a single inductive model that supports both efficient inference and faithful explanation. Experiments on synthetic and real datasets including breast histopathology (IDC) show that GM achieves accuracy competitive with $k$NN and Label Spreading while offering substantially better calibration and smoother decision boundaries, all with an order of magnitude fewer samples. By explicitly modeling reliability and relational structure, GM provides a principled bridge between local evidence and global consistency in non-parametric learning."}
{"id": "2511.15206", "categories": ["cs.CR", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15206", "abs": "https://arxiv.org/abs/2511.15206", "authors": ["Bui Duc Son", "Trinh Van Chien", "Dong In Kim"], "title": "Trustworthy GenAI over 6G: Integrated Applications and Security Frameworks", "comment": "8 pages, 5 figures. Submitted for publication", "summary": "The integration of generative artificial intelligence (GenAI) into 6G networks promises substantial performance gains while simultaneously exposing novel security vulnerabilities rooted in multimodal data processing and autonomous reasoning. This article presents a unified perspective on cross-domain vulnerabilities that arise across integrated sensing and communication (ISAC), federated learning (FL), digital twins (DTs), diffusion models (DMs), and large telecommunication models (LTMs). We highlight emerging adversarial agents such as compromised DTs and LTMs that can manipulate both the physical and cognitive layers of 6G systems. To address these risks, we propose an adaptive evolutionary defense (AED) concept that continuously co-evolves with attacks through GenAI-driven simulation and feedback, combining physical-layer protection, secure learning pipelines, and cognitive-layer resilience. A case study using an LLM-based port prediction model for fluid-antenna systems demonstrates the susceptibility of GenAI modules to adversarial perturbations and the effectiveness of the proposed defense concept. Finally, we summarize open challenges and future research directions toward building trustworthy, quantum-resilient, and adaptive GenAI-enabled 6G networks."}
{"id": "2511.15184", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15184", "abs": "https://arxiv.org/abs/2511.15184", "authors": ["Akram Shafie", "Jun Tong", "Jinhong Yuan", "Taka Sakurai", "Paul Fitzpatrick", "Yuting Fang", "Yixuan Xie"], "title": "Spectrum and Orthogonality of Orthogonal Delay-Doppler Division Multiplexing Modulation Waveforms", "comment": "This paper has been accepted for publication in an IEEE Journal", "summary": "Orthogonal delay-Doppler (DD) division multiplexing (ODDM) modulation has recently emerged as a promising paradigm for ensuring reliable communications in doubly-selective channels. This work investigates the spectra and orthogonality characteristics of analog (direct) and approximate digital implementations of ODDM systems. We first determine the time and frequency domain representations of the basis functions for waveform in analog and approximate digital ODDM systems. Thereafter, we derive their power spectral densities and show that while the spectrum of analog ODDM waveforms exhibits a step-wise behavior in its transition regions, the spectrum of approximate digital ODDM waveforms is confined to that of the ODDM sub-pulse. Next, we prove the orthogonality characteristics of approximate digital ODDM waveforms and show that, unlike analog ODDM waveforms, the approximate digital ODDM waveforms satisfy orthogonality without the need of additional time domain resources. Additionally, we examine the similarities and differences that implementations of approximate digital ODDM share with the other variants of DD modulations, focusing on the domain changes the symbols undergo, the type of pulse shaping and windowing used, and the domains and the sequence in which they are performed. Finally, we present numerical results to validate our findings and draw further insights."}
{"id": "2511.15321", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15321", "abs": "https://arxiv.org/abs/2511.15321", "authors": ["Vishal Kachhad", "Amit Joshi", "Luigi Glielmo"], "title": "Techno-Economic Modelling and Component Sizing in Renewable Energy Communities: A Participant Perspective", "comment": null, "summary": "This article proposes an optimization problem formulation to find the optimal sizes of Photovoltaics (PV) and Battery Energy Storage Systems (BESS) for individual participants within the context of the Renewable Energy Community (REC). An optimization problem considered the dynamic nature of electricity pricing, solar irradiation levels, financial aspects such as capital investment, and operational and maintenance expenditures of PV and BESS. The analysis also considered replacement costs and the efficiency of charging and discharging the BESS unit. We employed Mixed-Integer Non-Linear Programming (MINLP) to determine the optimal system size that maximizes the Net Present Value (NPV) of individual participants. Furthermore, in this study, we used daily representative signals for each season of the year to reduce simulation runtime. The Fast Iterative Shrinkage-Thresholding Algorithm (FISTA) was used to extract these signals. Then, these representative signals obtained were used in the optimization problem formulation to reduce simulation time and extend our analysis to a wider planning horizon. In addition, the study introduced fairness by applying the individual marginal contribution method to distribute incentives equitably among REC participants, ensuring that each member benefited from their contribution. A simulation study was conducted using a real demand dataset of five houses located in Roseto Valfortore, a small town and commune in the Foggia Province of the Apulia region in southern Italy, to demonstrate the practical relevance and usefulness of the ideas discussed. Ultimately, the goal of the article was to empower the REC with the knowledge necessary to make informed decisions and shape the future of sustainable energy."}
{"id": "2511.15004", "categories": ["cs.LG", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.15004", "abs": "https://arxiv.org/abs/2511.15004", "authors": ["Halil S. Kelebek", "Linnea M. Wolniewicz", "Michael D. Vergalla", "Simone Mestici", "Giacomo Acciarini", "Bala Poduval", "Olga Verkhoglyadova", "Madhulika Guhathakurta", "Thomas E. Berger", "Frank Soboczenski", "Atılım Güneş Baydin"], "title": "IonCast: A Deep Learning Framework for Forecasting Ionospheric Dynamics", "comment": "11 pages, 7 figures, 3 tables. Accepted as a poster presentation at the Machine Learning for the Physical Sciences Workshop at NeurIPS 2025", "summary": "The ionosphere is a critical component of near-Earth space, shaping GNSS accuracy, high-frequency communications, and aviation operations. For these reasons, accurate forecasting and modeling of ionospheric variability has become increasingly relevant. To address this gap, we present IonCast, a suite of deep learning models that include a GraphCast-inspired model tailored for ionospheric dynamics. IonCast leverages spatiotemporal learning to forecast global Total Electron Content (TEC), integrating diverse physical drivers and observational datasets. Validating on held-out storm-time and quiet conditions highlights improved skill compared to persistence. By unifying heterogeneous data with scalable graph-based spatiotemporal learning, IonCast demonstrates how machine learning can augment physical understanding of ionospheric variability and advance operational space weather resilience."}
{"id": "2511.15278", "categories": ["cs.CR", "cs.DC", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15278", "abs": "https://arxiv.org/abs/2511.15278", "authors": ["Nilesh Vyas", "Benjamin Zhao", "Aygün Baltaci", "Gustavo de Carvalho Bertoli", "Hassan Asghar", "Markus Klügel", "Gerrit Schramm", "Martin Kubisch", "Dali Kaafar"], "title": "Privacy-Preserving IoT in Connected Aircraft Cabin", "comment": "8 pages, 2 figures. Under review", "summary": "The proliferation of IoT devices in shared, multi-vendor environments like the modern aircraft cabin creates a fundamental conflict between the promise of data collaboration and the risks to passenger privacy, vendor intellectual property (IP), and regulatory compliance. While emerging standards like the Cabin Secure Media-Independent Messaging (CSMIM) protocol provide a secure communication backbone, they do not resolve data governance challenges at the application layer, leaving a privacy gap that impedes trust. This paper proposes and evaluates a framework that closes this gap by integrating a configurable layer of Privacy-Enhancing Technologies (PETs) atop a CSMIM-like architecture. We conduct a rigorous, empirical analysis of two pragmatic PETs: Differential Privacy (DP) for statistical sharing, and an additive secret sharing scheme (ASS) for data obfuscation. Using a high-fidelity testbed with resource-constrained hardware, we quantify the trade-offs between data privacy, utility, and computing performance. Our results demonstrate that the computational overhead of PETs is often negligible compared to inherent network and protocol latencies. We prove that architectural choices, such as on-device versus virtualized processing, have a far greater impact on end-to-end latency and computational performance than the PETs themselves. The findings provide a practical roadmap for system architects to select and configure appropriate PETs, enabling the design of trustworthy collaborative IoT ecosystems in avionics and other critical domains."}
{"id": "2511.15187", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15187", "abs": "https://arxiv.org/abs/2511.15187", "authors": ["Evan Frenklak", "Yamin Arefeen", "Jonathan I Tamir"], "title": "Theoretical Bounds on Parallel Imaging Implicit Data Crimes in an MRI Reproducing Kernel Hilbert Space", "comment": null, "summary": "Magnetic Resonance Imaging (MRI) diagnoses and manages a wide range of diseases, yet long scan times drive high costs and limit accessibility. AI methods have demonstrated substantial potential for reducing scan times, but despite rapid progress, clinical translation of AI often fails. One particular class of failure modes, referred to as implicit data crimes, are a result of hidden biases introduced when MRI datasets incompletely model the MRI physics of the acquisition. Previous work identified data crimes resulting from algorithmic completion of k-space with parallel imaging and drew on simulation to demonstrate the resulting downstream biases. This work proposes a mathematical framework to re-characterize the problem as one of error reduction during interpolation between sets of evaluation coordinates. We establish a generalized matrix-based definition of the reconstruction error upper bound as a function of the input sampling pattern. Experiments on relevant sampling pattern structures demonstrate the relevance of the framework and suggest future directions for analysis of data crimes."}
{"id": "2511.15477", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15477", "abs": "https://arxiv.org/abs/2511.15477", "authors": ["Alessandro Cecconi", "Michelangelo Bin", "Lorenzo Marconi", "Rodolphe Sepulchre"], "title": "On the Contraction of Excitable Systems", "comment": null, "summary": "We analyze contraction in conductance-based excitable systems and link it to reliable spike timing. For a Hodgkin-Huxley neuron with synaptic input, we prove the unforced dynamics is incrementally exponentially stable on a compact physiological set. With impulsive inputs, contraction persists under an average dwell-time condition, and for periodic spike trains we derive an explicit lower bound on the inter-impulse period. In the high-rate limit the synapse is effectively held open, the conductance is nearly constant, and self-sustained limit-cycle oscillations can arise, so contraction no longer holds. This continuous-time view explains when spike times extracted by an event detector remain robust across trials, and simulations confirm both regimes."}
{"id": "2511.15032", "categories": ["cs.LG", "cs.AI", "cs.HC"], "pdf": "https://arxiv.org/pdf/2511.15032", "abs": "https://arxiv.org/abs/2511.15032", "authors": ["Jeffrey Jiang", "Kevin Hong", "Emily Kuczynski", "Gregory Pottie"], "title": "Simulated Human Learning in a Dynamic, Partially-Observed, Time-Series Environment", "comment": "Manuscript in preparation for IEEE Transactions on Education, 20 pages, 6 figures, 5 tables", "summary": "While intelligent tutoring systems (ITSs) can use information from past students to personalize instruction, each new student is unique. Moreover, the education problem is inherently difficult because the learning process is only partially observable. We therefore develop a dynamic, time-series environment to simulate a classroom setting, with student-teacher interventions - including tutoring sessions, lectures, and exams. In particular, we design the simulated environment to allow for varying levels of probing interventions that can gather more information. Then, we develop reinforcement learning ITSs that combine learning the individual state of students while pulling from population information through the use of probing interventions. These interventions can reduce the difficulty of student estimation, but also introduce a cost-benefit decision to find a balance between probing enough to get accurate estimates and probing so often that it becomes disruptive to the student. We compare the efficacy of standard RL algorithms with several greedy rules-based heuristic approaches to find that they provide different solutions, but with similar results. We also highlight the difficulty of the problem with increasing levels of hidden information, and the boost that we get if we allow for probing interventions. We show the flexibility of both heuristic and RL policies with regards to changing student population distributions, finding that both are flexible, but RL policies struggle to help harder classes. Finally, we test different course structures with non-probing policies and we find that our policies are able to boost the performance of quiz and midterm structures more than we can in a finals-only structure, highlighting the benefit of having additional information."}
{"id": "2511.15434", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15434", "abs": "https://arxiv.org/abs/2511.15434", "authors": ["Georg Goldenits", "Philip Koenig", "Sebastian Raubitzek", "Andreas Ekelhart"], "title": "Small Language Models for Phishing Website Detection: Cost, Performance, and Privacy Trade-Offs", "comment": null, "summary": "Phishing websites pose a major cybersecurity threat, exploiting unsuspecting users and causing significant financial and organisational harm. Traditional machine learning approaches for phishing detection often require extensive feature engineering, continuous retraining, and costly infrastructure maintenance. At the same time, proprietary large language models (LLMs) have demonstrated strong performance in phishing-related classification tasks, but their operational costs and reliance on external providers limit their practical adoption in many business environments. This paper investigates the feasibility of small language models (SLMs) for detecting phishing websites using only their raw HTML code. A key advantage of these models is that they can be deployed on local infrastructure, providing organisations with greater control over data and operations. We systematically evaluate 15 commonly used Small Language Models (SLMs), ranging from 1 billion to 70 billion parameters, benchmarking their classification accuracy, computational requirements, and cost-efficiency. Our results highlight the trade-offs between detection performance and resource consumption, demonstrating that while SLMs underperform compared to state-of-the-art proprietary LLMs, they can still provide a viable and scalable alternative to external LLM services. By presenting a comparative analysis of costs and benefits, this work lays the foundation for future research on the adaptation, fine-tuning, and deployment of SLMs in phishing detection systems, aiming to balance security effectiveness and economic practicality."}
{"id": "2511.15198", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15198", "abs": "https://arxiv.org/abs/2511.15198", "authors": ["Henglin Pu", "Xuefeng Wang", "Lu Su", "Husheng Li"], "title": "Space-Time-Frequency Synthetic Integrated Sensing and Communication Networks", "comment": null, "summary": "Integrated sensing and communication (ISAC) promises high spectral and power efficiencies by sharing waveforms, spectrum, and hardware across sensing and data links. Yet commercial cellular networks struggle to deliver fine angular, range, and Doppler resolution due to limited aperture, bandwidth, and coherent observation time. In this paper, we propose a space-time-frequency synthetic ISAC architecture that fuses observations from distributed transmitters and receivers across time intervals and frequency bands. We develop a unified signal model for multistatic and monostatic configurations, derive Cramer-Rao lower bounds (CRLBs) for the estimations of position and velocity. The analysis shows how spatial diversity, multiband operation, and observation scheduling impact the Fisher information. We also compare the estimation performance between a concentrated maximum likelihood estimator (MLE) and a two stage information fusion (TSIF) method that first estimates per-path delay and radial speed and then fuses them by solving a weighted nonlinear least-squares problem via the Gauss-Newton algorithm. Numerical results show that MLE approaches the CRLB in the high signal-to-noise ratio (SNR) regime, while the two stage method remains competitive at moderate to high SNR but degrades at low SNR. A central finding is that fully synthesized network processing is essential, as estimations by individual base stations (BSs) followed by fusion are consistently inferior and unstable at low SNR. This framework offers a practical guidance for upgrading existing communication infrastructure into dense sensing networks."}
{"id": "2511.15480", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15480", "abs": "https://arxiv.org/abs/2511.15480", "authors": ["Ervan Kassarian", "Francesco Sanfedino", "Daniel Alazard", "Andrea Marrazza"], "title": "Robust H-infinity control and worst-case search in constrained parametric space", "comment": "Preprint", "summary": "Standard H-infinity/H2 robust control and analysis tools operate on uncertain parameters assumed to vary independently within prescribed bounds. This paper extends their capabilities in the presence of constraints coupling these parameters and restricting the parametric space. Focusing on the worst-case search, we demonstrate -- based on the theory of upper-C1 functions -- the validity of using standard, readily available smooth optimization algorithms to address this nonsmooth constrained optimization problem. Accordingly, we propose to explore the parametric space with either Monte-Carlo sampling or particle swarm optimization, and to subsequently perform local exploitation with Sequential Quadratic Programming to compute Karush-Kuhn-Tucker points. This worst-case search then enables robust controller synthesis: as in the state-of-art algorithm for standard robust control, identified worst-case configurations are iteratively added to an active set on which a non-smooth multi-models optimization of the controller is performed. The methodology is illustrated on a satellite benchmark with flexible appendages, of order 50 with 43 uncertain parameters. We show that the proposed method largely outperforms Monte-Carlo sampling alone, is able to reliably detect even rare worst-case configurations in minutes on a standard laptop, and that the robust controller optimization converges with less than 10 active configurations. Even in the unconstrained case, the proposed framework complements traditional methods, as it scales to plants with many parameters and states and explores the entire parametric space, albeit without formal guarantees of global optimality."}
{"id": "2511.15048", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15048", "abs": "https://arxiv.org/abs/2511.15048", "authors": ["Zachariah Farahany", "Jiawei Wu", "K M Sajjadul Islam", "Praveen Madiraju"], "title": "Oversampling techniques for predicting COVID-19 patient length of stay", "comment": "10 pages, 2022 IEEE International Conference on Big Data (Big Data)", "summary": "COVID-19 is a respiratory disease that caused a global pandemic in 2019. It is highly infectious and has the following symptoms: fever or chills, cough, shortness of breath, fatigue, muscle or body aches, headache, the new loss of taste or smell, sore throat, congestion or runny nose, nausea or vomiting, and diarrhea. These symptoms vary in severity; some people with many risk factors have been known to have lengthy hospital stays or die from the disease. In this paper, we analyze patients' electronic health records (EHR) to predict the severity of their COVID-19 infection using the length of stay (LOS) as our measurement of severity. This is an imbalanced classification problem, as many people have a shorter LOS rather than a longer one. To combat this problem, we synthetically create alternate oversampled training data sets. Once we have this oversampled data, we run it through an Artificial Neural Network (ANN), which during training has its hyperparameters tuned using Bayesian optimization. We select the model with the best F1 score and then evaluate it and discuss it."}
{"id": "2511.15463", "categories": ["cs.CR", "cs.CE"], "pdf": "https://arxiv.org/pdf/2511.15463", "abs": "https://arxiv.org/abs/2511.15463", "authors": ["Minh Trung Tran", "Nasrin Sohrabi", "Zahir Tari", "Qin Wang"], "title": "How To Cook The Fragmented Rug Pull?", "comment": null, "summary": "Existing rug pull detectors assume a simple workflow: the deployer keeps liquidity pool (LP) tokens and performs one or a few large sells (within a day) that collapse the pool and cash out. In practice, however, many real-world exits violate these assumptions by splitting the attack across both time and actor dimensions: attackers break total extraction into many low-impact trades and route proceeds through multiple non-owner addresses, producing low-visibility drains.\n  We formalize this family of attacks as the fragmented rug pull (FRP) and offer a compact recipe for a slow-stewed beef special: (i) keep the lid on (to preserve LP control so on-chain extraction remains feasible), (ii) chop thin slices (to split the total exit volume into many low-impact micro-trades that individually fall below impact thresholds), and (iii) pass the ladle (to delegate sells across multiple wallets so that each participant takes a small share of the extraction). Technically, we define three atomic predicate groups and show that their orthogonal combinations yield evasive strategies overlooked by prior heuristics (USENIX Sec 19, USENIX Sec 23).\n  We validate the model with large-scale measurements. Our corpus contains 303,614 LPs, among which 105,434 are labeled as FRP pools. The labeled subset includes 34,192,767 pool-related transactions and 401,838 inflated-seller wallets, involving 1,501,408 unique interacting addresses. Notably, owner-wallet participation in inflated selling among FRP-flagged LPs has declined substantially (33.1% of cases), indicating a shift in scam behavior: the liquidity drain is no longer held on the owner wallet. We also detected 127,252 wallets acting as serial scammers when repeatedly engaging in inflated selling across multiple FRP LPs. Our empirical findings demonstrate that the evasive strategies we define are widespread and operationally significant."}
{"id": "2511.15221", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15221", "abs": "https://arxiv.org/abs/2511.15221", "authors": ["Yongchao He", "Taihao Zhang", "Cunhua Pan", "Hong Ren", "Xianzhe Chen", "Tian Qiu", "Bingchang Hua", "Jiangzhou Wang"], "title": "Theoretical and Empirical Study of Spatial Power Focusing Effect for Sparse Arrays at Terahertz Band", "comment": "5 pages, 7 figures", "summary": "This work investigates the spatial power focusing effect for large-scale sparse arrays at terahertz (THz) band, combining theoretical analysis with experimental validation. Specifically, based on a Green's function channel model, we analyze the power distribution along the $z$-axis, deriving a closed-form expression to characterize the focusing effect. Furthermore, the factors influencing the focusing effect, including phase noise and positional deviations, are theoretically analyzed and numerically simulated. Finally, a 300 GHz measurement platform based on a vector network analyzer (VNA) is constructed for experimental validation. The measurement results demonstrate close consistence with theoretical simulation results, confirming the spatial power focusing effect for sparse arrays."}
{"id": "2511.15062", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15062", "abs": "https://arxiv.org/abs/2511.15062", "authors": ["Yun Kwan Kim"], "title": "Interpretable temporal fusion network of multi- and multi-class arrhythmia classification", "comment": "[Doctoral dissertation, Korea University, 2025]", "summary": "Clinical decision support systems (CDSSs) have been widely utilized to support the decisions made by cardiologists when detecting and classifying arrhythmia from electrocardiograms. However, forming a CDSS for the arrhythmia classification task is challenging due to the varying lengths of arrhythmias. Although the onset time of arrhythmia varies, previously developed methods have not considered such conditions. Thus, we propose a framework that consists of (i) local and global extraction and (ii) local-global information fusion with attention to enable arrhythmia detection and classification within a constrained input length. The framework's performance was evaluated in terms of 10-class and 4-class arrhythmia detection, focusing on identifying the onset and ending point of arrhythmia episodes and their duration using the MIT-BIH arrhythmia database (MITDB) and the MIT-BIH atrial fibrillation database (AFDB). Duration, episode, and Dice score performances resulted in overall F1-scores of 96.45%, 82.05%, and 96.31% on the MITDB and 97.57%, 98.31%, and 97.45% on the AFDB, respectively. The results demonstrated statistically superior performance compared to those of the benchmark models. To assess the generalization capability of the proposed method, an MITDB-trained model and MIT-BIH malignant ventricular arrhythmia database-trained model were tested AFDB and MITDB, respectively. Superior performance was attained compared with that of a state-of-the-art model. The proposed method effectively captures both local and global information and dynamics without significant information loss. Consequently, arrhythmias can be detected with greater accuracy, and their occurrence times can be precisely determined, enabling the clinical field to develop more accurate treatment plans based on the proposed method."}
{"id": "2511.15479", "categories": ["cs.CR", "cs.DC", "cs.LO"], "pdf": "https://arxiv.org/pdf/2511.15479", "abs": "https://arxiv.org/abs/2511.15479", "authors": ["Martin Slind Hagen", "Emil Lundqvist", "Alex Phu", "Yenan Wang", "Kim Strandberg", "Elad Michael Schiller"], "title": "Towards a Formal Verification of Secure Vehicle Software Updates", "comment": "This technical report is a preprint of the article accepted for publication in Computer & Security 2025", "summary": "With the rise of software-defined vehicles (SDVs), where software governs most vehicle functions alongside enhanced connectivity, the need for secure software updates has become increasingly critical. Software vulnerabilities can severely impact safety, the economy, and society. In response to this challenge, Strandberg et al. [escar Europe, 2021] introduced the Unified Software Update Framework (UniSUF), designed to provide a secure update framework that integrates seamlessly with existing vehicular infrastructures.\n  Although UniSUF has previously been evaluated regarding cybersecurity, these assessments have not employed formal verification methods. To bridge this gap, we perform a formal security analysis of UniSUF. We model UniSUF's architecture and assumptions to reflect real-world automotive systems and develop a ProVerif-based framework that formally verifies UniSUF's compliance with essential security requirements - confidentiality, integrity, authenticity, freshness, order, and liveness - demonstrating their satisfiability through symbolic execution. Our results demonstrate that UniSUF adheres to the specified security guarantees, ensuring the correctness and reliability of its security framework."}
{"id": "2511.15412", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15412", "abs": "https://arxiv.org/abs/2511.15412", "authors": ["Evgenii Vinogradov", "Aymen Fakhreddine", "Abdul Saboor", "Sergi Abadal", "Sofie Pollin"], "title": "Spatially Consistent Air-to-Ground Channel Modeling and Simulation via 3D Shadow Projections", "comment": "International Conference on Computing, Networking and Communications (ICNC 2026)", "summary": "We present an approach for spatially-consistent semi-deterministic Air-to-Ground (A2G) channel modeling in Unmanned Aerial Vehicle-assisted networks. We use efficient 3D building shadow projections to determine Line-of-Sight (LOS) regions, enabling fast generation of LOS maps. By integrating LOS-aware deterministic path loss with stochastic shadow fading, the approach produces spatially consistent A2G radio maps suitable for environment- and mobility-aware channel evaluation and performance prediction. Simulation results in ITU-compliant Manhattan grid environments demonstrate the model's ability to reflect key urban propagation characteristics, such as LOS blockage patterns and outage behavior. The proposed approach provides an efficient alternative to ray tracing or fully stochastic models, with particular relevance for user mobility, link planning, and radio map generation in 6G non-terrestrial networks."}
{"id": "2511.15067", "categories": ["cs.LG", "cs.AI", "cs.CV", "q-bio.GN"], "pdf": "https://arxiv.org/pdf/2511.15067", "abs": "https://arxiv.org/abs/2511.15067", "authors": ["Zisong Wang", "Xuanyu Wang", "Hang Chen", "Haizhou Wang", "Yuxin Chen", "Yihang Xu", "Yunhe Yuan", "Lihuan Luo", "Xitong Ling", "Xiaoping Liu"], "title": "Deep Pathomic Learning Defines Prognostic Subtypes and Molecular Drivers in Colorectal Cancer", "comment": null, "summary": "Precise prognostic stratification of colorectal cancer (CRC) remains a major clinical challenge due to its high heterogeneity. The conventional TNM staging system is inadequate for personalized medicine. We aimed to develop and validate a novel multiple instance learning model TDAM-CRC using histopathological whole-slide images for accurate prognostic prediction and to uncover its underlying molecular mechanisms. We trained the model on the TCGA discovery cohort (n=581), validated it in an independent external cohort (n=1031), and further we integrated multi-omics data to improve model interpretability and identify novel prognostic biomarkers. The results demonstrated that the TDAM-CRC achieved robust risk stratification in both cohorts. Its predictive performance significantly outperformed the conventional clinical staging system and multiple state-of-the-art models. The TDAM-CRC risk score was confirmed as an independent prognostic factor in multivariable analysis. Multi-omics analysis revealed that the high-risk subtype is closely associated with metabolic reprogramming and an immunosuppressive tumor microenvironment. Through interaction network analysis, we identified and validated Mitochondrial Ribosomal Protein L37 (MRPL37) as a key hub gene linking deep pathomic features to clinical prognosis. We found that high expression of MRPL37, driven by promoter hypomethylation, serves as an independent biomarker of favorable prognosis. Finally, we constructed a nomogram incorporating the TDAM-CRC risk score and clinical factors to provide a precise and interpretable clinical decision-making tool for CRC patients. Our AI-driven pathological model TDAM-CRC provides a robust tool for improved CRC risk stratification, reveals new molecular targets, and facilitates personalized clinical decision-making."}
{"id": "2511.15517", "categories": ["cs.CR", "cs.DC"], "pdf": "https://arxiv.org/pdf/2511.15517", "abs": "https://arxiv.org/abs/2511.15517", "authors": ["Tasos Kichidis", "Lefteris Kokoris-Kogias", "Arun Koshy", "Ilya Sergey", "Alberto Sonnino", "Mingwei Tian", "Jianting Zhang"], "title": "Beluga: Block Synchronization for BFT Consensus Protocols", "comment": null, "summary": "Modern high-throughput BFT consensus protocols use streamlined push-pull mechanisms to disseminate blocks and keep happy-path performance optimal. Yet state-of-the-art designs lack a principled and efficient way to exchange blocks, which leaves them open to targeted attacks and performance collapse under network asynchrony. This work introduces the concept of a block synchronizer, a simple abstraction that drives incremental block retrieval and enforces resource-aware exchange. Its interface and role fit cleanly inside a modern BFT consensus stack. We also uncover a new attack, where an adversary steers honest validators into redundant, uncoordinated pulls that exhaust bandwidth and stall progress. Beluga is a modular and scarcity-aware instantiation of the block synchronizer. It achieves optimal common-case latency while bounding the cost of recovery under faults and adversarial behavior. We integrate Beluga into Mysticeti, the consensus core of the Sui blockchain, and show on a geo-distributed AWS deployment that Beluga sustains optimal performance in the optimistic path and, under attack, delivers up to 3x higher throughput and 25x lower latency than prior designs. The Sui blockchain adopted Beluga in production."}
{"id": "2511.15416", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15416", "abs": "https://arxiv.org/abs/2511.15416", "authors": ["Davide Tornielli Bellini", "Dario Tagliaferri", "Pietro Grassi", "Davide Scazzoli", "Stefano Tebaldini", "Umberto Spagnolini"], "title": "Enabling NLOS Imaging Capabilities at the Initial Access of 6G Base Stations", "comment": "15 pages (including supplementary material)", "summary": "Sensing in non-line-of-sight (NLOS) is one of the major challenges for integrated sensing and communication systems. Existing countermeasures for NLOS either use prior knowledge on the environment to characterize all the multiple bounces or deploy anomalous reflectors in the environment to enable communication infrastructure to ''\\textit{see behind the corner}''. This work addresses the integration of monostatic NLOS imaging functionalities into the initial access (IA) procedure of a next generation base station (BS), by means of a non-reconfigurable modular reflector. During standard-compliant IA, the BS sweeps a narrow beam using a pre-defined dedicated codebook to achieve the beam alignment with users. We introduce the imaging functionality by enhancing such codebook with imaging-specific entries that are jointly designed with the angular configuration of the modular reflector to enable high-resolution imaging of a region in NLOS by \\textit{coherently} processing all the echoes at the BS. We derive closed-form expressions for the near-field (NF) spatial resolution, as well as for the \\textit{effective aperture} (i.e., the portion of the reflector that actively contributes to improve image resolution). The problem of imaging of moving targets in NLOS is also addressed, and we propose a maximum-likelihood estimation for target's velocity in NF and related theoretical bound. Further, we discuss and quantify the inherent communication-imaging performance trade-offs and related system design challenges through numerical simulations. Finally, the proposed imaging method employing modular reflectors is validated both numerically and experimentally, showing the effectiveness of our concept."}
{"id": "2511.15083", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15083", "abs": "https://arxiv.org/abs/2511.15083", "authors": ["Xiancheng Wang", "Lin Wang", "Rui Wang", "Zhibo Zhang", "Minghang Zhao"], "title": "Fourier-KAN-Mamba: A Novel State-Space Equation Approach for Time-Series Anomaly Detection", "comment": null, "summary": "Time-series anomaly detection plays a critical role in numerous real-world applications, including industrial monitoring and fault diagnosis. Recently, Mamba-based state-space models have shown remarkable efficiency in long-sequence modeling. However, directly applying Mamba to anomaly detection tasks still faces challenges in capturing complex temporal patterns and nonlinear dynamics. In this paper, we propose Fourier-KAN-Mamba, a novel hybrid architecture that integrates Fourier layer, Kolmogorov-Arnold Networks (KAN), and Mamba selective state-space model. The Fourier layer extracts multi-scale frequency features, KAN enhances nonlinear representation capability, and a temporal gating control mechanism further improves the model's ability to distinguish normal and anomalous patterns. Extensive experiments on MSL, SMAP, and SWaT datasets demonstrate that our method significantly outperforms existing state-of-the-art approaches.\n  Keywords: time-series anomaly detection, state-space model, Mamba, Fourier transform, Kolmogorov-Arnold Network"}
{"id": "2511.15051", "categories": ["cs.IT", "cs.CR"], "pdf": "https://arxiv.org/pdf/2511.15051", "abs": "https://arxiv.org/abs/2511.15051", "authors": ["Pengcheng Su", "Haibo Cheng", "Ping Wang"], "title": "Mutual Information Bounds in the Shuffle Model", "comment": null, "summary": "The shuffle model enhances privacy by anonymizing users' reports through random permutation. This paper presents the first systematic study of the single-message shuffle model from an information-theoretic perspective. We analyze two regimes: the shuffle-only setting, where each user directly submits its message ($Y_i=X_i$), and the shuffle-DP setting, where each user first applies a local $\\varepsilon_0$-differentially private mechanism before shuffling ($Y_i=\\mathcal{R}(X_i)$). Let $\\boldsymbol{Z} = (Y_{σ(i)})_i$ denote the shuffled sequence produced by a uniformly random permutation $σ$, and let $K = σ^{-1}(1)$ represent the position of user 1's message after shuffling.\n  For the shuffle-only setting, we focus on a tractable yet expressive \\emph{basic configuration}, where the target user's message follows $Y_1 \\sim P$ and the remaining users' messages are i.i.d.\\ samples from $Q$, i.e., $Y_2,\\dots,Y_n \\sim Q$. We derive asymptotic expressions for the mutual information quantities $I(Y_1;\\boldsymbol{Z})$ and $I(K;\\boldsymbol{Z})$ as $n \\to \\infty$, and demonstrate how this analytical framework naturally extends to settings with heterogeneous user distributions.\n  For the shuffle-DP setting, we establish information-theoretic upper bounds on total information leakage. When each user applies an $\\varepsilon_0$-DP mechanism, the overall leakage satisfies $I(K; \\boldsymbol{Z}) \\le 2\\varepsilon_0$ and $I(X_1; \\boldsymbol{Z}\\mid (X_i)_{i=2}^n) \\le (e^{\\varepsilon_0}-1)/(2n) + O(n^{-3/2})$. These results bridge shuffle differential privacy and mutual-information-based privacy."}
{"id": "2511.15444", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15444", "abs": "https://arxiv.org/abs/2511.15444", "authors": ["Jiajun He", "Xidong Mu", "Hien Quoc Ngo", "Michail Matthaiou"], "title": "Pinching-Antenna System-Assisted Localization: A Stochastic Geometry Perspective", "comment": "This work has been submitted to the IEEE for possible publication", "summary": "This paper proposes a novel localization framework underpinned by a pinching-antenna (PA) system, in which the target location is estimated using received signal strength (RSS) measurements obtained from downlink signals transmitted by the PAs. To develop a comprehensive analytical framework, we employ stochastic geometry to model the spatial distribution of the PAs, enabling tractable and insightful network-level performance analysis. Closed-form expressions for target localizability and the Cramer-Rao lower bound (CRLB) distribution are analytically derived, enabling the evaluation of the fundamental limits of PA-assisted localization systems without extensive simulations. Furthermore, the proposed framework provides practical guidance for selecting the optimal waveguide number to maximize localization performance. Numerical results also highlight the superiority of the PA-assisted approach over conventional fixed-antenna systems in terms of the CRLB."}
{"id": "2511.14890", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.14890", "abs": "https://arxiv.org/abs/2511.14890", "authors": ["Helmut Repp"], "title": "Ein Fenster zur gleichzeitigen Messung der Uebertragungsfunktion eines realen Systems und des Leistungsdichtespektrums des ueberlagerten Rauschens am Systemausgang (Teil 1)", "comment": "256 pages, in German, MATLAB and SCILAB programs for calculating a window in a ZIP folder attached as ancillary file", "summary": "There is already a method known from the literature with which it is possible to measure both the transfer function and the noise power spectral density of the superimposed noise at the output of a disturbed, time-invariant, real system with nonlinearities in one measurement. By using a suitable window, the frequency selectivity of the measurement of the power spectral density of the superimposed noise can be noticeably improved without significantly increasing the computational complexity of the method. The unbiasedness and consistency of the measurement method with a suitable window are proven. The measurement of the power spectral density of a zero-mean, stationary process without measuring the transfer function is investigated as a special case for both real-valued and complex-valued signals. It is derived which requirements a suitable window should meet and how it can be calculated with high numerical accuracy.\n  --\n  Es gibt bereits eine aus der Literatur bekannte Methode mit der es moeglich ist in einer Messung sowohl die Uebertragungsfunktion als auch das Rauschleistungsdichtespektrum des ueberlagerten Rauschens am Ausgang eines gestoerten, zeitinvarianten, realen Systems mit Nichtlinearitaeten zu messen. Durch den Einsatz eines geeigneten Fensters kann die Frequenzselektivitaet der Messung des Leistungsdichtespektrums der Stoerung deutlich verbessert werden, ohne den Aufwand der Berechnungen des Verfahrens nennenswert zu erhoehen. Die Erwartungstreue und die Konsistenz des Messverfahren mit Fensterung wird gezeigt. Die Messung des Leistungsdichtespektrums eines mittelwertfreien, stationaeren Prozesses ohne Messung der Uebertragungsfunktion wird als Sonderfall sowohl fuer reellwertige, als auch fuer komplexwertige Signale untersucht. Es wird hergeleitet, welche Forderungen ein geeignetes Fenster erfuellen sollte und wie es sich numerisch hochgenau berechnen laesst."}
{"id": "2511.15112", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15112", "abs": "https://arxiv.org/abs/2511.15112", "authors": ["Wei-hsiang Yen", "Lyn Chao-ling Chen"], "title": "Semiconductor Industry Trend Prediction with Event Intervention Based on LSTM Model in Sentiment-Enhanced Time Series Data", "comment": "Accepted in Taiwan Academic Network Conference (TANET 2025)", "summary": "The innovation of the study is that the deep learning method and sentiment analysis are integrated in traditional business model analysis and forecasting, and the research subject is TSMC for industry trend prediction of semiconductor industry in Taiwan. For the rapid market changes and development of wafer technologies of semiconductor industry, traditional data analysis methods not perform well in the high variety and time series data. Textual data and time series data were collected from seasonal reports of TSMC including financial information. Textual data through sentiment analysis by considering the event intervention both from internal events of the company and the external global events. Using the sentiment-enhanced time series data, the LSTM model was adopted for predicting industry trend of TSMC. The prediction results reveal significant development of wafer technology of TSMC and the potential threatens in the global market, and matches the product released news of TSMC and the international news. The contribution of the work performed accurately in industry trend prediction of the semiconductor industry by considering both the internal and external event intervention, and the prediction results provide valuable information of semiconductor industry both in research and business aspects."}
{"id": "2511.15458", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15458", "abs": "https://arxiv.org/abs/2511.15458", "authors": ["Xuan Yang", "Dongming Li", "Dong Wei", "Meng Zhang"], "title": "Division-based Receiver-agnostic RFF Identification in WiFi Systems", "comment": null, "summary": "In physical-layer security schemes, radio frequency fingerprint (RFF) identification of WiFi devices is susceptible to receiver differences, which can significantly degrade classification performance when a model is trained on one receiver but tested on another. In this paper, we propose a division-based receiver-agnostic RFF extraction method for WiFi systems, which removes the receivers' effects by dividing different preambles in the frequency domain. The proposed method requires only a single receiver for training and does not rely on additional calibration or stacking processes. First, for flat fading channel scenarios, the legacy short training field (L-STF) and legacy long training field (L-LTF) of the unknown device are divided by those of the reference device in the frequency domain. The receiver-dependent effects can be eliminated with the requirement of only a single receiver for training, and the higher-dimensional RFF features can be extracted. Second, for frequency-selective fading channel scenarios, the high-throughput long training field (HT-LTF) is divided by the L-LTF in the frequency domain. Only a single receiver is required for training and the higher-dimensional RFF features that are both channel-invariant and receiver-agnostic are extracted. Finally, simulation and experimental results demonstrate that the proposed method effectively mitigate the impacts of channel variations and receiver differences. The classification results show that, even when training on a single receiver and testing on a different one, the proposed method achieves classification accuracy improvements of 15.5% and 28.45% over the state-of-the-art approach in flat fading and frequency-selective fading channel scenarios, respectively."}
{"id": "2511.14957", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.14957", "abs": "https://arxiv.org/abs/2511.14957", "authors": ["Helmut Repp"], "title": "Ein Fenster zur gleichzeitigen Messung der Uebertragungsfunktion eines realen Systems und des Leistungsdichtespektrums des ueberlagerten Rauschens am Systemausgang (Teil 2)", "comment": "288 pages, in German", "summary": "The method described in the first part for frequency-selectively measuring the transfer function and the noise power spectral density of the superimposed noise at the output of a disturbed, real system with nonlinearities using windowing was limited to time-invariant systems with stationary and zero-mean processes. Here, we investigate how this measurement method can be extended so that all correlations existing between the input and output signals can also be measured using windowing for a periodically time-varying system disturbed by a cyclostationary noise process. An extended version of the window construction algorithm presented in the first part is introduced, in which some degrees of freedom not used there can be used to appropriately influence the properties of the window sequence depending on the application.\n  --\n  Das im ersten Teil beschriebene Verfahren die Uebertragungsfunktion und das Rauschleistungsdichtespektrum des ueberlagerten Rauschens am Ausgang eines gestoerten, realen Systems mit Nichtlinearitaeten mit Hilfe der Fensterung frequenzselektiv zu vermessen beschraenkte sich auf zeitinvariante Systeme mit stationaeren und mittelwertfreien Prozessen. Hier wird untersucht, wie dieses Messverfahren zu erweitern ist, so dass man damit auch alle Korrelationen, die zwischen Ein- und Ausgangssignal bestehen, bei einem periodisch zeitvarianten System, das von einem zyklostationaeren Rauschprozess gestoert wird, mit einer Fensterung messen kann. Es wird eine erweiterte Variante des im ersten Teil vorgestellten Algorithmus zur Konstruktion des Fensters angegeben, bei der einige dort nicht genutzte Freiheitsgrade dazu verwendet werden koennen, die Eigenschaften der Fensterfolge je nach Applikation geeignet zu beeinflussen."}
{"id": "2511.15125", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15125", "abs": "https://arxiv.org/abs/2511.15125", "authors": ["Huifan Zhang", "Pingqiang Zhou"], "title": "Efficient RF Passive Components Modeling with Bayesian Online Learning and Uncertainty Aware Sampling", "comment": null, "summary": "Conventional radio frequency (RF) passive components modeling based on machine learning requires extensive electromagnetic (EM) simulations to cover geometric and frequency design spaces, creating computational bottlenecks. In this paper, we introduce an uncertainty-aware Bayesian online learning framework for efficient parametric modeling of RF passive components, which includes: 1) a Bayesian neural network with reconfigurable heads for joint geometric-frequency domain modeling while quantifying uncertainty; 2) an adaptive sampling strategy that simultaneously optimizes training data sampling across geometric parameters and frequency domain using uncertainty guidance. Validated on three RF passive components, the framework achieves accurate modeling while using only 2.86% EM simulation time compared to traditional ML-based flow, achieving a 35 times speedup."}
{"id": "2511.15490", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15490", "abs": "https://arxiv.org/abs/2511.15490", "authors": ["Mohamed Siala", "Noura Sellami"], "title": "Collision Resolution in RFID Systems Using Antenna Arrays and Mix Source Separation", "comment": "4 pages, 3 figures", "summary": "In this letter, we propose an efficient mix source separation algorithm for collision resolution in radio frequency identification (RFID) systems equipped with an antenna array at the reader. We first introduce an approach that exploits the zero constant modulus (ZCM) criterion to separate colliding tags through gradient descent, without using pilot symbols. We show that the ZCM characteristic, considered alone, in the design of the objective function can lead to significant ambiguities in the determination of the beamformers used in the recovery of tag messages. To address this limitation, we propose a more sophisticated approach, relying on a hybrid objective function, incorporating a new ambiguity-raising criterion in addition to the ZCM criterion."}
{"id": "2511.15031", "categories": ["cs.CR", "cs.DC", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15031", "abs": "https://arxiv.org/abs/2511.15031", "authors": ["Yifan Cai", "Linh Thi Xuan Phan"], "title": "GeoShield: Byzantine Fault Detection and Recovery for Geo-Distributed Real-Time Cyber-Physical Systems", "comment": null, "summary": "Large-scale cyber-physical systems (CPS), such as railway control systems and smart grids, consist of geographically distributed subsystems that are connected via unreliable, asynchronous inter-region networks. Their scale and distribution make them especially vulnerable to faults and attacks. Unfortunately, existing fault-tolerant methods either consume excessive resources or provide only eventual guarantees, making them unsuitable for real-time resource-constrained CPS.\n  We present GeoShield, a resource-efficient solution for defending geo-distributed CPS against Byzantine faults. GeoShield leverages the property that CPS are designed to tolerate brief disruptions and maintain safety, as long as they recover (i.e., resume normal operations or transition to a safe mode) within a bounded amount of time following a fault. Instead of masking faults, it detects them and recovers the system within bounded time, thus guaranteeing safety with much fewer resources. GeoShield introduces protocols for Byzantine fault-resilient network measurement and inter-region omission fault detection that proactively detect malicious message delays, along with recovery mechanisms that guarantee timely recovery while maximizing operational robustness. It is the first bounded-time recovery solution that operates effectively under unreliable networks without relying on trusted hardware. Evaluations using real-world case studies show that it significantly outperforms existing methods in both effectiveness and resource efficiency."}
{"id": "2511.15136", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15136", "abs": "https://arxiv.org/abs/2511.15136", "authors": ["Andrew Amos", "Joanne Lee", "Tarun Sen Gupta", "Bunmi S. Malau-Aduli"], "title": "Novel sparse matrix algorithm expands the feasible size of a self-organizing map of the knowledge indexed by a database of peer-reviewed medical literature", "comment": null, "summary": "Past efforts to map the Medline database have been limited to small subsets of the available data because of the exponentially increasing memory and processing demands of existing algorithms. We designed a novel algorithm for sparse matrix multiplication that allowed us to apply a self-organizing map to the entire Medline dataset, allowing for a more complete map of existing medical knowledge. The algorithm also increases the feasibility of refining the self-organizing map to account for changes in the dataset over time."}
{"id": "2511.15497", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15497", "abs": "https://arxiv.org/abs/2511.15497", "authors": ["Yu Sha", "Ningtao Liu", "Haofeng Liu", "Junqi Tao", "Zhenxing Niu", "Guojun Huang", "Yao Yao", "Jiaqi Liang", "Moxian Qian", "Horst Stoecker", "Domagoj Vnucec", "Andreas Widl", "Kai Zhou"], "title": "A Review of Machine Learning for Cavitation Intensity Recognition in Complex Industrial Systems", "comment": "43 pages", "summary": "Cavitation intensity recognition (CIR) is a critical technology for detecting and evaluating cavitation phenomena in hydraulic machinery, with significant implications for operational safety, performance optimization, and maintenance cost reduction in complex industrial systems. Despite substantial research progress, a comprehensive review that systematically traces the development trajectory and provides explicit guidance for future research is still lacking. To bridge this gap, this paper presents a thorough review and analysis of hundreds of publications on intelligent CIR across various types of mechanical equipment from 2002 to 2025, summarizing its technological evolution and offering insights for future development. The early stages are dominated by traditional machine learning approaches that relied on manually engineered features under the guidance of domain expert knowledge. The advent of deep learning has driven the development of end-to-end models capable of automatically extracting features from multi-source signals, thereby significantly improving recognition performance and robustness. Recently, physical informed diagnostic models have been proposed to embed domain knowledge into deep learning models, which can enhance interpretability and cross-condition generalization. In the future, transfer learning, multi-modal fusion, lightweight network architectures, and the deployment of industrial agents are expected to propel CIR technology into a new stage, addressing challenges in multi-source data acquisition, standardized evaluation, and industrial implementation. The paper aims to systematically outline the evolution of CIR technology and highlight the emerging trend of integrating deep learning with physical knowledge. This provides a significant reference for researchers and practitioners in the field of intelligent cavitation diagnosis in complex industrial systems."}
{"id": "2511.15412", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.15412", "abs": "https://arxiv.org/abs/2511.15412", "authors": ["Evgenii Vinogradov", "Aymen Fakhreddine", "Abdul Saboor", "Sergi Abadal", "Sofie Pollin"], "title": "Spatially Consistent Air-to-Ground Channel Modeling and Simulation via 3D Shadow Projections", "comment": "International Conference on Computing, Networking and Communications (ICNC 2026)", "summary": "We present an approach for spatially-consistent semi-deterministic Air-to-Ground (A2G) channel modeling in Unmanned Aerial Vehicle-assisted networks. We use efficient 3D building shadow projections to determine Line-of-Sight (LOS) regions, enabling fast generation of LOS maps. By integrating LOS-aware deterministic path loss with stochastic shadow fading, the approach produces spatially consistent A2G radio maps suitable for environment- and mobility-aware channel evaluation and performance prediction. Simulation results in ITU-compliant Manhattan grid environments demonstrate the model's ability to reflect key urban propagation characteristics, such as LOS blockage patterns and outage behavior. The proposed approach provides an efficient alternative to ray tracing or fully stochastic models, with particular relevance for user mobility, link planning, and radio map generation in 6G non-terrestrial networks."}
{"id": "2511.15137", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15137", "abs": "https://arxiv.org/abs/2511.15137", "authors": ["Xiaoxuan Wang", "Bo Liu", "Song Jiang", "Jingzhou Liu", "Jingyuan Qi", "Xia Chen", "Baosheng He"], "title": "From Solving to Verifying: A Unified Objective for Robust Reasoning in LLMs", "comment": null, "summary": "The reasoning capabilities of large language models (LLMs) have been significantly improved through reinforcement learning (RL). Nevertheless, LLMs still struggle to consistently verify their own reasoning traces. This raises the research question of how to enhance the self-verification ability of LLMs and whether such an ability can further improve reasoning performance. In this work, we propose GRPO-Verif, an algorithm that jointly optimizes solution generation and self-verification within a unified loss function, with an adjustable hyperparameter controlling the weight of the verification signal. Experimental results demonstrate that our method enhances self-verification capability while maintaining comparable performance in reasoning."}
{"id": "2511.15523", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2511.15523", "abs": "https://arxiv.org/abs/2511.15523", "authors": ["Noura Sellami", "Mohamed Siala"], "title": "Randomized Power Transmission with Optimized Level Selection Probabilities in Uncoordinated Uplink NOMA", "comment": "5 pages, 7 figures", "summary": "We consider uncoordinated random uplink non-orthogonal multiple access (NOMA) systems using a set of predetermined power levels. We propose to optimize the probabilities of selection of power levels in order to minimize performance metrics as block error probability (BLEP) or bit error probability (BEP). When the multiuser detection algorithm at the BS treats at most two colliding users' packets, our optimization problem is a quadratic programming problem. For more colliding users' packets, we solve the problem iteratively. Our solution is original because it applies to any multiuser detection algorithm and any set of power levels."}
{"id": "2511.15138", "categories": ["cs.LG", "cs.HC"], "pdf": "https://arxiv.org/pdf/2511.15138", "abs": "https://arxiv.org/abs/2511.15138", "authors": ["Hyo-Jeong Jang", "Hye-Bin Shin", "Kang Yin"], "title": "Cross-Modal Consistency-Guided Active Learning for Affective BCI Systems", "comment": null, "summary": "Deep learning models perform best with abundant, high-quality labels, yet such conditions are rarely achievable in EEG-based emotion recognition. Electroencephalogram (EEG) signals are easily corrupted by artifacts and individual variability, while emotional labels often stem from subjective and inconsistent reports-making robust affective decoding particularly difficult. We propose an uncertainty-aware active learning framework that enhances robustness to label noise by jointly leveraging model uncertainty and cross-modal consistency. Instead of relying solely on EEG-based uncertainty estimates, the method evaluates cross-modal alignment to determine whether uncertainty originates from cognitive ambiguity or sensor noise. A representation alignment module embeds EEG and face features into a shared latent space, enforcing semantic coherence between modalities. Residual discrepancies are treated as noise-induced inconsistencies, and these samples are selectively queried for oracle feedback during active learning. This feedback-driven process guides the network toward reliable, informative samples and reduces the impact of noisy labels. Experiments on the ASCERTAIN dataset examine the efficiency and robustness of ours, highlighting its potential as a data-efficient and noise-tolerant approach for EEG-based affective decoding in brain-computer interface systems."}
{"id": "2511.15545", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15545", "abs": "https://arxiv.org/abs/2511.15545", "authors": ["Noura Sellami", "Mohamed Siala"], "title": "Uncoordinated Cooperative OFDM Multi-Hop UAV Relay Networks Using Virtual Channels Based on All-Pass Filters", "comment": "14 pages, 5 figures", "summary": "In this paper, we propose an efficient transmission scheme for autonomous cooperative Orthogonal Frequency Division Multiplexing (OFDM) based multi-hop Unmanned Aerial Vehicle (UAV) relay networks. These systems often suffer from destructive interference at the destination node due to uncoordinated transmissions of common packets by cooperating UAVs. To address this issue, we introduce the concept of virtual transmit channels at each UAV, implemented using truncated all-pass filters (APFs). This approach ensures that all subcarriers benefit from comparable transmit powers, guaranteeing excellent performance when a single UAV is transmitting. In scenarios where multiple UAVs cooperate without coordination, the inherent randomness of the generated virtual channels facilitates cooperative diversity, effectively mitigating destructive interference. We further integrate this method with the distributed randomized space-time block coding (STBC) scheme to enhance transmission reliability. Additionally, we propose efficient algorithms for estimating the composite channels that combine both the true propagation channels and the virtual channels. Simulation results demonstrate that our proposed scheme significantly outperforms the classical phase dithering scheme across various scenarios."}
{"id": "2511.15172", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15172", "abs": "https://arxiv.org/abs/2511.15172", "authors": ["Andrew Gracyk"], "title": "Complex variational autoencoders admit Kähler structure", "comment": "First version", "summary": "It has been discovered that latent-Euclidean variational autoencoders (VAEs) admit, in various capacities, Riemannian structure. We adapt these arguments but for complex VAEs with a complex latent stage. We show that complex VAEs reveal to some level Kähler geometric structure. Our methods will be tailored for decoder geometry. We derive the Fisher information metric in the complex case under a latent complex Gaussian regularization with trivial relation matrix. It is well known from statistical information theory that the Fisher information coincides with the Hessian of the Kullback-Leibler (KL) divergence. Thus, the metric Kähler potential relation is exactly achieved under relative entropy. We propose a Kähler potential derivative of complex Gaussian mixtures that has rough equivalence to the Fisher information metric while still being faithful to the underlying Kähler geometry. Computation of the metric via this potential is efficient, and through our potential, valid as a plurisubharmonic (PSH) function, large scale computational burden of automatic differentiation is displaced to small scale. We show that we can regularize the latent space with decoder geometry, and that we can sample in accordance with a weighted complex volume element. We demonstrate these strategies, at the exchange of sample variation, yield consistently smoother representations and fewer semantic outliers."}
{"id": "2511.15174", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15174", "abs": "https://arxiv.org/abs/2511.15174", "authors": ["Yi Xu", "Zhigang Chen", "Rui Wang", "Yangfan Li", "Fengxiao Tang", "Ming Zhao", "Jiaqi Liu"], "title": "FaultDiffusion: Few-Shot Fault Time Series Generation with Diffusion Model", "comment": "4 figures, 5 tables ,8 pages", "summary": "In industrial equipment monitoring, fault diagnosis is critical for ensuring system reliability and enabling predictive maintenance. However, the scarcity of fault data, due to the rarity of fault events and the high cost of data annotation, significantly hinders data-driven approaches. Existing time-series generation models, optimized for abundant normal data, struggle to capture fault distributions in few-shot scenarios, producing samples that lack authenticity and diversity due to the large domain gap and high intra-class variability of faults. To address this, we propose a novel few-shot fault time-series generation framework based on diffusion models. Our approach employs a positive-negative difference adapter, leveraging pre-trained normal data distributions to model the discrepancies between normal and fault domains for accurate fault synthesis. Additionally, a diversity loss is introduced to prevent mode collapse, encouraging the generation of diverse fault samples through inter-sample difference regularization. Experimental results demonstrate that our model significantly outperforms traditional methods in authenticity and diversity, achieving state-of-the-art performance on key benchmarks."}
{"id": "2511.15175", "categories": ["cs.LG", "cs.IT", "quant-ph"], "pdf": "https://arxiv.org/pdf/2511.15175", "abs": "https://arxiv.org/abs/2511.15175", "authors": ["Le Tung Giang", "Vu Hoang Viet", "Nguyen Xuan Tung", "Trinh Van Chien", "Won-Joo Hwang"], "title": "Vehicle Routing Problems via Quantum Graph Attention Network Deep Reinforcement Learning", "comment": "11 pages, 3 figures, 2 tables. Accepted by SOICT 2025", "summary": "The vehicle routing problem (VRP) is a fundamental NP-hard task in intelligent transportation systems with broad applications in logistics and distribution. Deep reinforcement learning (DRL) with Graph Neural Networks (GNNs) has shown promise, yet classical models rely on large multi-layer perceptrons (MLPs) that are parameter-heavy and memory-bound. We propose a Quantum Graph Attention Network (Q-GAT) within a DRL framework, where parameterized quantum circuits (PQCs) replace conventional MLPs at critical readout stages. The hybrid model maintains the expressive capacity of graph attention encoders while reducing trainable parameters by more than 50%. Using proximal policy optimization (PPO) with greedy and stochastic decoding, experiments on VRP benchmarks show that Q-GAT achieves faster convergence and reduces routing cost by about 5% compared with classical GAT baselines. These results demonstrate the potential of PQC-enhanced GNNs as compact and effective solvers for large-scale routing and logistics optimization."}
{"id": "2511.15083", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15083", "abs": "https://arxiv.org/abs/2511.15083", "authors": ["Xiancheng Wang", "Lin Wang", "Rui Wang", "Zhibo Zhang", "Minghang Zhao"], "title": "Fourier-KAN-Mamba: A Novel State-Space Equation Approach for Time-Series Anomaly Detection", "comment": null, "summary": "Time-series anomaly detection plays a critical role in numerous real-world applications, including industrial monitoring and fault diagnosis. Recently, Mamba-based state-space models have shown remarkable efficiency in long-sequence modeling. However, directly applying Mamba to anomaly detection tasks still faces challenges in capturing complex temporal patterns and nonlinear dynamics. In this paper, we propose Fourier-KAN-Mamba, a novel hybrid architecture that integrates Fourier layer, Kolmogorov-Arnold Networks (KAN), and Mamba selective state-space model. The Fourier layer extracts multi-scale frequency features, KAN enhances nonlinear representation capability, and a temporal gating control mechanism further improves the model's ability to distinguish normal and anomalous patterns. Extensive experiments on MSL, SMAP, and SWaT datasets demonstrate that our method significantly outperforms existing state-of-the-art approaches.\n  Keywords: time-series anomaly detection, state-space model, Mamba, Fourier transform, Kolmogorov-Arnold Network"}
{"id": "2511.15190", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15190", "abs": "https://arxiv.org/abs/2511.15190", "authors": ["Yuxuan Gu", "Weimin Bai", "Yifei Wang", "Weijian Luo", "He Sun"], "title": "Masked Auto-Regressive Variational Acceleration: Fast Inference Makes Practical Reinforcement Learning", "comment": null, "summary": "Masked auto-regressive diffusion models (MAR) benefit from the expressive modeling ability of diffusion models and the flexibility of masked auto-regressive ordering. However, vanilla MAR suffers from slow inference due to its hierarchical inference mechanism: an outer AR unmasking loop and an inner diffusion denoising chain. Such decoupled structure not only harm the generation efficiency but also hinder the practical use of MAR for reinforcement learning (RL), an increasingly critical paradigm for generative model post-training.To address this fundamental issue, we introduce MARVAL (Masked Auto-regressive Variational Acceleration), a distillation-based framework that compresses the diffusion chain into a single AR generation step while preserving the flexible auto-regressive unmasking order. Such a distillation with MARVAL not only yields substantial inference acceleration but, crucially, makes RL post-training with verifiable rewards practical, resulting in scalable yet human-preferred fast generative models. Our contributions are twofold: (1) a novel score-based variational objective for distilling masked auto-regressive diffusion models into a single generation step without sacrificing sample quality; and (2) an efficient RL framework for masked auto-regressive models via MARVAL-RL. On ImageNet 256*256, MARVAL-Huge achieves an FID of 2.00 with more than 30 times speedup compared with MAR-diffusion, and MARVAL-RL yields consistent improvements in CLIP and image-reward scores on ImageNet datasets with entity names. In conclusion, MARVAL demonstrates the first practical path to distillation and RL of masked auto-regressive diffusion models, enabling fast sampling and better preference alignments."}
{"id": "2511.15327", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15327", "abs": "https://arxiv.org/abs/2511.15327", "authors": ["Huseyin Goksu"], "title": "KrawtchoukNet: A Unified GNN Solution for Heterophily and Over-smoothing with Adaptive Bounded Polynomials", "comment": null, "summary": "Spectral Graph Neural Networks (GNNs) based on polynomial filters, such as ChebyNet, suffer from two critical limitations: 1) performance collapse on \"heterophilic\" graphs and 2) performance collapse at high polynomial degrees (K), known as over-smoothing. Both issues stem from the static, low-pass nature of standard filters. In this work, we propose `KrawtchoukNet`, a GNN filter based on the discrete Krawtchouk polynomials. We demonstrate that `KrawtchoukNet` provides a unified solution to both problems through two key design choices. First, by fixing the polynomial's domain N to a small constant (e.g., N=20), we create the first GNN filter whose recurrence coefficients are \\textit{inherently bounded}, making it exceptionally robust to over-smoothing (achieving SOTA results at K=10). Second, by making the filter's shape parameter p learnable, the filter adapts its spectral response to the graph data. We show this adaptive nature allows `KrawtchoukNet` to achieve SOTA performance on challenging heterophilic benchmarks (Texas, Cornell), decisively outperforming standard GNNs like GAT and APPNP."}
{"id": "2511.15208", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15208", "abs": "https://arxiv.org/abs/2511.15208", "authors": ["Ranfei Chen", "Ming Chen", "Kaifei Wang"], "title": "Reasoning in Diffusion Large Language Models is Concentrated in Dynamic Confusion Zones", "comment": null, "summary": "Diffusion Large Language Models (dLLMs) are rapidly emerging alongside autoregressive models as a powerful paradigm for complex reasoning, with reinforcement learning increasingly used for downstream alignment. Existing trajectory-based RL methods uniformly allocate policy gradients across denoising steps, implicitly treating all steps as equally important. We challenge this assumption by analyzing trajectories with several step-level metrics: entropy-based uncertainty, Confidence-Margin (CM) uncertainty, and Rate of Entropy Change (RoEC). These reveal structured \"zones of confusion\": transient spikes in uncertainty and instability that strongly predict final success or failure, while most steps remain stable. We propose Adaptive Trajectory Policy Optimization (ATPO), a lightweight step-selection strategy that dynamically reallocates gradient updates to these high-leverage steps without changing the RL objective, rewards, or compute budget. Using a hybrid RoEC+CM rule, ATPO delivers substantial gains in reasoning accuracy and training stability across benchmarks, showing that exploiting trajectory dynamics is key to advancing dLLM RL."}
{"id": "2511.15328", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15328", "abs": "https://arxiv.org/abs/2511.15328", "authors": ["Huseyin Goksu"], "title": "LaguerreNet: Advancing a Unified Solution for Heterophily and Over-smoothing with Adaptive Continuous Polynomials", "comment": null, "summary": "Spectral Graph Neural Networks (GNNs) suffer from two critical limitations: poor performance on \"heterophilic\" graphs and performance collapse at high polynomial degrees (K), known as over-smoothing. Both issues stem from the static, low-pass nature of standard filters (e.g., ChebyNet). While adaptive polynomial filters, such as the discrete MeixnerNet, have emerged as a potential unified solution, their extension to the continuous domain and stability with unbounded coefficients remain open questions. In this work, we propose `LaguerreNet`, a novel GNN filter based on continuous Laguerre polynomials. `LaguerreNet` learns the filter's spectral shape by making its core alpha parameter trainable, thereby advancing the adaptive polynomial approach. We solve the severe O(k^2) numerical instability of these unbounded polynomials using a `LayerNorm`-based stabilization technique. We demonstrate experimentally that this approach is highly effective: 1) `LaguerreNet` achieves state-of-the-art results on challenging heterophilic benchmarks. 2) It is exceptionally robust to over-smoothing, with performance peaking at K=10, an order of magnitude beyond where ChebyNet collapses."}
{"id": "2511.15246", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15246", "abs": "https://arxiv.org/abs/2511.15246", "authors": ["Tung Giang Le", "Xuan Tung Nguyen", "Won-Joo Hwang"], "title": "D2D Power Allocation via Quantum Graph Neural Network", "comment": null, "summary": "Increasing wireless network complexity demands scalable resource management. Classical GNNs excel at graph learning but incur high computational costs in large-scale settings. We present a fully quantum Graph Neural Network (QGNN) that implements message passing via Parameterized Quantum Circuits (PQCs). Our Quantum Graph Convolutional Layers (QGCLs) encode features into quantum states, process graphs with NISQ-compatible unitaries, and retrieve embeddings through measurement. Applied to D2D power control for SINR maximization, our QGNN matches classical performance with fewer parameters and inherent parallelism. This end-to-end PQC-based GNN marks a step toward quantum-accelerated wireless optimization."}
{"id": "2511.15248", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15248", "abs": "https://arxiv.org/abs/2511.15248", "authors": ["Kai Yang", "Xin Xu", "Yangkun Chen", "Weijie Liu", "Jiafei Lyu", "Zichuan Lin", "Deheng Ye", "Saiyong Yang"], "title": "EntroPIC: Towards Stable Long-Term Training of LLMs via Entropy Stabilization with Proportional-Integral Control", "comment": null, "summary": "Long-term training of large language models (LLMs) requires maintaining stable exploration to prevent the model from collapsing into sub-optimal behaviors. Entropy is crucial in this context, as it controls exploration and helps avoid premature convergence to sub-optimal solutions. However, existing reinforcement learning methods struggle to maintain an appropriate level of entropy, as the training process involves a mix of positive and negative samples, each affecting entropy in different ways across steps. To address this, we propose Entropy stablilization via Proportional-Integral Control (EntroPIC), a novel method that adaptively adjusts the influence of positive and negative samples by dynamically tuning their loss coefficients. This approach stabilizes entropy throughout training, ensuring efficient exploration and steady progress. We provide a comprehensive theoretical analysis for both on-policy and off-policy learning settings, demonstrating that EntroPIC is effective at controlling entropy in large-scale LLM training. Experimental results show that our method successfully maintains desired entropy levels, enabling stable and optimal RL training for LLMs."}
{"id": "2511.15250", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15250", "abs": "https://arxiv.org/abs/2511.15250", "authors": ["Jin Ye", "Lingmei Wang", "Shujian Zhang", "Haihang WU"], "title": "Optimized scheduling of electricity-heat cooperative system considering wind energy consumption and peak shaving and valley filling", "comment": null, "summary": "With the global energy transition and rapid development of renewable energy, the scheduling optimization challenge for combined power-heat systems under new energy integration and multiple uncertainties has become increasingly prominent. Addressing this challenge, this study proposes an intelligent scheduling method based on the improved Dual-Delay Deep Deterministic Policy Gradient (PVTD3) algorithm. System optimization is achieved by introducing a penalty term for grid power purchase variations. Simulation results demonstrate that under three typical scenarios (10%, 20%, and 30% renewable penetration), the PVTD3 algorithm reduces the system's comprehensive cost by 6.93%, 12.68%, and 13.59% respectively compared to the traditional TD3 algorithm. Concurrently, it reduces the average fluctuation amplitude of grid power purchases by 12.8%. Regarding energy storage management, the PVTD3 algorithm reduces the end-time state values of low-temperature thermal storage tanks by 7.67-17.67 units while maintaining high-temperature tanks within the 3.59-4.25 safety operating range. Multi-scenario comparative validation demonstrates that the proposed algorithm not only excels in economic efficiency and grid stability but also exhibits superior sustainable scheduling capabilities in energy storage device management."}
{"id": "2511.15251", "categories": ["cs.LG", "cs.NI"], "pdf": "https://arxiv.org/pdf/2511.15251", "abs": "https://arxiv.org/abs/2511.15251", "authors": ["Chengze Du", "Heng Xu", "Zhiwei Yu", "Bo Liu", "Jialong Li"], "title": "PLATONT: Learning a Platonic Representation for Unified Network Tomography", "comment": null, "summary": "Network tomography aims to infer hidden network states, such as link performance, traffic load, and topology, from external observations. Most existing methods solve these problems separately and depend on limited task-specific signals, which limits generalization and interpretability. We present PLATONT, a unified framework that models different network indicators (e.g., delay, loss, bandwidth) as projections of a shared latent network state. Guided by the Platonic Representation Hypothesis, PLATONT learns this latent state through multimodal alignment and contrastive learning. By training multiple tomography tasks within a shared latent space, it builds compact and structured representations that improve cross-task generalization. Experiments on synthetic and real-world datasets show that PLATONT consistently outperforms existing methods in link estimation, topology inference, and traffic prediction, achieving higher accuracy and stronger robustness under varying network conditions."}
{"id": "2511.15256", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2511.15256", "abs": "https://arxiv.org/abs/2511.15256", "authors": ["Yanchen Xu", "Ziheng Jiao", "Hongyuan Zhang", "Xuelong Li"], "title": "GRPO-RM: Fine-Tuning Representation Models via GRPO-Driven Reinforcement Learning", "comment": null, "summary": "The Group Relative Policy Optimization (GRPO), a reinforcement learning method used to fine-tune large language models (LLMs), has proved its effectiveness in practical applications such as DeepSeek-R1. It raises a question whether GRPO can be generalized to representation learning models. In this paper, we propose Group Relative Policy Optimization for Representation Model (GRPO-RM), and investigate the performance of GRPO-like policy in post-training representation models. Specifically, our method establishes a predefined output set to functionally replace token sequence sampling in LLMs, thereby generating an output group, which is essential for the probability-driven optimization of GRPO. In addition, a specialized reward function is designed to accommodate the properties of representation models. Extensive experiments are conducted on various real-world datasets to validate the effectiveness of our proposed method."}
{"id": "2511.15276", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15276", "abs": "https://arxiv.org/abs/2511.15276", "authors": ["Hyeongheon Cha", "Dong Min Kim", "Hye Won Chung", "Taesik Gong", "Sung-Ju Lee"], "title": "SNAP: Low-Latency Test-Time Adaptation with Sparse Updates", "comment": null, "summary": "Test-Time Adaptation (TTA) adjusts models using unlabeled test data to handle dynamic distribution shifts. However, existing methods rely on frequent adaptation and high computational cost, making them unsuitable for resource-constrained edge environments. To address this, we propose SNAP, a sparse TTA framework that reduces adaptation frequency and data usage while preserving accuracy. SNAP maintains competitive accuracy even when adapting based on only 1% of the incoming data stream, demonstrating its robustness under infrequent updates. Our method introduces two key components: (i) Class and Domain Representative Memory (CnDRM), which identifies and stores a small set of samples that are representative of both class and domain characteristics to support efficient adaptation with limited data; and (ii) Inference-only Batch-aware Memory Normalization (IoBMN), which dynamically adjusts normalization statistics at inference time by leveraging these representative samples, enabling efficient alignment to shifting target domains. Integrated with five state-of-the-art TTA algorithms, SNAP reduces latency by up to 93.12%, while keeping the accuracy drop below 3.3%, even across adaptation rates ranging from 1% to 50%. This demonstrates its strong potential for practical use on edge devices serving latency-sensitive applications. The source code is available at https://github.com/chahh9808/SNAP."}
{"id": "2511.15300", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15300", "abs": "https://arxiv.org/abs/2511.15300", "authors": ["Rayen Dhahri", "Steffen Urban"], "title": "Quant-Trim in Practice: Improved Cross-Platform Low-Bit Deployment on Edge NPUs", "comment": "Accepted to a Eurips 2025 workshop, work in progress", "summary": "Specialized edge accelerators rely on low-bit quantization, but vendor compilers differ in scaling, clipping, and kernel support, often as black boxes. The same floating-point (FP) checkpoint can therefore yield inconsistent accuracy across backends, forcing practitioners to tweak flags or refactor models to vendor-friendly operator subsets. We introduce Quant-Trim, a training-phase method that produces a hardware-neutral checkpoint robust to backend and precision choices. It combines progressive fake quantization to align training with the deployed integer grid and reverse pruning to tame outlier-driven scale inflation while preserving learnability. Quant-Trim is agnostic to quantization schemes (symmetric/asymmetric,per-tensor/per-channel, INT8/INT4) and requires no vendor-specific graph changes.Across models and tasks, it narrows the FP,low-bit gap, reduces dependence on compiler heuristics/calibration, and avoids per-backend retraining. We report accuracy and edge metrics latency, throughput, energy/inference, and cost under static/dynamic activation scaling and varying operator coverage."}
{"id": "2511.15324", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15324", "abs": "https://arxiv.org/abs/2511.15324", "authors": ["Atharva Pandey", "Abhilash Neog", "Gautam Jajoo"], "title": "On the Internal Semantics of Time-Series Foundation Models", "comment": null, "summary": "Time-series Foundation Models (TSFMs) have recently emerged as a universal paradigm for learning across diverse temporal domains. However, despite their empirical success, the internal mechanisms by which these models represent fundamental time-series concepts remain poorly understood. In this work, we undertake a systematic investigation of concept interpretability in TSFMs. Specifically, we examine: (i) which layers encode which concepts, (ii) whether concept parameters are linearly recoverable, (iii) how representations evolve in terms of concept disentanglement and abstraction across model depth, and (iv) how models process compositions of concepts. We systematically probe these questions using layer-wise analyses, linear recoverability tests, and representation similarity measures, providing a structured account of TSFM semantics. The resulting insights show that early layers mainly capture local, time-domain patterns (e.g., AR(1), level shifts, trends), while deeper layers encode dispersion and change-time signals, with spectral and warping factors remaining the hardest to recover linearly. In compositional settings, however, probe performance degrades, revealing interference between concepts. This highlights that while atomic concepts are reliably localized, composition remains a challenge, underscoring a key limitation in current TSFMs' ability to represent interacting temporal phenomena."}
{"id": "2511.15327", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15327", "abs": "https://arxiv.org/abs/2511.15327", "authors": ["Huseyin Goksu"], "title": "KrawtchoukNet: A Unified GNN Solution for Heterophily and Over-smoothing with Adaptive Bounded Polynomials", "comment": null, "summary": "Spectral Graph Neural Networks (GNNs) based on polynomial filters, such as ChebyNet, suffer from two critical limitations: 1) performance collapse on \"heterophilic\" graphs and 2) performance collapse at high polynomial degrees (K), known as over-smoothing. Both issues stem from the static, low-pass nature of standard filters. In this work, we propose `KrawtchoukNet`, a GNN filter based on the discrete Krawtchouk polynomials. We demonstrate that `KrawtchoukNet` provides a unified solution to both problems through two key design choices. First, by fixing the polynomial's domain N to a small constant (e.g., N=20), we create the first GNN filter whose recurrence coefficients are \\textit{inherently bounded}, making it exceptionally robust to over-smoothing (achieving SOTA results at K=10). Second, by making the filter's shape parameter p learnable, the filter adapts its spectral response to the graph data. We show this adaptive nature allows `KrawtchoukNet` to achieve SOTA performance on challenging heterophilic benchmarks (Texas, Cornell), decisively outperforming standard GNNs like GAT and APPNP."}
{"id": "2511.15328", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.15328", "abs": "https://arxiv.org/abs/2511.15328", "authors": ["Huseyin Goksu"], "title": "LaguerreNet: Advancing a Unified Solution for Heterophily and Over-smoothing with Adaptive Continuous Polynomials", "comment": null, "summary": "Spectral Graph Neural Networks (GNNs) suffer from two critical limitations: poor performance on \"heterophilic\" graphs and performance collapse at high polynomial degrees (K), known as over-smoothing. Both issues stem from the static, low-pass nature of standard filters (e.g., ChebyNet). While adaptive polynomial filters, such as the discrete MeixnerNet, have emerged as a potential unified solution, their extension to the continuous domain and stability with unbounded coefficients remain open questions. In this work, we propose `LaguerreNet`, a novel GNN filter based on continuous Laguerre polynomials. `LaguerreNet` learns the filter's spectral shape by making its core alpha parameter trainable, thereby advancing the adaptive polynomial approach. We solve the severe O(k^2) numerical instability of these unbounded polynomials using a `LayerNorm`-based stabilization technique. We demonstrate experimentally that this approach is highly effective: 1) `LaguerreNet` achieves state-of-the-art results on challenging heterophilic benchmarks. 2) It is exceptionally robust to over-smoothing, with performance peaking at K=10, an order of magnitude beyond where ChebyNet collapses."}
{"id": "2511.15339", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15339", "abs": "https://arxiv.org/abs/2511.15339", "authors": ["Kadir-Kaan Özer", "René Ebeling", "Markus Enzweiler"], "title": "STREAM-VAE: Dual-Path Routing for Slow and Fast Dynamics in Vehicle Telemetry Anomaly Detection", "comment": "8 Pages, 4 Figures, 4 Tables", "summary": "Automotive telemetry data exhibits slow drifts and fast spikes, often within the same sequence, making reliable anomaly detection challenging. Standard reconstruction-based methods, including sequence variational autoencoders (VAEs), use a single latent process and therefore mix heterogeneous time scales, which can smooth out spikes or inflate variances and weaken anomaly separation.\n  In this paper, we present STREAM-VAE, a variational autoencoder for anomaly detection in automotive telemetry time-series data. Our model uses a dual-path encoder to separate slow drift and fast spike signal dynamics, and a decoder that represents transient deviations separately from the normal operating pattern. STREAM-VAE is designed for deployment, producing stable anomaly scores across operating modes for both in-vehicle monitors and backend fleet analytics.\n  Experiments on an automotive telemetry dataset and the public SMD benchmark show that explicitly separating drift and spike dynamics improves robustness compared to strong forecasting, attention, graph, and VAE baselines."}
{"id": "2511.15350", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15350", "abs": "https://arxiv.org/abs/2511.15350", "authors": ["Nathanael Bosch", "Oleksandr Shchur", "Nick Erickson", "Michael Bohlke-Schneider", "Caner Türkmen"], "title": "Multi-layer Stack Ensembles for Time Series Forecasting", "comment": "Published at AutoML Conference 2025 Methods Track", "summary": "Ensembling is a powerful technique for improving the accuracy of machine learning models, with methods like stacking achieving strong results in tabular tasks. In time series forecasting, however, ensemble methods remain underutilized, with simple linear combinations still considered state-of-the-art. In this paper, we systematically explore ensembling strategies for time series forecasting. We evaluate 33 ensemble models -- both existing and novel -- across 50 real-world datasets. Our results show that stacking consistently improves accuracy, though no single stacker performs best across all tasks. To address this, we propose a multi-layer stacking framework for time series forecasting, an approach that combines the strengths of different stacker models. We demonstrate that this method consistently provides superior accuracy across diverse forecasting scenarios. Our findings highlight the potential of stacking-based methods to improve AutoML systems for time series forecasting."}
{"id": "2511.15357", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15357", "abs": "https://arxiv.org/abs/2511.15357", "authors": ["Yinan Yu", "Falk Dippel", "Christina E. Lundberg", "Martin Lindgren", "Annika Rosengren", "Martin Adiels", "Helen Sjöland"], "title": "Cost-Aware Prediction (CAP): An LLM-Enhanced Machine Learning Pipeline and Decision Support System for Heart Failure Mortality Prediction", "comment": null, "summary": "Objective: Machine learning (ML) predictive models are often developed without considering downstream value trade-offs and clinical interpretability. This paper introduces a cost-aware prediction (CAP) framework that combines cost-benefit analysis assisted by large language model (LLM) agents to communicate the trade-offs involved in applying ML predictions. Materials and Methods: We developed an ML model predicting 1-year mortality in patients with heart failure (N = 30,021, 22% mortality) to identify those eligible for home care. We then introduced clinical impact projection (CIP) curves to visualize important cost dimensions - quality of life and healthcare provider expenses, further divided into treatment and error costs, to assess the clinical consequences of predictions. Finally, we used four LLM agents to generate patient-specific descriptions. The system was evaluated by clinicians for its decision support value. Results: The eXtreme gradient boosting (XGB) model achieved the best performance, with an area under the receiver operating characteristic curve (AUROC) of 0.804 (95% confidence interval (CI) 0.792-0.816), area under the precision-recall curve (AUPRC) of 0.529 (95% CI 0.502-0.558) and a Brier score of 0.135 (95% CI 0.130-0.140). Discussion: The CIP cost curves provided a population-level overview of cost composition across decision thresholds, whereas LLM-generated cost-benefit analysis at individual patient-levels. The system was well received according to the evaluation by clinicians. However, feedback emphasizes the need to strengthen the technical accuracy for speculative tasks. Conclusion: CAP utilizes LLM agents to integrate ML classifier outcomes and cost-benefit analysis for more transparent and interpretable decision support."}
{"id": "2511.15371", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15371", "abs": "https://arxiv.org/abs/2511.15371", "authors": ["Eddie Conti", "Álvaro Parafita", "Axel Brando"], "title": "CID: Measuring Feature Importance Through Counterfactual Distributions", "comment": "Accepted at Northern Lights Deep Learning (NLDL) 2026 Conference", "summary": "Assessing the importance of individual features in Machine Learning is critical to understand the model's decision-making process. While numerous methods exist, the lack of a definitive ground truth for comparison highlights the need for alternative, well-founded measures. This paper introduces a novel post-hoc local feature importance method called Counterfactual Importance Distribution (CID). We generate two sets of positive and negative counterfactuals, model their distributions using Kernel Density Estimation, and rank features based on a distributional dissimilarity measure. This measure, grounded in a rigorous mathematical framework, satisfies key properties required to function as a valid metric. We showcase the effectiveness of our method by comparing with well-established local feature importance explainers. Our method not only offers complementary perspectives to existing approaches, but also improves performance on faithfulness metrics (both for comprehensiveness and sufficiency), resulting in more faithful explanations of the system. These results highlight its potential as a valuable tool for model analysis."}
{"id": "2511.15375", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15375", "abs": "https://arxiv.org/abs/2511.15375", "authors": ["Lingxiang Wang", "Hainan Zhang", "Zhiming Zheng"], "title": "Parameter Importance-Driven Continual Learning for Foundation Models", "comment": null, "summary": "Domain-specific post-training often causes catastrophic forgetting, making foundation models lose their general reasoning ability and limiting their adaptability to dynamic real-world environments. Preserving general capabilities while acquiring downstream domain knowledge is a central challenge for large language and multimodal models. Traditional continual learning methods, such as regularization, replay and architectural isolation, suffer from poor downstream performance, reliance on inaccessible historical data, or additional parameter overhead. While recent parameter-efficient tuning (PET) methods can alleviate forgetting, their effectiveness strongly depends on the choice of parameters and update strategies. In this paper, we introduce PIECE, a Parameter Importance Estimation-based Continual Enhancement method that preserves general ability while efficiently learning domain knowledge without accessing prior training data or increasing model parameters. PIECE selectively updates only 0.1% of core parameters most relevant to new tasks, guided by two importance estimators: PIECE-F based on Fisher Information, and PIECE-S based on a second-order normalization that combines gradient and curvature information. Experiments across three language models and two multimodal models show that PIECE maintains general capabilities and achieves state-of-the-art continual learning performance across diverse downstream tasks. Our results highlight a practical path to scalable, domain-adaptive foundation models without catastrophic forgetting."}
{"id": "2511.15393", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15393", "abs": "https://arxiv.org/abs/2511.15393", "authors": ["Kunyu Zhang", "Mingxuan Wang", "Xiangjie Shi", "Haoxing Xu", "Chao Zhang"], "title": "EVA-Net: Interpretable Brain Age Prediction via Continuous Aging Prototypes from EEG", "comment": null, "summary": "The brain age is a key indicator of brain health. While electroencephalography (EEG) is a practical tool for this task, existing models struggle with the common challenge of imperfect medical data, such as learning a ``normal'' baseline from weakly supervised, healthy-only cohorts. This is a critical anomaly detection task for identifying disease, but standard models are often black boxes lacking an interpretable structure. We propose EVA-Net, a novel framework that recasts brain age as an interpretable anomaly detection problem. EVA-Net uses an efficient, sparsified-attention Transformer to model long EEG sequences. To handle noise and variability in imperfect data, it employs a Variational Information Bottleneck to learn a robust, compressed representation. For interpretability, this representation is aligned to a continuous prototype network that explicitly learns the normative healthy aging manifold. Trained on 1297 healthy subjects, EVA-Net achieves state-of-the-art accuracy. We validated its anomaly detection capabilities on an unseen cohort of 27 MCI and AD patients. This pathological group showed significantly higher brain-age gaps and a novel Prototype Alignment Error, confirming their deviation from the healthy manifold. EVA-Net provides an interpretable framework for healthcare intelligence using imperfect medical data."}
{"id": "2511.15409", "categories": ["cs.LG", "stat.ME"], "pdf": "https://arxiv.org/pdf/2511.15409", "abs": "https://arxiv.org/abs/2511.15409", "authors": ["Hany Abdulsamad", "Ángel F. García-Fernández", "Simo Särkkä"], "title": "Proximal Approximate Inference in State-Space Models", "comment": null, "summary": "We present a class of algorithms for state estimation in nonlinear, non-Gaussian state-space models. Our approach is based on a variational Lagrangian formulation that casts Bayesian inference as a sequence of entropic trust-region updates subject to dynamic constraints. This framework gives rise to a family of forward-backward algorithms, whose structure is determined by the chosen factorization of the variational posterior. By focusing on Gauss--Markov approximations, we derive recursive schemes with favorable computational complexity. For general nonlinear, non-Gaussian models we close the recursions using generalized statistical linear regression and Fourier--Hermite moment matching."}
{"id": "2511.15432", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15432", "abs": "https://arxiv.org/abs/2511.15432", "authors": ["Amir Rezaei Balef", "Mykhailo Koshil", "Katharina Eggensperger"], "title": "Towards Understanding Layer Contributions in Tabular In-Context Learning Models", "comment": "Accepted at the EurIPS 2025 Workshop on AI for Tabular Data", "summary": "Despite the architectural similarities between tabular in-context learning (ICL) models and large language models (LLMs), little is known about how individual layers contribute to tabular prediction. In this paper, we investigate how the latent spaces evolve across layers in tabular ICL models, identify potential redundant layers, and compare these dynamics with those observed in LLMs. We analyze TabPFN and TabICL through the \"layers as painters\" perspective, finding that only subsets of layers share a common representational language, suggesting structural redundancy and offering opportunities for model compression and improved interpretability."}
{"id": "2511.15447", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2511.15447", "abs": "https://arxiv.org/abs/2511.15447", "authors": ["Michel Tokic", "Slobodan Djukanović", "Anja von Beuningen", "Cheng Feng"], "title": "TSFM in-context learning for time-series classification of bearing-health status", "comment": "Preprint submitted to ESANN 2026", "summary": "This paper introduces a classification method using in-context learning in time-series foundation models (TSFM). We show how data, which was not part of the TSFM training data corpus, can be classified without the need of finetuning the model. Examples are represented in the form of targets (class id) and covariates (data matrix) within the prompt of the model, which enables to classify an unknown covariate data pattern alongside the forecast axis through in-context learning. We apply this method to vibration data for assessing the health state of a bearing within a servo-press motor. The method transforms frequency domain reference signals into pseudo time-series patterns, generates aligned covariate and target signals, and uses the TSFM to predict probabilities how classified data corresponds to predefined labels. Leveraging the scalability of pre-trained models this method demonstrates efficacy across varied operational conditions. This marks significant progress beyond custom narrow AI solutions towards broader, AI-driven maintenance systems."}
{"id": "2511.15454", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15454", "abs": "https://arxiv.org/abs/2511.15454", "authors": ["Ouiame Marnissi", "Hajar EL Hammouti", "El Houcine Bergou"], "title": "FairEnergy: Contribution-Based Fairness meets Energy Efficiency in Federated Learning", "comment": null, "summary": "Federated learning (FL) enables collaborative model training across distributed devices while preserving data privacy. However, balancing energy efficiency and fair participation while ensuring high model accuracy remains challenging in wireless edge systems due to heterogeneous resources, unequal client contributions, and limited communication capacity. To address these challenges, we propose FairEnergy, a fairness-aware energy minimization framework that integrates a contribution score capturing both the magnitude of updates and their compression ratio into the joint optimization of device selection, bandwidth allocation, and compression level. The resulting mixed-integer non-convex problem is solved by relaxing binary selection variables and applying Lagrangian decomposition to handle global bandwidth coupling, followed by per-device subproblem optimization. Experiments on non-IID data show that FairEnergy achieves higher accuracy while reducing energy consumption by up to 79\\% compared to baseline strategies."}
{"id": "2511.15487", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2511.15487", "abs": "https://arxiv.org/abs/2511.15487", "authors": ["Chen Zhang", "Wei Zuo", "Bingyang Cheng", "Yikun Wang", "Wei-Bin Kou", "Yik Chung WU", "Ngai Wong"], "title": "NTK-Guided Implicit Neural Teaching", "comment": "Preprint", "summary": "Implicit Neural Representations (INRs) parameterize continuous signals via multilayer perceptrons (MLPs), enabling compact, resolution-independent modeling for tasks like image, audio, and 3D reconstruction. However, fitting high-resolution signals demands optimizing over millions of coordinates, incurring prohibitive computational costs. To address it, we propose NTK-Guided Implicit Neural Teaching (NINT), which accelerates training by dynamically selecting coordinates that maximize global functional updates. Leveraging the Neural Tangent Kernel (NTK), NINT scores examples by the norm of their NTK-augmented loss gradients, capturing both fitting errors and heterogeneous leverage (self-influence and cross-coordinate coupling). This dual consideration enables faster convergence compared to existing methods. Through extensive experiments, we demonstrate that NINT significantly reduces training time by nearly half while maintaining or improving representation quality, establishing state-of-the-art acceleration among recent sampling-based strategies."}
{"id": "2511.15507", "categories": ["cs.LG", "cs.DS", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.15507", "abs": "https://arxiv.org/abs/2511.15507", "authors": ["Nika Haghtalab", "Omar Montasser", "Mingda Qiao"], "title": "Sample-Adaptivity Tradeoff in On-Demand Sampling", "comment": "50 pages, to appear at NeurIPS 2025", "summary": "We study the tradeoff between sample complexity and round complexity in on-demand sampling, where the learning algorithm adaptively samples from $k$ distributions over a limited number of rounds. In the realizable setting of Multi-Distribution Learning (MDL), we show that the optimal sample complexity of an $r$-round algorithm scales approximately as $dk^{Θ(1/r)} / ε$. For the general agnostic case, we present an algorithm that achieves near-optimal sample complexity of $\\widetilde O((d + k) / ε^2)$ within $\\widetilde O(\\sqrt{k})$ rounds. Of independent interest, we introduce a new framework, Optimization via On-Demand Sampling (OODS), which abstracts the sample-adaptivity tradeoff and captures most existing MDL algorithms. We establish nearly tight bounds on the round complexity in the OODS setting. The upper bounds directly yield the $\\widetilde O(\\sqrt{k})$-round algorithm for agnostic MDL, while the lower bounds imply that achieving sub-polynomial round complexity would require fundamentally new techniques that bypass the inherent hardness of OODS."}
{"id": "2511.15522", "categories": ["cs.LG", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.15522", "abs": "https://arxiv.org/abs/2511.15522", "authors": ["Yinan Yu", "Samuel Scheidegger"], "title": "PCARNN-DCBF: Minimal-Intervention Geofence Enforcement for Ground Vehicles", "comment": null, "summary": "Runtime geofencing for ground vehicles is rapidly emerging as a critical technology for enforcing Operational Design Domains (ODDs). However, existing solutions struggle to reconcile high-fidelity learning with the structural requirements of verifiable control. We address this by introducing PCARNN-DCBF, a novel pipeline integrating a Physics-encoded Control-Affine Residual Neural Network with a preview-based Discrete Control Barrier Function. Unlike generic learned models, PCARNN explicitly preserves the control-affine structure of vehicle dynamics, ensuring the linearity required for reliable optimization. This enables the DCBF to enforce polygonal keep-in constraints via a real-time Quadratic Program (QP) that handles high relative degree and mitigates actuator saturation. Experiments in CARLA across electric and combustion platforms demonstrate that this structure-preserving approach significantly outperforms analytical and unstructured neural baselines."}
{"id": "2511.14876", "categories": ["cs.CR", "cs.CV", "cs.LG", "cs.RO"], "pdf": "https://arxiv.org/pdf/2511.14876", "abs": "https://arxiv.org/abs/2511.14876", "authors": ["Henry Wong", "Clement Fung", "Weiran Lin", "Karen Li", "Stanley Chen", "Lujo Bauer"], "title": "Attacking Autonomous Driving Agents with Adversarial Machine Learning: A Holistic Evaluation with the CARLA Leaderboard", "comment": "12 pages", "summary": "To autonomously control vehicles, driving agents use outputs from a combination of machine-learning (ML) models, controller logic, and custom modules. Although numerous prior works have shown that adversarial examples can mislead ML models used in autonomous driving contexts, it remains unclear if these attacks are effective at producing harmful driving actions for various agents, environments, and scenarios.\n  To assess the risk of adversarial examples to autonomous driving, we evaluate attacks against a variety of driving agents, rather than against ML models in isolation. To support this evaluation, we leverage CARLA, an urban driving simulator, to create and evaluate adversarial examples. We create adversarial patches designed to stop or steer driving agents, stream them into the CARLA simulator at runtime, and evaluate them against agents from the CARLA Leaderboard, a public repository of best-performing autonomous driving agents from an annual research competition. Unlike prior work, we evaluate attacks against autonomous driving systems without creating or modifying any driving-agent code and against all parts of the agent included with the ML model.\n  We perform a case-study investigation of two attack strategies against three open-source driving agents from the CARLA Leaderboard across multiple driving scenarios, lighting conditions, and locations. Interestingly, we show that, although some attacks can successfully mislead ML models into predicting erroneous stopping or steering commands, some driving agents use modules, such as PID control or GPS-based rules, that can overrule attacker-manipulated predictions from ML models."}
{"id": "2511.14908", "categories": ["cs.CR", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.14908", "abs": "https://arxiv.org/abs/2511.14908", "authors": ["Gefté Almeida", "Marcio Pohlmann", "Alex Severo", "Diego Kreutz", "Tiago Heinrich", "Lourenço Pereira"], "title": "On-Premise SLMs vs. Commercial LLMs: Prompt Engineering and Incident Classification in SOCs and CSIRTs", "comment": "5 pages, 3 figures, 3 tables, submitted to ERRC/WRSeg 2025", "summary": "In this study, we evaluate open-source models for security incident classification, comparing them with proprietary models. We utilize a dataset of anonymized real incidents, categorized according to the NIST SP 800-61r3 taxonomy and processed using five prompt-engineering techniques (PHP, SHP, HTP, PRP, and ZSL). The results indicate that, although proprietary models still exhibit higher accuracy, locally deployed open-source models provide advantages in privacy, cost-effectiveness, and data sovereignty."}
{"id": "2511.15162", "categories": ["eess.SP", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.15162", "abs": "https://arxiv.org/abs/2511.15162", "authors": ["Ahmed Aboulfotouh", "Hatem Abou-Zeid"], "title": "Multimodal Wireless Foundation Models", "comment": null, "summary": "Wireless foundation models (WFMs) have recently demonstrated promising capabilities, jointly performing multiple wireless functions and adapting effectively to new environments. However, while current WFMs process only one modality, depending on the task and operating conditions, the most informative modality changes and no single modality is best for all tasks. WFMs should therefore be designed to accept multiple modalities to enable a broader and more diverse range of tasks and scenarios. In this work, we propose and build the first multimodal wireless foundation model capable of processing both raw IQ streams and image-like wireless modalities (e.g., spectrograms and CSI) and performing multiple tasks across both. We introduce masked wireless modeling for the multimodal setting, a self-supervised objective and pretraining recipe that learns a joint representation from IQ streams and image-like wireless modalities. We evaluate the model on five tasks across both modality families: image-based (human activity sensing, RF signal classification, 5G NR positioning) and IQ-based (RF device fingerprinting, interference detection/classification). The multimodal WFM is competitive with single-modality WFMs, and in several cases surpasses their performance. Our results demonstrates the strong potential of developing multimodal WFMs that support diverse wireless tasks across different modalities. We believe this provides a concrete step toward both AI-native 6G and the vision of joint sensing, communication, and localization."}
