{"id": "2601.10774", "categories": ["cs.LG", "hep-lat"], "pdf": "https://arxiv.org/pdf/2601.10774", "abs": "https://arxiv.org/abs/2601.10774", "authors": ["Mathis Gerdes", "Miranda C. N. Cheng"], "title": "Analytic Bijections for Smooth and Interpretable Normalizing Flows", "comment": "33 + 5 pages, 17 + 1 figures, 3 tables", "summary": "A key challenge in designing normalizing flows is finding expressive scalar bijections that remain invertible with tractable Jacobians. Existing approaches face trade-offs: affine transformations are smooth and analytically invertible but lack expressivity; monotonic splines offer local control but are only piecewise smooth and act on bounded domains; residual flows achieve smoothness but need numerical inversion. We introduce three families of analytic bijections -- cubic rational, sinh, and cubic polynomial -- that are globally smooth ($C^\\infty$), defined on all of $\\mathbb{R}$, and analytically invertible in closed form, combining the favorable properties of all prior approaches. These bijections serve as drop-in replacements in coupling flows, matching or exceeding spline performance. Beyond coupling layers, we develop radial flows: a novel architecture using direct parametrization that transforms the radial coordinate while preserving angular direction. Radial flows exhibit exceptional training stability, produce geometrically interpretable transformations, and on targets with radial structure can achieve comparable quality to coupling flows with $1000\\times$ fewer parameters. We provide comprehensive evaluation on 1D and 2D benchmarks, and demonstrate applicability to higher-dimensional physics problems through experiments on $φ^4$ lattice field theory, where our bijections outperform affine baselines and enable problem-specific designs that address mode collapse."}
{"id": "2601.10779", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.10779", "abs": "https://arxiv.org/abs/2601.10779", "authors": ["Qingyue Zhang", "Chang Chu", "Haohao Fu", "Tianren Peng", "Yanru Wu", "Guanbo Huang", "Yang Li", "Shao-Lun Huang"], "title": "Unified Optimization of Source Weights and Transfer Quantities in Multi-Source Transfer Learning: An Asymptotic Framework", "comment": null, "summary": "Transfer learning plays a vital role in improving model performance in data-scarce scenarios. However, naive uniform transfer from multiple source tasks may result in negative transfer, highlighting the need to properly balance the contributions of heterogeneous sources. Moreover, existing transfer learning methods typically focus on optimizing either the source weights or the amount of transferred samples, while largely neglecting the joint consideration of the other. In this work, we propose a theoretical framework, Unified Optimization of Weights and Quantities (UOWQ), which formulates multi-source transfer learning as a parameter estimation problem grounded in an asymptotic analysis of a Kullback-Leibler divergence-based generalization error measure. The proposed framework jointly determines the optimal source weights and optimal transfer quantities for each source task. Firstly, we prove that using all available source samples is always optimal once the weights are properly adjusted, and we provide a theoretical explanation for this phenomenon. Moreover, to determine the optimal transfer weights, our analysis yields closed-form solutions in the single-source setting and develops a convex optimization-based numerical procedure for the multi-source case. Building on the theoretical results, we further propose practical algorithms for both multi-source transfer learning and multi-task learning settings. Extensive experiments on real-world benchmarks, including DomainNet and Office-Home, demonstrate that UOWQ consistently outperforms strong baselines. The results validate both the theoretical predictions and the practical effectiveness of our framework."}
{"id": "2601.10801", "categories": ["cs.LG", "hep-ex", "physics.ins-det", "quant-ph"], "pdf": "https://arxiv.org/pdf/2601.10801", "abs": "https://arxiv.org/abs/2601.10801", "authors": ["Alberto Coppi", "Ema Puljak", "Lorenzo Borella", "Daniel Jaschke", "Enrique Rico", "Maurizio Pierini", "Jacopo Pazzini", "Andrea Triossi", "Simone Montangero"], "title": "Towards Tensor Network Models for Low-Latency Jet Tagging on FPGAs", "comment": "10 pages, 8 figures", "summary": "We present a systematic study of Tensor Network (TN) models $\\unicode{x2013}$ Matrix Product States (MPS) and Tree Tensor Networks (TTN) $\\unicode{x2013}$ for real-time jet tagging in high-energy physics, with a focus on low-latency deployment on Field Programmable Gate Arrays (FPGAs). Motivated by the strict requirements of the HL-LHC Level-1 trigger system, we explore TNs as compact and interpretable alternatives to deep neural networks. Using low-level jet constituent features, our models achieve competitive performance compared to state-of-the-art deep learning classifiers. We investigate post-training quantization to enable hardware-efficient implementations without degrading classification performance or latency. The best-performing models are synthesized to estimate FPGA resource usage, latency, and memory occupancy, demonstrating sub-microsecond latency and supporting the feasibility of online deployment in real-time trigger systems. Overall, this study highlights the potential of TN-based models for fast and resource-efficient inference in low-latency environments."}
{"id": "2601.10778", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.10778", "abs": "https://arxiv.org/abs/2601.10778", "authors": ["Praneeth Kumar Vippathalla", "Justin P. Coon", "Mihai-Alin Badiu"], "title": "On the Entropy of a Random Geometric Graph", "comment": "13 pages, 2 figures", "summary": "In this paper, we study the entropy of a hard random geometric graph (RGG), a commonly used model for spatial networks, where the connectivity is governed by the distances between the nodes. Formally, given a connection range $r$, a hard RGG $G_m$ on $m$ vertices is formed by drawing $m$ random points from a spatial domain, and then connecting any two points with an edge when they are within a distance $r$ from each other. The two domains we consider are the $d$-dimensional unit cube $[0,1]^d$ and the $d$-dimensional unit torus $\\mathbb{T}^d$. We derive upper bounds on the entropy $H(G_m)$ for both these domains and for all possible values of $r$. In a few cases, we obtain an exact asymptotic characterization of the entropy by proving a tight lower bound. Our main results are that $H(G_m) \\sim dm \\log_2m$ for $0 < r \\leq 1/4$ in the case of $\\mathbb{T}^d$ and that the entropy of a one-dimensional RGG on $[0,1]$ behaves like $m\\log m$ for all $0<r<1$. As a consequence, we can infer that the asymptotic structural entropy of an RGG on $\\mathbb{T}^d$, which is the entropy of an unlabelled RGG, is $Ω((d-1)m \\log_2m)$ for $0 < r \\leq 1/4$. For the rest of the cases, we conjecture that the entropy behaves asymptotically as the leading order terms of our derived upper bounds."}
{"id": "2601.11385", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2601.11385", "abs": "https://arxiv.org/abs/2601.11385", "authors": ["Giovanni Apruzzese", "Aurore Fass"], "title": "X-raying the arXiv: A Large-Scale Analysis of arXiv Submissions' Source Files", "comment": null, "summary": "arXiv is the largest open-access repository for scientific literature. When submitting a paper, authors upload the manuscript's source files, from which the final PDF is compiled. These source files are also publicly downloadable, potentially exposing data unrelated to the published paper -- such as figures, documents, or comments -- that may unintentionally reveal confidential information or simply waste storage space. We thus ask ourselves: \"What can be found within the source files of arXiv submissions?\"\n  We present a longitudinal analysis of ~600,000 submissions appeared on arXiv between 2015--2025. For each submission, we examine the uploaded source files to quantify and characterize data not required for producing the respective PDF. On average, 27% of the data in each submission are unnecessary, totaling >580 GB of redundant content across our dataset. Qualitative inspection reveals the presence of offensive/inappropriate text (e.g., \"WTF does this mean?\") and experimental details that could disclose ongoing research. We have contacted arXiv's leadership team, as well as the authors of affected papers to alert them of these issues. Finally, we propose recommendations and an automated tool to detect and analyze arXiv submissions residual data at scale, aiming to improve data hygiene in the arXiv's ecosystem."}
{"id": "2601.10810", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.10810", "abs": "https://arxiv.org/abs/2601.10810", "authors": ["Mengmeng Peng", "Zhenyu Fang", "He Sun"], "title": "Digital Metabolism: Decoupling Logic from Facts via Regenerative Unlearning -- Towards a Pure Neural Logic Core", "comment": null, "summary": "Large language models (LLMs) currently suffer from parameter entanglement, where general reasoning capabilities (logic) and specific factual knowledge (facts) exist in a superposition state within shared weights. This coupling leads to the \"memory wall,\" where computational capacity is squandered on simulating retrieval, often resulting in hallucinations. In this paper, we propose \"digital metabolism,\" a thermodynamic hypothesis suggesting that targeted forgetting is necessary for distilling a pure neural logic core. To validate this hypothesis, we introduce the Regenerative Logic-Core Protocol (RLCP), a dual-stream training framework that renders specific factual dependencies linearly undecodable via deep-layer gradient reversal. Applying RLCP to Qwen2.5-0.5B, we observe a distinct phase transition: the model achieves near-zero retention of targeted factual associations (Accuracy < 7%) while exhibiting changes consistent with an emergent \"structural crystallization\" effect. Empirical analysis on GSM8K reveals that the \"metabolized\" model spontaneously adopts chain-of-thought (CoT) scaffolding, which we interpret as compensating for the loss of direct associative recall (shifting from $O(1)$ recall to $O(N)$ reasoning). While the causal mechanism underlying this behavioral shift requires further investigation, our findings provide a dynamic weight-level counterpart to architectural innovations like DeepSeek's Engram, paving the way for modular \"Neural CPU + Symbolic RAM\" architectures."}
{"id": "2601.10808", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.10808", "abs": "https://arxiv.org/abs/2601.10808", "authors": ["Mikhail Chernikov", "Peter Trifonov"], "title": "Efficient LLR-Domain Decoding of ABS+ Polar Codes", "comment": null, "summary": "ABS+ polar codes are a generalization of Arikan polar codes that provides much faster polarization. We present an LLR-domain implementation of the SCL decoder of ABS+ polar codes. Furthermore, we optimize the SCL algorithm in order to reduce the complexity requirements for the LLRs computation. In comparison with classical polar codes, the proposed approach requires less number of arithmetic operations in the SCL decoder to obtain the fixed frame error rate (FER) at high-SNR region."}
{"id": "2601.11457", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2601.11457", "abs": "https://arxiv.org/abs/2601.11457", "authors": ["Joshua Roy Palathinkal", "Muhammad Iqbal Rochman", "Vanlin Sathya", "Mehmet Yavuz", "Monisha Ghosh"], "title": "Indoor Neutral-Host Networks Over Shared Spectrum and Shared Infrastructure: A Comparison Study of Real-World Deployments", "comment": "Submitted to npj Wireless Technology. 21 pages, 12 figures, 7 tables", "summary": "Indoor high-capacity connectivity is frequently constrained by significant building penetration loss and the inherent uplink power limitations of a typical outdoor macro-cell deployment. While Mobile Network Operators (MNOs) must optimize spectrum across low-band (<1 GHz) and mid-band (1-7 GHz) frequencies, uplink performance remains disproportionately degraded due to link budget asymmetry. Neutral-host (NH) networking provides a scalable alternative by transparently offloading MNO subscribers via spectrum sharing and shared infrastructure. We present a multi-site measurement study comparing Citizens Broadband Radio Service (CBRS)-enabled NH networks against public MNO 4G/5G macro deployments and Wi-Fi. Our results show: (i) significant building penetration loss with up to 15.5 dB in low-bands and 17.9 dB in mid-bands, resulting in a ~10 dB RSRP deficit for MNO mid-bands compared to low-bands; (ii) NH networks provide a 30 dB higher median indoor RSRP with indoor NH normalized downlink throughput matches MNO outdoor performance, while its uplink performance exceeds MNO levels in both indoor and outdoor settings; (iii) NH proximity enables superior uplink efficiency, utilizing 64-QAM for 56% of transmissions (versus <6% for MNOs) and reducing median UE transmit power by 5 dB; (iv) MNOs rely on low-band spectrum for indoor uplink transmissions, while the NH deployment maintains high-performance mid-band connectivity; and (v) NH outperforms MNOs in end-to-end throughput but trails Wi-Fi in uplink throughput and latency due to packet routing overhead to the MNO core."}
{"id": "2601.10754", "categories": ["cs.CR", "cs.CY", "cs.HC"], "pdf": "https://arxiv.org/pdf/2601.10754", "abs": "https://arxiv.org/abs/2601.10754", "authors": ["Hsuen-Chi Chiu", "Jeremy Foote"], "title": "Chatting with Confidants or Corporations? Privacy Management with AI Companions", "comment": null, "summary": "AI chatbots designed as emotional companions blur the boundaries between interpersonal intimacy and institutional software, creating a complex, multi-dimensional privacy environment. Drawing on Communication Privacy Management theory and Masur's horizontal (user-AI) and vertical (user-platform) privacy framework, we conducted in-depth interviews with fifteen users of companion AI platforms such as Replika and Character.AI. Our findings reveal that users blend interpersonal habits with institutional awareness: while the non-judgmental, always-available nature of chatbots fosters emotional safety and encourages self-disclosure, users remain mindful of institutional risks and actively manage privacy through layered strategies and selective sharing. Despite this, many feel uncertain or powerless regarding platform-level data control. Anthropomorphic design further blurs privacy boundaries, sometimes leading to unintentional oversharing and privacy turbulence. These results extend privacy theory by highlighting the unique interplay of emotional and institutional privacy management in human-AI companionship."}
{"id": "2601.10861", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10861", "abs": "https://arxiv.org/abs/2601.10861", "authors": ["Brandon D'Agostino", "Jimmy Chen", "Ram Rajagopal"], "title": "Beyond Uptime: Actionable Performance Metrics for EV Charging Site Operators", "comment": null, "summary": "The transition to electric vehicles (EVs) depends heavily on the reliability of charging infrastructure, yet approximately 1 in 5 drivers report being unable to charge during station visits due to inoperable equipment. While regulatory efforts such as the National Electric Vehicle Infrastructure (NEVI) program have established uptime requirements, these metrics are often simplistic, delayed, and fail to provide the diagnostic granularity needed by Charging Site Operators (CSOs). Despite their pivotal role in maintaining and improving site performance, CSOs have been largely overlooked by existing reporting standards. In this paper, we propose a suite of readily computable, actionable performance metrics-Fault Time, Fault-Reason Time, and Unreachable Time-that decompose charger behavior into operationally meaningful states. Unlike traditional uptime, these metrics are defined over configurable periods and distinguish between hardware malfunctions and network connectivity issues. We demonstrate the implementation of these metrics via an open-source tool that derives performance data from existing infrastructure without requiring hardware modifications. A case study involving 98 chargers at a California academic institution spanning 2018-2024 demonstrates that these metrics reveal persistent \"zombie chargers\" and high-frequency network instability that remain hidden in standard annual reporting."}
{"id": "2601.10727", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10727", "abs": "https://arxiv.org/abs/2601.10727", "authors": ["Sanghyun Kim", "Jiwon Seo"], "title": "Zonotope Shadow and Reflection Matching: A Novel GNSS Reflection-Based Framework for Enhanced Positioning Accuracy in Urban Areas", "comment": "Submitted to IEEE T-ITS", "summary": "In urban areas, signal reception conditions are often poor due to reflections from buildings, resulting in inaccurate global navigation satellite system (GNSS)-based positioning. Various 3D-mapping-aided (3DMA) GNSS techniques, including shadow matching, have been proposed to address this issue. However, conventional shadow matching estimates positions in a discretized manner. The accuracy of this approach is limited by the resolution of the grid points representing the candidate receiver positions, making it difficult to achieve robust urban positioning and to ensure that the position estimate satisfies user-specified protection levels or safety bounds. To overcome these limitations, zonotope shadow matching (ZSM) has been proposed, which utilizes a set-based position estimate rather than grid-based estimates. ZSM calculates the GNSS shadow--an area on the ground where the line-of-sight (LOS) is blocked and only non-line-of-sight (NLOS) signals can be received--to estimate the receiver's position set. ZSM distinguishes between LOS and NLOS satellites, determining that the receiver is inside the GNSS shadow if the satellite is NLOS and outside if the satellite is LOS. However, relying solely on GNSS shadows limits the ability to sufficiently reduce the size of the receiver position set and to precisely estimate the receiver's location. To address this, we propose zonotope shadow and reflection matching (ZSRM) to enhance positioning accuracy in urban areas. The proposed ZSRM technique is validated through field tests using GNSS signals collected in an urban environment. Consequently, the RMS horizontal position error of ZSRM improved by 10.0% to 53.6% compared with ZSM, while the RMS cross-street and along-street position bounds improved by 18.0% to 50.1% and 30.7% to 59.3%, respectively."}
{"id": "2601.10820", "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.MA"], "pdf": "https://arxiv.org/pdf/2601.10820", "abs": "https://arxiv.org/abs/2601.10820", "authors": ["Himanshu Thakur", "Anusha Kamath", "Anurag Muthyala", "Dhwani Sanmukhani", "Smruthi Mukund", "Jay Katukuri"], "title": "Towards Reliable ML Feature Engineering via Planning in Constrained-Topology of LLM Agents", "comment": null, "summary": "Recent advances in code generation models have unlocked unprecedented opportunities for automating feature engineering, yet their adoption in real-world ML teams remains constrained by critical challenges: (i) the scarcity of datasets capturing the iterative and complex coding processes of production-level feature engineering, (ii) limited integration and personalization of widely used coding agents, such as CoPilot and Devin, with a team's unique tools, codebases, workflows, and practices, and (iii) suboptimal human-AI collaboration due to poorly timed or insufficient feedback. We address these challenges with a planner-guided, constrained-topology multi-agent framework that generates code for repositories in a multi-step fashion. The LLM-powered planner leverages a team's environment, represented as a graph, to orchestrate calls to available agents, generate context-aware prompts, and use downstream failures to retroactively correct upstream artifacts. It can request human intervention at critical steps, ensuring generated code is reliable, maintainable, and aligned with team expectations. On a novel in-house dataset, our approach achieves 38% and 150% improvement in the evaluation metric over manually crafted and unplanned workflows respectively. In practice, when building features for recommendation models serving over 120 million users, our approach has delivered real-world impact by reducing feature engineering cycles from three weeks to a single day."}
{"id": "2601.10883", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.10883", "abs": "https://arxiv.org/abs/2601.10883", "authors": ["Andrea Rondelli"], "title": "A Differential Geometry and Algebraic Topology Based Public-Key Cryptographic Algorithm in Presence of Quantum Adversaries", "comment": null, "summary": "In antiquity, the seal embodied trust, secrecy, and integrity in safeguarding the exchange of letters and messages. The purpose of this work is to continue this tradition in the contemporary era, characterized by the presence of quantum computers, classical supercomputers, and increasingly sophisticated artificial intelligence. We introduce Z-Sigil, an asymmetric public-key cryptographic algorithm grounded in functional analysis, differential geometry, and algebraic topology, with the explicit goal of achieving resistance against both classical and quantum attacks. The construction operates over the tangent fiber bundle of a compact Calabi-Yau manifold [13], where cryptographic keys are elements of vector tangent fibers, with a binary operation defined on tangent spaces of the base manifold giving rise to a groupoid structure. Encryption and decryption are performed iteratively on message blocks, enforcing a serial architecture designed to limit quantum parallelism [9,10]. Each block depends on secret geometric and analytic data, including a randomly chosen base point on the manifold, a selected section of the tangent fiber bundle, and auxiliary analytic data derived from operator determinants and Zeta function regularization [11]. The correctness and invertibility of the proposed algorithm are proven analytically. Furthermore, any adversarial attempt to recover the plaintext without the private key leads to an exponential growth of the adversarial search space,even under quantum speedups. The use of continuous geometric structures,non-linear operator compositions,and enforced blockwise serialization distinguishes this approach from existing quantum-safe cryptographic proposals based on primary discrete algebraic assumptions."}
{"id": "2601.10743", "categories": ["eess.SP", "cs.LG", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.10743", "abs": "https://arxiv.org/abs/2601.10743", "authors": ["Ayesh Abu Lehyeh", "Anastassia Gharib", "Tian Xia", "Dryver Huston", "Safwan Wshah"], "title": "UBiGTLoc: A Unified BiLSTM-Graph Transformer Localization Framework for IoT Sensor Networks", "comment": "Accepted and published in IEEE Internet of Things Journal", "summary": "Sensor nodes localization in wireless Internet of Things (IoT) sensor networks is crucial for the effective operation of diverse applications, such as smart cities and smart agriculture. Existing sensor nodes localization approaches heavily rely on anchor nodes within wireless sensor networks (WSNs). Anchor nodes are sensor nodes equipped with global positioning system (GPS) receivers and thus, have known locations. These anchor nodes operate as references to localize other sensor nodes. However, the presence of anchor nodes may not always be feasible in real-world IoT scenarios. Additionally, localization accuracy can be compromised by fluctuations in Received Signal Strength Indicator (RSSI), particularly under non-line-of-sight (NLOS) conditions. To address these challenges, we propose UBiGTLoc, a Unified Bidirectional Long Short-Term Memory (BiLSTM)-Graph Transformer Localization framework. The proposed UBiGTLoc framework effectively localizes sensor nodes in both anchor-free and anchor-presence WSNs. The framework leverages BiLSTM networks to capture temporal variations in RSSI data and employs Graph Transformer layers to model spatial relationships between sensor nodes. Extensive simulations demonstrate that UBiGTLoc consistently outperforms existing methods and provides robust localization across both dense and sparse WSNs while relying solely on cost-effective RSSI data."}
{"id": "2601.10758", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.10758", "abs": "https://arxiv.org/abs/2601.10758", "authors": ["Fengchao Chen", "Tingmin Wu", "Van Nguyen", "Carsten Rudolph"], "title": "Too Helpful to Be Safe: User-Mediated Attacks on Planning and Web-Use Agents", "comment": "Keywords: LLM Agents; User-Mediated Attack; Agent Security; Human Factors in Cybersecurity; Web-Use Agents; Planning Agents; Benchmark", "summary": "Large Language Models (LLMs) have enabled agents to move beyond conversation toward end-to-end task execution and become more helpful. However, this helpfulness introduces new security risks stem less from direct interface abuse than from acting on user-provided content. Existing studies on agent security largely focus on model-internal vulnerabilities or adversarial access to agent interfaces, overlooking attacks that exploit users as unintended conduits. In this paper, we study user-mediated attacks, where benign users are tricked into relaying untrusted or attacker-controlled content to agents, and analyze how commercial LLM agents respond under such conditions. We conduct a systematic evaluation of 12 commercial agents in a sandboxed environment, covering 6 trip-planning agents and 6 web-use agents, and compare agent behavior across scenarios with no, soft, and hard user-requested safety checks. Our results show that agents are too helpful to be safe by default. Without explicit safety requests, trip-planning agents bypass safety constraints in over 92% of cases, converting unverified content into confident booking guidance. Web-use agents exhibit near-deterministic execution of risky actions, with 9 out of 17 supported tests reaching a 100% bypass rate. Even when users express soft or hard safety intent, constraint bypass remains substantial, reaching up to 54.7% and 7% for trip-planning agents, respectively. These findings reveal that the primary issue is not a lack of safety capability, but its prioritization. Agents invoke safety checks only conditionally when explicitly prompted, and otherwise default to goal-driven execution. Moreover, agents lack clear task boundaries and stopping rules, frequently over-executing workflows in ways that lead to unnecessary data disclosure and real-world harm."}
{"id": "2601.10867", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10867", "abs": "https://arxiv.org/abs/2601.10867", "authors": ["Davide Mannini", "James B. Rawlings"], "title": "Disturbance Attenuation Regulator I-A: Signal Bound Finite Horizon Solution", "comment": null, "summary": "This paper develops a generalized finite horizon recursive solution to the discrete time signal bound disturbance attenuation regulator (SiDAR) for state feedback control. This problem addresses linear dynamical systems subject to signal bound disturbances, i.e., disturbance sequences whose squared signal two-norm is bounded by a fixed budget. The term generalized indicates that the results accommodate arbitrary initial states. By combining game theory and dynamic programming, we derive a recursive solution for the optimal state feedback policy valid for arbitrary initial states. The optimal policy is nonlinear in the state and requires solving a tractable convex scalar optimization for the Lagrange multiplier at each stage; the control is then explicit. For fixed disturbance budget $α$, the state space partitions into two distinct regions: $\\mathcal{X}_L(α)$, where the optimal control policy is linear and coincides with the standard linear $H_{\\infty}$ state feedback control, and $\\mathcal{X}_{NL}(α)$, where the optimal control policy is nonlinear. We establish monotonicity and boundedness of the associated Riccati recursions and characterize the geometry of the solution regions. A numerical example illustrates the theoretical properties.\n  This work provides a complete feedback solution to the finite horizon SiDAR for arbitrary initial states. Companion papers address the steady-state problem and convergence properties for the signal bound case, and the stage bound disturbance attenuation regulator (StDAR)."}
{"id": "2601.10733", "categories": ["eess.SP", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.10733", "abs": "https://arxiv.org/abs/2601.10733", "authors": ["Jakob Struye", "Nabeel Nisar Bhat", "Siddhartha Kumar", "Mohammad Hossein Moghaddam", "Jeroen Famaey"], "title": "Millimeter-Wave Gesture Recognition in ISAC: Does Reducing Sensing Airtime Hamper Accuracy?", "comment": null, "summary": "Most Integrated Sensing and Communications (ISAC) systems require dividing airtime across their two modes. However, the specific impact of this decision on sensing performance remains unclear and underexplored. In this paper, we therefore investigate the impact on a gesture recognition system using a Millimeter-Wave (mmWave) ISAC system. With our dataset of power per beam pair gathered with two mmWave devices performing constant beam sweeps while test subjects performed distinct gestures, we train a gesture classifier using Convolutional Neural Networks. We then subsample these measurements, emulating reduced sensing airtime, showing that a sensing airtime of 25 % only reduces classification accuracy by 0.15 percentage points from full-time sensing. Alongside this high-quality sensing at low airtime, mmWave systems are known to provide extremely high data throughputs, making mmWave ISAC a prime enabler for applications such as truly wireless Extended Reality."}
{"id": "2601.10823", "categories": ["cs.LG", "cs.AR"], "pdf": "https://arxiv.org/pdf/2601.10823", "abs": "https://arxiv.org/abs/2601.10823", "authors": ["Daniel Price", "Prabhu Vellaisamy", "John Shen", "Di Wu"], "title": "Mugi: Value Level Parallelism For Efficient LLMs", "comment": "2026 International Conference on Architectural Support for Programming Languages and Operating Systems", "summary": "Value level parallelism (VLP) has been proposed to improve the efficiency of large-batch, low-precision general matrix multiply (GEMM) between symmetric activations and weights. In transformer based large language models (LLMs), there exist more sophisticated operations beyond activation-weight GEMM. In this paper, we explore how VLP benefits LLMs. First, we generalize VLP for nonlinear approximations, outperforming existing nonlinear approximations in end-to-end LLM accuracy, performance, and efficiency. Our VLP approximation follows a value-centric approach, where important values are assigned with greater accuracy. Second, we optimize VLP for small-batch GEMMs with asymmetric inputs efficiently, which leverages timely LLM optimizations, including weight-only quantization, key-value (KV) cache quantization, and group query attention. Finally, we design a new VLP architecture, Mugi, to encapsulate the innovations above and support full LLM workloads, while providing better performance, efficiency and sustainability. Our experimental results show that Mugi can offer significant improvements on throughput and energy efficiency, up to $45\\times$ and $668\\times$ for nonlinear softmax operations, and $2.07\\times$ and $3.11\\times$ for LLMs, and also decrease operational carbon for LLM operation by $1.45\\times$ and embodied carbon by $1.48\\times$."}
{"id": "2601.10915", "categories": ["cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10915", "abs": "https://arxiv.org/abs/2601.10915", "authors": ["Yangshuo He", "Guanding Yu", "Jingge Zhu"], "title": "A PAC-Bayesian Analysis of Channel-Induced Degradation in Edge Inference", "comment": null, "summary": "In the emerging paradigm of edge inference, neural networks (NNs) are partitioned across distributed edge devices that collaboratively perform inference via wireless transmission. However, standard NNs are generally trained in a noiseless environment, creating a mismatch with the noisy channels during edge deployment. In this paper, we address this issue by characterizing the channel-induced performance deterioration as a generalization error against unseen channels. We introduce an augmented NN model that incorporates channel statistics directly into the weight space, allowing us to derive PAC-Bayesian generalization bounds that explicitly quantifies the impact of wireless distortion. We further provide closed-form expressions for practical channels to demonstrate the tractability of these bounds. Inspired by the theoretical results, we propose a channel-aware training algorithm that minimizes a surrogate objective based on the derived bound. Simulations show that the proposed algorithm can effectively improve inference accuracy by leveraging channel statistics, without end-to-end re-training."}
{"id": "2601.10958", "categories": ["cs.IT", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.10958", "abs": "https://arxiv.org/abs/2601.10958", "authors": ["Christo Kurisummoottil Thomas", "Mingzhe Chen"], "title": "Fundamental Limits of Quantum Semantic Communication via Sheaf Cohomology", "comment": null, "summary": "Semantic communication (SC) enables bandwidth-efficient coordination in multi-agent systems by transmitting meaning rather than raw bits. However, when agents employ heterogeneous sensing modalities and AI architectures, perfect bit-level transmission no longer guarantees mutual understanding. Although deep learning methods for semantic compression have advanced, the information-theoretic limits of semantic alignment under heterogeneity remain poorly understood. Notably, semantic ambiguity shares the same mathematical structure as quantum contextuality, as both arise from cohomological obstructions, motivating a quantum formulation of SC. In this paper, an information-theoretic framework for quantum semantic communication is proposed using sheaf cohomology. Multi-agent semantic networks are modeled as quantum sheaves, where agents meaning spaces are Hilbert spaces connected by quantum channels. The first sheaf cohomology group is shown to characterize irreducible semantic ambiguity, representing a fundamental obstruction to alignment that no local processing can resolve. The minimum communication rate required for semantic alignment is proven to scale with the logarithm of the dimension of the cohomological space, establishing a semantic analog of Shannon limits. For entanglement-assisted channels, the achievable capacity is shown to strictly exceed classical bounds, with each shared ebit reducing the required classical communication by one bit, providing a rigorous interpretation of shared context. Additionally, quantum contextuality is shown to reduce cohomological obstructions, and a duality between quantum discord and integrated semantic information is established, linking quantum correlations to irreducible semantic content. This framework provides rigorous foundations for quantum-enhanced semantic communication in autonomous multi-agent systems."}
{"id": "2601.10848", "categories": ["cs.CR", "cs.SE"], "pdf": "https://arxiv.org/pdf/2601.10848", "abs": "https://arxiv.org/abs/2601.10848", "authors": ["Xinrui Zhang", "Pincan Zhao", "Jason Jaskolka", "Heng Li", "Rongxing Lu"], "title": "SecMLOps: A Comprehensive Framework for Integrating Security Throughout the MLOps Lifecycle", "comment": null, "summary": "Machine Learning (ML) has emerged as a pivotal technology in the operation of large and complex systems, driving advancements in fields such as autonomous vehicles, healthcare diagnostics, and financial fraud detection. Despite its benefits, the deployment of ML models brings significant security challenges, such as adversarial attacks, which can compromise the integrity and reliability of these systems. To address these challenges, this paper builds upon the concept of Secure Machine Learning Operations (SecMLOps), providing a comprehensive framework designed to integrate robust security measures throughout the entire ML operations (MLOps) lifecycle. SecMLOps builds on the principles of MLOps by embedding security considerations from the initial design phase through to deployment and continuous monitoring. This framework is particularly focused on safeguarding against sophisticated attacks that target various stages of the MLOps lifecycle, thereby enhancing the resilience and trustworthiness of ML applications. A detailed advanced pedestrian detection system (PDS) use case demonstrates the practical application of SecMLOps in securing critical MLOps. Through extensive empirical evaluations, we highlight the trade-offs between security measures and system performance, providing critical insights into optimizing security without unduly impacting operational efficiency. Our findings underscore the importance of a balanced approach, offering valuable guidance for practitioners on how to achieve an optimal balance between security and performance in ML deployments across various domains."}
{"id": "2601.10868", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10868", "abs": "https://arxiv.org/abs/2601.10868", "authors": ["Davide Mannini", "James B. Rawlings"], "title": "Disturbance Attenuation Regulator I-B: Signal Bound Convergence and Steady-State", "comment": null, "summary": "This paper establishes convergence and steady-state properties for the signal bound disturbance attenuation regulator (SiDAR). Building on the finite horizon recursive solution developed in a companion paper, we introduce the steady-state SiDAR and derive its tractable linear matrix inequality (LMI) with $O(n^3)$ complexity. Systems are classified as degenerate or nondegenerate based on steady-state solution properties. For nondegenerate systems, the finite horizon solution converges to the steady-state solution for all states as the horizon approaches infinity. For degenerate systems, convergence holds in one region of the state space, while a turnpike arises in the complementary region. When convergence holds, the optimal multiplier and control gain are obtained directly from the LMI solution. Numerical examples illustrate convergence behavior and turnpike phenomena.\n  Companion papers address the finite horizon SiDAR solution and the stage bound disturbance attenuation regulator (StDAR)."}
{"id": "2601.10735", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10735", "abs": "https://arxiv.org/abs/2601.10735", "authors": ["Lizy Abraham", "Siobhan Coughlan", "Kritika Rajain", "Changhong Li", "Saji Philip", "Adam James"], "title": "SSC-UNet: UNet with Self-Supervised Contrastive Learning for Phonocardiography Noise Reduction", "comment": "Accepted by IEEE Healthcom 2025", "summary": "Congenital Heart Disease (CHD) remains a significant global health concern affecting approximately 1\\% of births worldwide. Phonocardiography has emerged as a supplementary tool to diagnose CHD cost-effectively. However, the performance of these diagnostic models highly depends on the quality of the phonocardiography, thus, noise reduction is particularly critical. Supervised UNet effectively improves noise reduction capabilities, but limited clean data hinders its application. The complex time-frequency characteristics of phonocardiography further complicate finding the balance between effectively removing noise and preserving pathological features. In this study, we proposed a self-supervised phonocardiography noise reduction model based on Noise2Noise to enable training without clean data. Augmentation and contrastive learning are applied to enhance its performance. We obtained an average SNR of 12.98 dB after filtering under 10~dB of hospital noise. Classification sensitivity after filtering was improved from 27\\% to 88\\%, indicating its promising pathological feature retention capabilities in practical noisy environments."}
{"id": "2601.10859", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10859", "abs": "https://arxiv.org/abs/2601.10859", "authors": ["Dat Quoc Ha", "Md Ferdous Alam", "Markus J. Buehler", "Faez Ahmed", "Josephine V. Carstensen"], "title": "AI-Guided Human-In-the-Loop Inverse Design of High Performance Engineering Structures", "comment": "21 pages, 10 figures", "summary": "Inverse design tools such as Topology Optimization (TO) can achieve new levels of improvement for high-performance engineered structures. However, widespread use is hindered by high computational times and a black-box nature that inhibits user interaction. Human-in-the-loop TO approaches are emerging that integrate human intuition into the design generation process. However, these rely on the time-consuming bottleneck of iterative region selection for design modifications. To reduce the number of iterative trials, this contribution presents an AI co-pilot that uses machine learning to predict the user's preferred regions. The prediction model is configured as an image segmentation task with a U-Net architecture. It is trained on synthetic datasets where human preferences either identify the longest topological member or the most complex structural connection. The model successfully predicts plausible regions for modification and presents them to the user as AI recommendations. The human preference model demonstrates generalization across diverse and non-standard TO problems and exhibits emergent behavior outside the single-region selection training data. Demonstration examples show that the new human-in-the-loop TO approach that integrates the AI co-pilot can improve manufacturability or improve the linear buckling load by 39% while only increasing the total design time by 15 sec compared to conventional simplistic TO."}
{"id": "2601.10958", "categories": ["cs.IT", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.10958", "abs": "https://arxiv.org/abs/2601.10958", "authors": ["Christo Kurisummoottil Thomas", "Mingzhe Chen"], "title": "Fundamental Limits of Quantum Semantic Communication via Sheaf Cohomology", "comment": null, "summary": "Semantic communication (SC) enables bandwidth-efficient coordination in multi-agent systems by transmitting meaning rather than raw bits. However, when agents employ heterogeneous sensing modalities and AI architectures, perfect bit-level transmission no longer guarantees mutual understanding. Although deep learning methods for semantic compression have advanced, the information-theoretic limits of semantic alignment under heterogeneity remain poorly understood. Notably, semantic ambiguity shares the same mathematical structure as quantum contextuality, as both arise from cohomological obstructions, motivating a quantum formulation of SC. In this paper, an information-theoretic framework for quantum semantic communication is proposed using sheaf cohomology. Multi-agent semantic networks are modeled as quantum sheaves, where agents meaning spaces are Hilbert spaces connected by quantum channels. The first sheaf cohomology group is shown to characterize irreducible semantic ambiguity, representing a fundamental obstruction to alignment that no local processing can resolve. The minimum communication rate required for semantic alignment is proven to scale with the logarithm of the dimension of the cohomological space, establishing a semantic analog of Shannon limits. For entanglement-assisted channels, the achievable capacity is shown to strictly exceed classical bounds, with each shared ebit reducing the required classical communication by one bit, providing a rigorous interpretation of shared context. Additionally, quantum contextuality is shown to reduce cohomological obstructions, and a duality between quantum discord and integrated semantic information is established, linking quantum correlations to irreducible semantic content. This framework provides rigorous foundations for quantum-enhanced semantic communication in autonomous multi-agent systems."}
{"id": "2601.11498", "categories": ["cs.IT", "cs.NI", "eess.SP", "quant-ph"], "pdf": "https://arxiv.org/pdf/2601.11498", "abs": "https://arxiv.org/abs/2601.11498", "authors": ["Alptug Aytekin", "Mohamed Nomeir", "Lei Hu", "Sennur Ulukus"], "title": "Convergence Properties of Good Quantum Codes for Classical Communication", "comment": null, "summary": "An important part of the information theory folklore had been about the output statistics of codes that achieve the capacity and how the empirical distributions compare to the output distributions induced by the optimal input in the channel capacity problem. Results for a variety of such empirical output distributions of good codes have been known in the literature, such as the comparison of the output distribution of the code to the optimal output distribution in vanishing and non-vanishing error probability cases. Motivated by these, we aim to achieve similar results for the quantum codes that are used for classical communication, that is the setting in which the classical messages are communicated through quantum codewords that pass through a noisy quantum channel. We first show the uniqueness of the optimal output distribution, to be able to talk more concretely about the optimal output distribution. Then, we extend the vanishing error probability results to the quantum case, by using techniques that are close in spirit to the classical case. We also extend non-vanishing error probability results to the quantum case on block codes, by using the second-order converses for such codes based on hypercontractivity results for the quantum generalized depolarizing semi-groups."}
{"id": "2601.10865", "categories": ["cs.CR", "cs.SE"], "pdf": "https://arxiv.org/pdf/2601.10865", "abs": "https://arxiv.org/abs/2601.10865", "authors": ["Jonah Ghebremichael", "Saastha Vasan", "Saad Ullah", "Greg Tystahl", "David Adei", "Christopher Kruegel", "Giovanni Vigna", "William Enck", "Alexandros Kapravelos"], "title": "Multi-Agent Taint Specification Extraction for Vulnerability Detection", "comment": null, "summary": "Static Application Security Testing (SAST) tools using taint analysis are widely viewed as providing higher-quality vulnerability detection results compared to traditional pattern-based approaches. However, performing static taint analysis for JavaScript poses two major challenges. First, JavaScript's dynamic features complicate data flow extraction required for taint tracking. Second, npm's large library ecosystem makes it difficult to identify relevant sources/sinks and establish taint propagation across dependencies. In this paper, we present SemTaint, a multi-agent system that strategically combines the semantic understanding of Large Language Models (LLMs) with traditional static program analysis to extract taint specifications, including sources, sinks, call edges, and library flow summaries tailored to each package. Conceptually, SemTaint uses static program analysis to calculate a call graph and defers to an LLM to resolve call edges that cannot be resolved statically. Further, it uses the LLM to classify sources and sinks for a given CWE. The resulting taint specification is then provided to a SAST tool, which performs vulnerability analysis. We integrate SemTaint with CodeQL, a state-of-the-art SAST tool, and demonstrate its effectiveness by detecting 106 of 162 vulnerabilities previously undetectable by CodeQL. Furthermore, we find 4 novel vulnerabilities in 4 popular npm packages. In doing so, we demonstrate that LLMs can practically enhance existing static program analysis algorithms, combining the strengths of both symbolic reasoning and semantic understanding for improved vulnerability detection."}
{"id": "2601.10869", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10869", "abs": "https://arxiv.org/abs/2601.10869", "authors": ["Davide Mannini", "James B. Rawlings"], "title": "Disturbance Attenuation Regulator II: Stage Bound Finite Horizon Solution", "comment": null, "summary": "This paper develops a generalized finite horizon recursive solution to the discrete time stage bound disturbance attenuation regulator (StDAR) for state feedback control. This problem addresses linear dynamical systems subject to stage bound disturbances, i.e., disturbance sequences constrained independently at each time step through stagewise squared two-norm bounds. The term generalized indicates that the results accommodate arbitrary initial states. By combining game theory and dynamic programming, this work derives a recursive solution for the optimal state feedback policy. The optimal policy is nonlinear in the state and requires solving a tractable convex optimization for the Lagrange multiplier vector at each stage; the control is then explicit. For systems with constant stage bound, the problem admits a steady-state optimization expressed as a tractable linear matrix inequality (LMI) with $O(n^3)$ complexity. Numerical examples illustrate the properties of the solution.\n  This work provides a complete feedback solution to the StDAR for arbitrary initial states. Companion papers address the signal bound disturbance attenuation regulator (SiDAR): the finite horizon solution in Part~I-A and convergence properties in Part~I-B."}
{"id": "2601.10737", "categories": ["eess.SP", "cond-mat.mtrl-sci", "cs.CV", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.10737", "abs": "https://arxiv.org/abs/2601.10737", "authors": ["Giuseppe Romano", "Rodrigo Arrieta", "Steven G. Johnson"], "title": "Differentiating through binarized topology changes: Second-order subpixel-smoothed projection", "comment": null, "summary": "A key challenge in topology optimization (TopOpt) is that manufacturable structures, being inherently binary, are non-differentiable, creating a fundamental tension with gradient-based optimization. The subpixel-smoothed projection (SSP) method addresses this issue by smoothing sharp interfaces at the subpixel level through a first-order expansion of the filtered field. However, SSP does not guarantee differentiability under topology changes, such as the merging of two interfaces, and therefore violates the convergence guarantees of many popular gradient-based optimization algorithms. We overcome this limitation by regularizing SSP with the Hessian of the filtered field, resulting in a twice-differentiable projected density during such transitions, while still guaranteeing an almost-everywhere binary structure. We demonstrate the effectiveness of our second-order SSP (SSP2) methodology on both thermal and photonic problems, showing that SSP2 has faster convergence than SSP for connectivity-dominant cases -- where frequent topology changes occur -- while exhibiting comparable performance otherwise. Beyond improving convergence guarantees for CCSA optimizers, SSP2 enables the use of a broader class of optimization algorithms with stronger theoretical guarantees, such as interior-point methods. Since SSP2 adds minimal complexity relative to SSP or traditional projection schemes, it can be used as a drop-in replacement in existing TopOpt codes."}
{"id": "2601.10863", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10863", "abs": "https://arxiv.org/abs/2601.10863", "authors": ["Chutian Ma", "Grigorii Pomazkin", "Giacinto Paolo Saggese", "Paul Smith"], "title": "Beyond Accuracy: A Stability-Aware Metric for Multi-Horizon Forecasting", "comment": null, "summary": "Traditional time series forecasting methods optimize for accuracy alone. This objective neglects temporal consistency, in other words, how consistently a model predicts the same future event as the forecast origin changes. We introduce the forecast accuracy and coherence score (forecast AC score for short) for measuring the quality of probabilistic multi-horizon forecasts in a way that accounts for both multi-horizon accuracy and stability. Our score additionally provides for user-specified weights to balance accuracy and consistency requirements. As an example application, we implement the score as a differentiable objective function for training seasonal ARIMA models and evaluate it on the M4 Hourly benchmark dataset. Results demonstrate substantial improvements over traditional maximum likelihood estimation. Our AC-optimized models achieve a 75\\% reduction in forecast volatility for the same target timestamps while maintaining comparable or improved point forecast accuracy."}
{"id": "2601.10991", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.10991", "abs": "https://arxiv.org/abs/2601.10991", "authors": ["Hirosuke Yamamoto", "Ken-ichi Iwata"], "title": "Asymmetric Encoding-Decoding Schemes for Lossless Data Compression", "comment": "24 pages, 19 figures, Submitted to the IEEE Transactions on Information Theory", "summary": "This paper proposes a new lossless data compression coding scheme named an asymmetric encoding-decoding scheme (AEDS), which can be considered as a generalization of tANS (tabled variant of asymmetric numeral systems). In the AEDS, a data sequence $\\bm{s}=s_1s_2\\cdots s_n$ is encoded in backward order $s_t, t=n, \\cdots, 2,1$, while $\\bm{s}$ is decoded in forward order $s_t, t=1, 2, \\cdots, n$ in the same way as the tANS. But, the code class of the AEDS is much broader than that of the tANS. We show for i.i.d.~sources that an AEDS with 2 states (resp.~5 states) can attain a shorter average code length than the Huffman code if a child of the root in the Huffman code tree has a probability weight larger than 0.61803 (resp.~0.56984). Furthermore, we derive several upper bounds on the average code length of the AEDS, which also hold for the tANS, and we show that the average code length of the optimal AEDS and tANS with $N$ states converges to the source entropy with speed $O(1/N)$ as $N$ increases."}
{"id": "2601.10866", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.10866", "abs": "https://arxiv.org/abs/2601.10866", "authors": ["Yuting Liang", "Ke Yi"], "title": "Adaptive Privacy Budgeting", "comment": null, "summary": "We study the problem of adaptive privacy budgeting under generalized differential privacy. Consider the setting where each user $i\\in [n]$ holds a tuple $x_i\\in U:=U_1\\times \\dotsb \\times U_T$, where $x_i(l)\\in U_l$ represents the $l$-th component of their data. For every $l\\in [T]$ (or a subset), an untrusted analyst wishes to compute some $f_l(x_1(l),\\dots,x_n(l))$, while respecting the privacy of each user. For many functions $f_l$, data from the users are not all equally important, and there is potential to use the privacy budgets of the users strategically, leading to privacy savings that can be used to improve the utility of later queries. In particular, the budgeting should be adaptive to the outputs of previous queries, so that greater savings can be achieved on more typical instances. In this paper, we provide such an adaptive budgeting framework, with various applications demonstrating its applicability."}
{"id": "2601.10891", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10891", "abs": "https://arxiv.org/abs/2601.10891", "authors": ["Maryam Salamatmoghadasi", "Amir Mehrabian", "Halim Yanikomeroglu", "Georges Kaddoum"], "title": "Sustainable Vertical Heterogeneous Networks: A Cell Switching Approach with High Altitude Platform Station", "comment": "16 pages", "summary": "The rapid growth of radio access networks (RANs) is increasing energy consumption and challenging the sustainability of future systems. We consider a dense-urban vertical heterogeneous network (vHetNet) comprising a high-altitude platform station (HAPS) acting as a super macro base station, a terrestrial macro base station (MBS), and multiple small base stations (SBSs). We propose a HAPS-enhanced cell-switching algorithm that selectively deactivates SBSs based on their traffic load and the capacity and channel conditions of both the MBS and HAPS. The resulting energy-minimization problem, subject to an outage-based quality-of-service (QoS) constraint, is formulated as a mixed-integer nonlinear program and reformulated into a mixed-integer program for efficient solution. Using realistic 3GPP channel models, simulations show substantial energy savings versus All-ON, terrestrial cell switching, and sorting benchmarks. Relative to All-ON, the proposed method reduces power consumption by up to 77% at low loads and about 40% at high loads; a NoQoS variant achieves up to 90% and 47%, respectively. The approach maintains high served-traffic levels and provides a tunable trade-off between power efficiency and outage-based QoS, supporting scalable and sustainable 6G deployments."}
{"id": "2601.10743", "categories": ["eess.SP", "cs.LG", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.10743", "abs": "https://arxiv.org/abs/2601.10743", "authors": ["Ayesh Abu Lehyeh", "Anastassia Gharib", "Tian Xia", "Dryver Huston", "Safwan Wshah"], "title": "UBiGTLoc: A Unified BiLSTM-Graph Transformer Localization Framework for IoT Sensor Networks", "comment": "Accepted and published in IEEE Internet of Things Journal", "summary": "Sensor nodes localization in wireless Internet of Things (IoT) sensor networks is crucial for the effective operation of diverse applications, such as smart cities and smart agriculture. Existing sensor nodes localization approaches heavily rely on anchor nodes within wireless sensor networks (WSNs). Anchor nodes are sensor nodes equipped with global positioning system (GPS) receivers and thus, have known locations. These anchor nodes operate as references to localize other sensor nodes. However, the presence of anchor nodes may not always be feasible in real-world IoT scenarios. Additionally, localization accuracy can be compromised by fluctuations in Received Signal Strength Indicator (RSSI), particularly under non-line-of-sight (NLOS) conditions. To address these challenges, we propose UBiGTLoc, a Unified Bidirectional Long Short-Term Memory (BiLSTM)-Graph Transformer Localization framework. The proposed UBiGTLoc framework effectively localizes sensor nodes in both anchor-free and anchor-presence WSNs. The framework leverages BiLSTM networks to capture temporal variations in RSSI data and employs Graph Transformer layers to model spatial relationships between sensor nodes. Extensive simulations demonstrate that UBiGTLoc consistently outperforms existing methods and provides robust localization across both dense and sparse WSNs while relying solely on cost-effective RSSI data."}
{"id": "2601.10873", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10873", "abs": "https://arxiv.org/abs/2601.10873", "authors": ["Jeffrey Uhlmann"], "title": "Unit-Consistent (UC) Adjoint for GSD and Backprop in Deep Learning Applications", "comment": null, "summary": "Deep neural networks constructed from linear maps and positively homogeneous nonlinearities (e.g., ReLU) possess a fundamental gauge symmetry: the network function is invariant to node-wise diagonal rescalings. However, standard gradient descent is not equivariant to this symmetry, causing optimization trajectories to depend heavily on arbitrary parameterizations. Prior work has proposed rescaling-invariant optimization schemes for positively homogeneous networks (e.g., path-based or path-space updates). Our contribution is complementary: we formulate the invariance requirement at the level of the backward adjoint/optimization geometry, which provides a simple, operator-level recipe that can be applied uniformly across network components and optimizer state. By replacing the Euclidean transpose with a Unit-Consistent (UC) adjoint, we derive UC gauge-consistent steepest descent and backprogation."}
{"id": "2601.11025", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11025", "abs": "https://arxiv.org/abs/2601.11025", "authors": ["Lei Li", "Yanqing Xu", "Ye Xue", "Feng Yin", "Chao Shen", "Rui Zhang", "Tsung-Hui Chang"], "title": "PEMNet: Towards Autonomous and Enhanced Environment-Aware Mobile Networks", "comment": null, "summary": "With 5G deployment and the evolution toward 6G, mobile networks must make decisions in highly dynamic environments under strict latency, energy, and spectrum constraints. Achieving this goal, however, depends on prior knowledge of spatial-temporal variations in wireless channels and traffic demands. This motivates a joint, site-specific representation of radio propagation and user demand that is queryable at low online overhead. In this work, we propose the perception embedding map (PEM), a localized framework that embeds fine-grained channel statistics together with grid-level spatial-temporal traffic patterns over a base station's coverage. PEM is built from standard-compliant measurements -- such as measurement report and scheduling/quality-of-service logs -- so it can be deployed and maintained at scale with low cost. Integrated into PEM, this joint knowledge supports enhanced environment-aware optimization across PHY, MAC, and network layers while substantially reducing training overhead and signaling. Compared with existing site-specific channel maps and digital-twin replicas, PEM distinctively emphasizes (i) joint channel-traffic embedding, which is essential for network optimization, and (ii) practical construction using standard measurements, enabling network autonomy while striking a favorable fidelity-cost balance."}
{"id": "2601.10923", "categories": ["cs.CR", "cs.HC"], "pdf": "https://arxiv.org/pdf/2601.10923", "abs": "https://arxiv.org/abs/2601.10923", "authors": ["Haoze Guo", "Ziqi Wei"], "title": "Hidden-in-Plain-Text: A Benchmark for Social-Web Indirect Prompt Injection in RAG", "comment": null, "summary": "Retrieval-augmented generation (RAG) systems put more and more emphasis on grounding their responses in user-generated content found on the Web, amplifying both their usefulness and their attack surface. Most notably, indirect prompt injection and retrieval poisoning attack the web-native carriers that survive ingestion pipelines and are very concerning. We provide OpenRAG-Soc, a compact, reproducible benchmark-and-harness for web-facing RAG evaluation under these threats, in a discrete data package. The suite combines a social corpus with interchangeable sparse and dense retrievers and deployable mitigations - HTML/Markdown sanitization, Unicode normalization, and attribution-gated answered. It standardizes end-to-end evaluation from ingestion to generation and reports attacks time of one of the responses at answer time, rank shifts in both sparse and dense retrievers, utility and latency, allowing for apples-to-apples comparisons across carriers and defenses. OpenRAG-Soc targets practitioners who need fast, and realistic tests to track risk and harden deployments."}
{"id": "2601.10975", "categories": ["eess.SY", "cond-mat.mtrl-sci", "physics.chem-ph"], "pdf": "https://arxiv.org/pdf/2601.10975", "abs": "https://arxiv.org/abs/2601.10975", "authors": ["Yujia Yuan", "Chuanzhen Zhao", "Margherita Ronchini", "Yuya Nishio", "Donglai Zhong", "Can Wu", "Hyukmin Kweon", "Zehao Sun", "Rachael K. Mow", "Yuran Shi", "Lukas Michalek", "Haotian Wu", "Qianhe Liu", "Weichen Wang", "Yating Yao", "Zelong Yin", "Junyi Zhao", "Zihan He", "Ke Chen", "Ruiheng Wu", "Jiuyun Shi", "Jian Pei", "Zhenan Bao"], "title": "A monolithic fabrication platform for intrinsically stretchable polymer transistors and complementary circuits", "comment": "Submitted to Nature Electronics by December 2025", "summary": "Soft, stretchable organic field-effect transistors (OFETs) can provide powerful on-skin signal conditioning, but current fabrication methods are often material-specific: each new polymer semiconductor (PSC) requires a tailored process. The challenge is even greater for complementary OFET circuits, where two PSCs must be patterned sequentially, which often leads to device degradation. Here, we introduce a universal, monolithic photolithography process that enables high-yield, high-resolution stretchable complementary OFETs and circuits. This approach is enabled by a process-design framework that includes (i) a direct, photopatternable, solvent-resistant, crosslinked dielectric/semiconductor interface, (ii) broadly applicable crosslinked PSC blends that preserve high mobility, and (iii) a patterning strategy that provides simultaneous etch masking and encapsulation. Using this platform, we achieve record integration density for stretchable OTFTs (55,000 cm^-2), channel lengths down to 2 um, and low-voltage operation at 5 V. We demonstrate photopatterning across multiple PSC types and realize complementary circuits, including 3 kHz stretchable ring oscillators, the first to exceed 1 kHz and representing more than a 60-fold increase in stage switching speed over the state of the art. Finally, we demonstrate the first stretchable complementary OTFT neuron circuit, where the output frequency is modulated by the input current to mimic neuronal signal processing. This scalable approach can be readily extended to diverse high-performance stretchable materials, accelerating the development and manufacturing of skin-like electronics."}
{"id": "2601.10745", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10745", "abs": "https://arxiv.org/abs/2601.10745", "authors": ["Shivam Kumar", "Himanshu Singh"], "title": "An IoT-Based Controlled Environment Storage for Prevention of Spoilage of Onion (Allium Cepa) During Post-Harvest with UV-C Disinfection", "comment": "8 pages, 7 figures. Undergraduate Research Project", "summary": "India is the second largest producer of onions in the world, contributing over 26 million tonnes annually. However, during storage, approximately 30-40% of onions are lost due to rotting, sprouting, and weight loss. Despite being a major producer, conventional storage methods are either low-cost but ineffective (traditional storage with 40% spoilage) or highly effective but prohibitively expensive for small farmers (cold storage). This paper presents a low-cost IoT-based smart onion storage system that monitors and automatically regulates environmental parameters including temperature, humidity, and spoilage gases using ESP32 microcontroller, DHT22 sensor, MQ-135 gas sensor, and UV-C disinfection technology. The proposed system aims to reduce onion spoilage to 15-20% from the current 40-45% wastage rate while remaining affordable for small and marginal farmers who constitute the majority in India. The system is designed to be cost-effective (estimated 60k-70k INR), energy-efficient, farmer-friendly, and solar-powered."}
{"id": "2601.10905", "categories": ["cs.LG", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.10905", "abs": "https://arxiv.org/abs/2601.10905", "authors": ["Rajat Ghosh", "Debojyoti Dutta"], "title": "Action Shapley: A Training Data Selection Metric for World Model in Reinforcement Learning", "comment": null, "summary": "Numerous offline and model-based reinforcement learning systems incorporate world models to emulate the inherent environments. A world model is particularly important in scenarios where direct interactions with the real environment is costly, dangerous, or impractical. The efficacy and interpretability of such world models are notably contingent upon the quality of the underlying training data. In this context, we introduce Action Shapley as an agnostic metric for the judicious and unbiased selection of training data. To facilitate the computation of Action Shapley, we present a randomized dynamic algorithm specifically designed to mitigate the exponential complexity inherent in traditional Shapley value computations. Through empirical validation across five data-constrained real-world case studies, the algorithm demonstrates a computational efficiency improvement exceeding 80\\% in comparison to conventional exponential time computations. Furthermore, our Action Shapley-based training data selection policy consistently outperforms ad-hoc training data selection."}
{"id": "2601.11149", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11149", "abs": "https://arxiv.org/abs/2601.11149", "authors": ["Lei Xie", "Hengtao He", "Jun Tong", "Fan Liu", "Shenghui Song"], "title": "Sensing Mutual Information for Communication Signal with Deterministic Pilots and Random Data Payloads", "comment": null, "summary": "The recent emergence of the integrated sensing and communication (ISAC) framework has sparked significant interest in quantifying the sensing capabilities inherent in communication signals. However, existing literature has mainly focused on scenarios involving either purely random or purely deterministic waveforms. This overlooks a critical reality: operational communication standards invariably utilize a hybrid structure comprising both deterministic pilots for channel estimation and random payloads for data transmission. To bridge this gap, this paper investigates the sensing mutual information (SMI) and precoding design specifically for ISAC systems employing communication signals with both pilots and data payloads. First, by utilizing random matrix theory (RMT), we derive a tractable closed-form expression for the SMI that accurately accounts for the statistical properties of the hybrid signal. Building upon this theoretical foundation, we formulate a precoding optimization problem to maximize SMI with constraints on the transmit power and communication rate, which is solved via an efficient alternating direction method of multipliers framework. Simulation results validate the accuracy of the theoretical results and demonstrate the superiority of the proposed precoding design over conventional benchmarks."}
{"id": "2601.10929", "categories": ["cs.CR", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10929", "abs": "https://arxiv.org/abs/2601.10929", "authors": ["Dalibor Sain", "Thomas Rosenstatter", "Olaf Saßnick", "Christian Schäfer", "Stefan Huber"], "title": "Secure Data Bridging in Industry 4.0: An OPC UA Aggregation Approach for Including Insecure Legacy Systems", "comment": null, "summary": "The increased connectivity of industrial networks has led to a surge in cyberattacks, emphasizing the need for cybersecurity measures tailored to the specific requirements of industrial systems. Modern Industry 4.0 technologies, such as OPC UA, offer enhanced resilience against these threats. However, widespread adoption remains limited due to long installation times, proprietary technology, restricted flexibility, and formal process requirements (e.g. safety certifications). Consequently, many systems do not yet implement these technologies, or only partially. This leads to the challenge of dealing with so-called brownfield systems, which are often placed in isolated security zones to mitigate risks. However, the need for data exchange between secure and insecure zones persists.\n  This paper reviews existing solutions to address this challenge by analysing their approaches, advantages, and limitations. Building on these insights, we identify three key concepts, evaluate their suitability and compatibility, and ultimately introduce the SigmaServer, a novel TCP-level aggregation method. The developed proof-of-principle implementation is evaluated in an operational technology (OT) testbed, demonstrating its applicability and effectiveness in bridging secure and insecure zones."}
{"id": "2601.10976", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10976", "abs": "https://arxiv.org/abs/2601.10976", "authors": ["Ju-Hong Oh", "Seon-In Kim", "Eui-Jong Kim"], "title": "Determining optimal thermal energy storage charging temperature for cooling using integrated building and coil modeling", "comment": null, "summary": "Thermal energy storage (TES) systems coupled with heat pumps offer significant potential for improving building energy efficiency by shifting electricity demand to off-peak hours. However, conventional operating strategies maintain conservatively low chilled water temperatures throughout the cooling season, a practice that results in suboptimal heat pump performance. This study proposes a physics-based integrated simulation framework to determine the maximum feasible chilled water supply temperature while ensuring cooling stability. The framework integrates four submodels: relative humidity prediction, dynamic cooling load estimation, cooling coil performance prediction, and TES discharge temperature prediction. Validation against measured data from an office building demonstrates reliable accuracy across all sub-models (e.g., CVRMSE of 9.3% for cooling load and R2 of 0.91 for peak-time discharge temperature). The integrated simulation reveals that the proposed framework can increase the daily initial TES charging temperature by an average of 2.55 °C compared to conventional fixed-temperature operation, enabling the heat pump to operate at a higher coefficient of performance. This study contributes a practical methodology for optimizing TES charging temperatures in building heating, ventilation, and air conditioning (HVAC) systems while maintaining indoor setpoint temperatures."}
{"id": "2601.10746", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10746", "abs": "https://arxiv.org/abs/2601.10746", "authors": ["Yuxin Yang", "Hang Zhou", "Hourong Song", "Branislav Hredzak"], "title": "On the static and small signal analysis of DAB converter", "comment": null, "summary": "This document develops a method to solve the periodic operating point of Dual-Active-Bridge (DAB)."}
{"id": "2601.10911", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10911", "abs": "https://arxiv.org/abs/2601.10911", "authors": ["Zhang Xiaocai", "Xiao Zhe", "Liang Maohan", "Liu Tao", "Li Haijiang", "Zhang Wenbin"], "title": "Realistic Curriculum Reinforcement Learning for Autonomous and Sustainable Marine Vessel Navigation", "comment": "Present in The 40th Annual AAAI Conference on Artificial Intelligence (AAAI-26)", "summary": "Sustainability is becoming increasingly critical in the maritime transport, encompassing both environmental and social impacts, such as Greenhouse Gas (GHG) emissions and navigational safety. Traditional vessel navigation heavily relies on human experience, often lacking autonomy and emission awareness, and is prone to human errors that may compromise safety. In this paper, we propose a Curriculum Reinforcement Learning (CRL) framework integrated with a realistic, data-driven marine simulation environment and a machine learning-based fuel consumption prediction module. The simulation environment is constructed using real-world vessel movement data and enhanced with a Diffusion Model to simulate dynamic maritime conditions. Vessel fuel consumption is estimated using historical operational data and learning-based regression. The surrounding environment is represented as image-based inputs to capture spatial complexity. We design a lightweight, policy-based CRL agent with a comprehensive reward mechanism that considers safety, emissions, timeliness, and goal completion. This framework effectively handles complex tasks progressively while ensuring stable and efficient learning in continuous action spaces. We validate the proposed approach in a sea area of the Indian Ocean, demonstrating its efficacy in enabling sustainable and safe vessel navigation."}
{"id": "2601.11179", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11179", "abs": "https://arxiv.org/abs/2601.11179", "authors": ["Noor Ul Ain", "Lorenzo Miretti", "Renato L. G. Cavalcante", "Sławomir Stańczak"], "title": "Performance Analysis of Cell-Free Massive MIMO under Imperfect LoS Phase Tracking", "comment": "6 pages, 1 figure and 1 table", "summary": "We study the impact of imperfect line-of-sight (LoS) phase tracking on the performance of cell-free massive MIMO networks. Unlike prior works that assume perfectly known or completely unknown phases, we consider a realistic regime where LoS phases are estimated with residual uncertainty due to hardware impairments, mobility, and synchronization errors. To this end, we propose a Rician fading model where LoS components are rotated by imperfect phase estimates and attenuated by a deterministic phase-error penalty factor. We derive a linear MMSE channel estimator that captures statistical phase errors and unifies prior results, reducing to the Bayesian MMSE estimator with perfect phase knowledge and to a zero-mean model in the absence of phase knowledge. To address the non-Gaussian setting, we introduce a virtual uplink model that preserves second-order statistics of channel estimation, enabling the derivation of tractable centralized and distributed MMSE beamformers. To ensure fair assessment of the network performance, we apply these beamformers to the true uplink model and compute the spectral efficiency bounds available in the literature. Numerical results show that our framework bridges idealized assumptions and practical tracking limitations, providing rigorous performance benchmarks and design insights for 6G cell-free networks."}
{"id": "2601.10955", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.10955", "abs": "https://arxiv.org/abs/2601.10955", "authors": ["Kaiyu Zhou", "Yongsen Zheng", "Yicheng He", "Meng Xue", "Xueluan Gong", "Yuji Wang", "Kwok-Yan Lam"], "title": "Beyond Max Tokens: Stealthy Resource Amplification via Tool Calling Chains in LLM Agents", "comment": null, "summary": "The agent-tool communication loop is a critical attack surface in modern Large Language Model (LLM) agents. Existing Denial-of-Service (DoS) attacks, primarily triggered via user prompts or injected retrieval-augmented generation (RAG) context, are ineffective for this new paradigm. They are fundamentally single-turn and often lack a task-oriented approach, making them conspicuous in goal-oriented workflows and unable to exploit the compounding costs of multi-turn agent-tool interactions. We introduce a stealthy, multi-turn economic DoS attack that operates at the tool layer under the guise of a correctly completed task. Our method adjusts text-visible fields and a template-governed return policy in a benign, Model Context Protocol (MCP)-compatible tool server, optimizing these edits with a Monte Carlo Tree Search (MCTS) optimizer. These adjustments leave function signatures unchanged and preserve the final payload, steering the agent into prolonged, verbose tool-calling sequences using text-only notices. This compounds costs across turns, escaping single-turn caps while keeping the final answer correct to evade validation. Across six LLMs on the ToolBench and BFCL benchmarks, our attack expands tasks into trajectories exceeding 60,000 tokens, inflates costs by up to 658x, and raises energy by 100-560x. It drives GPU KV cache occupancy from <1% to 35-74% and cuts co-running throughput by approximately 50%. Because the server remains protocol-compatible and task outcomes are correct, conventional checks fail. These results elevate the agent-tool interface to a first-class security frontier, demanding a paradigm shift from validating final answers to monitoring the economic and computational cost of the entire agentic process."}
{"id": "2601.11205", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11205", "abs": "https://arxiv.org/abs/2601.11205", "authors": ["W. P. M. H. Heemels", "R. Postoyan", "P. Bernard", "K. J. A. Scheres", "R. G. Sanfelice"], "title": "Solution Concepts and Existence Results for Hybrid Systems with Continuous-time Inputs", "comment": null, "summary": "In many scenarios, it is natural to model a plant's dynamical behavior using a hybrid dynamical system influenced by exogenous continuous-time inputs. While solution concepts and analytical tools for existence and completeness are well established for autonomous hybrid systems, corresponding results for hybrid dynamical systems involving continuous-time inputs are generally lacking. This work aims to address this gap. We first formalize notions of a solution for such systems. We then provide conditions that guarantee the existence and forward completeness of solutions. Moreover, we leverage results and ideas from viability theory to present more explicit conditions in terms of various tangent cone formulations. Variants are provided that depend on the regularity of the exogenous input signals."}
{"id": "2601.10747", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10747", "abs": "https://arxiv.org/abs/2601.10747", "authors": ["Silke K. Kaiser"], "title": "Sensor Placement for Urban Traffic Interpolation: A Data-Driven Evaluation to Inform Policy", "comment": null, "summary": "Data on citywide street-segment traffic volumes are essential for urban planning and sustainable mobility management. Yet such data are available only for a limited subset of streets due to the high costs of sensor deployment and maintenance. Traffic volumes on the remaining network are therefore interpolated based on existing sensor measurements. However, current sensor locations are often determined by administrative priorities rather than by data-driven optimization, leading to biased coverage and reduced estimation performance. This study provides a large-scale, real-world benchmarking of easily implementable, data-driven strategies for optimizing the placement of permanent and temporary traffic sensors, using segment-level data from Berlin (Strava bicycle counts) and Manhattan (taxi counts). It compares spatial placement strategies based on network centrality, spatial coverage, feature coverage, and active learning. In addition, the study examines temporal deployment schemes for temporary sensors. The findings highlight that spatial placement strategies that emphasize even spatial coverage and employ active learning achieve the lowest prediction errors. With only 10 sensors, they reduce the mean absolute error by over 60% in Berlin and 70% in Manhattan compared to alternatives. Temporal deployment choices further improve performance: distributing measurements evenly across weekdays reduces error by an additional 7% in Berlin and 21% in Manhattan. Together, these spatial and temporal principles allow temporary deployments to closely approximate the performance of optimally placed permanent deployments. From a policy perspective, the results indicate that cities can substantially improve data usefulness by adopting data-driven sensor placement strategies, while retaining flexibility in choosing between temporary and permanent deployments."}
{"id": "2601.10914", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10914", "abs": "https://arxiv.org/abs/2601.10914", "authors": ["Francis Ndikum Nji", "Jianwu Wang"], "title": "FAConvLSTM: Factorized-Attention ConvLSTM for Efficient Feature Extraction in Multivariate Climate Data", "comment": null, "summary": "Learning physically meaningful spatiotemporal representations from high-resolution multivariate Earth observation data is challenging due to strong local dynamics, long-range teleconnections, multi-scale interactions, and nonstationarity. While ConvLSTM2D is a commonly used baseline, its dense convolutional gating incurs high computational cost and its strictly local receptive fields limit the modeling of long-range spatial structure and disentangled climate dynamics. To address these limitations, we propose FAConvLSTM, a Factorized-Attention ConvLSTM layer designed as a drop-in replacement for ConvLSTM2D that simultaneously improves efficiency, spatial expressiveness, and physical interpretability. FAConvLSTM factorizes recurrent gate computations using lightweight [1 times 1] bottlenecks and shared depthwise spatial mixing, substantially reducing channel complexity while preserving recurrent dynamics. Multi-scale dilated depthwise branches and squeeze-and-excitation recalibration enable efficient modeling of interacting physical processes across spatial scales, while peephole connections enhance temporal precision. To capture teleconnection-scale dependencies without incurring global attention cost, FAConvLSTM incorporates a lightweight axial spatial attention mechanism applied sparsely in time. A dedicated subspace head further produces compact per timestep embeddings refined through temporal self-attention with fixed seasonal positional encoding. Experiments on multivariate spatiotemporal climate data shows superiority demonstrating that FAConvLSTM yields more stable, interpretable, and robust latent representations than standard ConvLSTM, while significantly reducing computational overhead."}
{"id": "2601.11257", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11257", "abs": "https://arxiv.org/abs/2601.11257", "authors": ["Yu Yang", "Yingxin Zhang", "Weijie Yuan", "Lin Zhou"], "title": "Rate-Distortion-Perception Tradeoff for the Gray-Wyner Problem", "comment": "Submitted to IEEE International Symposium on Information Theory (ISIT) 2026. Contains detailed proofs and appendices not included in the conference version", "summary": "We revisit the Gray-Wyner lossy source coding problem and derive the first-order asymptotic optimal rate-distortion-perception region when additional perception constraints are imposed on reproduced source sequences. The optimal trade-off is shown to be governed by a mutual information term involving common information and two conditional rate-distortion-perception functions. The perception constraint requires that the distribution of each reproduced sequence is close to that of the original source sequence, which is motivated by practical applications in image and video compression. Prior studies usually focus on the compression and reconstruction of a single source sequence. In this paper, we generalize the prior results for point-to-point systems to the representative multi-terminal setting of the Gray-Wyner problem with two correlated source sequences. In particular, we integrate the analyses of the distortion and the perception constraints by including the random circular shift operator in the encoding and decoding process directly."}
{"id": "2601.10971", "categories": ["cs.CR", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.10971", "abs": "https://arxiv.org/abs/2601.10971", "authors": ["Yipu Dou", "Wang Yang"], "title": "AJAR: Adaptive Jailbreak Architecture for Red-teaming", "comment": null, "summary": "As Large Language Models (LLMs) evolve from static chatbots into autonomous agents capable of tool execution, the landscape of AI safety is shifting from content moderation to action security. However, existing red-teaming frameworks remain bifurcated: they either focus on rigid, script-based text attacks or lack the architectural modularity to simulate complex, multi-turn agentic exploitations. In this paper, we introduce AJAR (Adaptive Jailbreak Architecture for Red-teaming), a proof-of-concept framework designed to bridge this gap through Protocol-driven Cognitive Orchestration. Built upon the robust runtime of Petri, AJAR leverages the Model Context Protocol (MCP) to decouple adversarial logic from the execution loop, encapsulating state-of-the-art algorithms like X-Teaming as standardized, plug-and-play services. We validate the architectural feasibility of AJAR through a controlled qualitative case study, demonstrating its ability to perform stateful backtracking within a tool-use environment. Furthermore, our preliminary exploration of the \"Agentic Gap\" reveals a complex safety dynamic: while tool usage introduces new injection vectors via code execution, the cognitive load of parameter formatting can inadvertently disrupt persona-based attacks. AJAR is open-sourced to facilitate the standardized, environment-aware evaluation of this emerging attack surface. The code and data are available at https://github.com/douyipu/ajar."}
{"id": "2601.11244", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11244", "abs": "https://arxiv.org/abs/2601.11244", "authors": ["Haoyang Zhang"], "title": "Analysis of Full Order Observer Based Control for Spacecraft Orbit Maneuver Trajectory Under Solar Radiation Pressure", "comment": null, "summary": "This study investigates the application of modern control theory to improve the precision of spacecraft orbit maneuvers in low Earth orbit under the influence of solar radiation pressure. A full order observer based feedback control framework is developed to estimate system states and compensate for external disturbances during the trajectory correction phase following main engine cut off. The maneuver trajectory is generated using Lambert guidance, while the observer based controller ensures accurate tracking of the target orbit despite SRP perturbations. The effectiveness of the proposed design is assessed through stability, observability, and controllability analyses. Stability is validated by step-response simulations and eigenvalue distributions of the system dynamics. Observability is demonstrated through state matrix rank analysis, confirming complete state estimation. Controllability is verified using state feedback rank conditions and corresponding control performance plots. Comparative simulations highlight that, in contrast to uncontrolled or conventional control cases, the observer based controller achieves improved trajectory accuracy and robust disturbance rejection with moderate control effort. These findings indicate that observer-based feedback control offers a reliable and scalable solution for precision orbital maneuvering in LEO missions subject to environmental disturbances."}
{"id": "2601.10748", "categories": ["eess.SP", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10748", "abs": "https://arxiv.org/abs/2601.10748", "authors": ["Jun Li", "Hongling Zhu", "Yujie Xiao", "Qinghao Zhao", "Yalei Ke", "Gongzheng Tang", "Guangkun Nie", "Deyun Zhang", "Jin Li", "Canqing Yu", "Shenda Hong"], "title": "AnyECG: Evolved ECG Foundation Model for Holistic Health Profiling", "comment": "in progress", "summary": "Background: Artificial intelligence enabled electrocardiography (AI-ECG) has demonstrated the ability to detect diverse pathologies, but most existing models focus on single disease identification, neglecting comorbidities and future risk prediction. Although ECGFounder expanded cardiac disease coverage, a holistic health profiling model remains needed.\n  Methods: We constructed a large multicenter dataset comprising 13.3 million ECGs from 2.98 million patients. Using transfer learning, ECGFounder was fine-tuned to develop AnyECG, a foundation model for holistic health profiling. Performance was evaluated using external validation cohorts and a 10-year longitudinal cohort for current diagnosis, future risk prediction, and comorbidity identification.\n  Results: AnyECG demonstrated systemic predictive capability across 1172 conditions, achieving an AUROC greater than 0.7 for 306 diseases. The model revealed novel disease associations, robust comorbidity patterns, and future disease risks. Representative examples included high diagnostic performance for hyperparathyroidism (AUROC 0.941), type 2 diabetes (0.803), Crohn disease (0.817), lymphoid leukemia (0.856), and chronic obstructive pulmonary disease (0.773).\n  Conclusion: The AnyECG foundation model provides substantial evidence that AI-ECG can serve as a systemic tool for concurrent disease detection and long-term risk prediction."}
{"id": "2601.10940", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10940", "abs": "https://arxiv.org/abs/2601.10940", "authors": ["Aakriti", "Zhe Li", "Dandan Liang", "Chao Huang", "Rui Li", "Haibo Yang"], "title": "HOSL: Hybrid-Order Split Learning for Memory-Constrained Edge Training", "comment": "12 pages, 2 figures, 6 tables. Submitted to WiOpt 2026", "summary": "Split learning (SL) enables collaborative training of large language models (LLMs) between resource-constrained edge devices and compute-rich servers by partitioning model computation across the network boundary. However, existing SL systems predominantly rely on first-order (FO) optimization, which requires clients to store intermediate quantities such as activations for backpropagation. This results in substantial memory overhead, largely negating benefits of model partitioning. In contrast, zeroth-order (ZO) optimization eliminates backpropagation and significantly reduces memory usage, but often suffers from slow convergence and degraded performance. In this work, we propose HOSL, a novel Hybrid-Order Split Learning framework that addresses this fundamental trade-off between memory efficiency and optimization effectiveness by strategically integrating ZO optimization on the client side with FO optimization on the server side. By employing memory-efficient ZO gradient estimation at the client, HOSL eliminates backpropagation and activation storage, reducing client memory consumption. Meanwhile, server-side FO optimization ensures fast convergence and competitive performance. Theoretically, we show that HOSL achieves a $\\mathcal{O}(\\sqrt{d_c/TQ})$ rate, which depends on client-side model dimension $d_c$ rather than the full model dimension $d$, demonstrating that convergence improves as more computation is offloaded to the server. Extensive experiments on OPT models (125M and 1.3B parameters) across 6 tasks demonstrate that HOSL reduces client GPU memory by up to 3.7$\\times$ compared to the FO method while achieving accuracy within 0.20%-4.23% of this baseline. Furthermore, HOSL outperforms the ZO baseline by up to 15.55%, validating the effectiveness of our hybrid strategy for memory-efficient training on edge devices."}
{"id": "2601.11291", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11291", "abs": "https://arxiv.org/abs/2601.11291", "authors": ["Guoying Zhang", "Qingqing Wu", "Ziyuan Zheng", "Qiaoyan Peng", "Yanze Zhu", "Wen Chen", "Penghui Huang"], "title": "Joint Antenna Rotation and IRS Beamforming for Multi-User Uplink Communications", "comment": null, "summary": "Rotatable antenna (RA) enhances wireless coverage through directional gain steering, yet suffers from performance degradation under physical blockages. Intelligent reflecting surface (IRS) establishes reflective paths to bypass obstacles, but suffers from angular mismatch when deployed in the side-lobe region of base station (BS) antennas. To address this issue, we propose a new RA-enabled IRS-assisted multi-user uplink system, in which the BS antennas are capable of flexibly adjusting their 3D orientations to align their boresights with the IRS. We formulate a sum rate maximization problem by jointly optimizing the antenna 3D rotations, receive beamforming and IRS phase shifts. To tackle this non-convex problem, we propose an efficient alternating optimization (AO) algorithm. Specifically, we iteratively update the antenna rotations via projected gradient ascent (PGA), compute the receive beamforming via a closed-form solution, and optimize the IRS phase shifts via fractional programming (FP). Numerical results demonstrate that the proposed system yields significant performance gains over conventional fixed-antenna systems, especially under large angular misalignments."}
{"id": "2601.11095", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.11095", "abs": "https://arxiv.org/abs/2601.11095", "authors": ["Grazia D'Onghia", "Antonio Lioy"], "title": "Towards Quantum-Resistant Trusted Computing: Architectures for Post-Quantum Integrity Verification Techniques", "comment": "Author-accepted manuscript of a paper published in the IEEE Symposium on Computers and Communications (ISCC), 2025. DOI: 10.1109/ISCC65549.2025.11326490", "summary": "Trust is the core building block of secure systems, and it is enforced through methods to ensure that a specific system is properly configured and works as expected. In this context, a Root of Trust (RoT) establishes a trusted environment, where both data and code are authenticated via a digital signature based on asymmetric cryptography, which is vulnerable to the threat posed by Quantum Computers (QCs). Firmware, being the first layer of trusted software, faces unique risks due to its longevity and difficult update. The transition of firmware protection to Post-Quantum Cryptography (PQC) is urgent, since it reduces the risk derived from exposing all computing and network devices to quantum-based attacks. This paper offers an analysis of the most common trust techniques and their roadmap towards a Post-Quantum (PQ) world, by investigating the current status of PQC and the challenges posed by such algorithms in existing Trusted Computing (TC) solutions from an integration perspective. Furthermore, this paper proposes an architecture for TC techniques enhanced with PEC, addressing the imperative for immediate adoption of quantum-resistant algorithms."}
{"id": "2601.11320", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11320", "abs": "https://arxiv.org/abs/2601.11320", "authors": ["Victor G. Lopez", "Matthias A. Müller"], "title": "On Data-based Nash Equilibria in LQ Nonzero-sum Differential Games", "comment": "7 pages, 2 figures", "summary": "This paper considers data-based solutions of linear-quadratic nonzero-sum differential games. Two cases are considered. First, the deterministic game is solved and Nash equilibrium strategies are obtained by using persistently excited data from the multiagent system. Then, a stochastic formulation of the game is considered, where each agent measures a different noisy output signal and state observers must be designed for each player. It is shown that the proposed data-based solutions of these games are equivalent to known model-based procedures. The resulting data-based solutions are validated in a numerical experiment."}
{"id": "2601.10761", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10761", "abs": "https://arxiv.org/abs/2601.10761", "authors": ["Junseok Lee", "Jihye Shin", "Sangyong Lee", "Chang-Jae Chun"], "title": "LSR-Net: A Lightweight and Strong Robustness Network for Bearing Fault Diagnosis in Noise Environment", "comment": null, "summary": "Rotating bearings play an important role in modern industries, but have a high probability of occurrence of defects because they operate at high speed, high load, and poor operating environments. Therefore, if a delay time occurs when a bearing is diagnosed with a defect, this may cause economic loss and loss of life. Moreover, since the vibration sensor from which the signal is collected is highly affected by the operating environment and surrounding noise, accurate defect diagnosis in a noisy environment is also important. In this paper, we propose a lightweight and strong robustness network (LSR-Net) that is accurate in a noisy environment and enables real-time fault diagnosis. To this end, first, a denoising and feature enhancement module (DFEM) was designed to create a 3-channel 2D matrix by giving several nonlinearity to the feature-map that passed through the denoising module (DM) block composed of convolution-based denoising (CD) blocks. Moreover, adaptive pruning was applied to DM to improve denoising ability when the power of noise is strong. Second, for lightweight model design, a convolution-based efficiency shuffle (CES) block was designed using group convolution (GConv), group pointwise convolution (GPConv) and channel split that can design the model while maintaining low parameters. In addition, the trade-off between the accuracy and model computational complexity that can occur due to the lightweight design of the model was supplemented using attention mechanisms and channel shuffle. In order to verify the defect diagnosis performance of the proposed model, performance verification was conducted in a noisy environment using a vibration signal. As a result, it was confirmed that the proposed model had the best anti-noise ability compared to the benchmark models, and the computational complexity of the model was also the lowest."}
{"id": "2601.10961", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10961", "abs": "https://arxiv.org/abs/2601.10961", "authors": ["Farshid Kamrani", "Kristen Schell"], "title": "Multivariate LSTM-Based Forecasting for Renewable Energy: Enhancing Climate Change Mitigation", "comment": "ICLR 2025 Workshop on Tackling Climate Change with Machine Learning, paper #57 (https://www.climatechange.ai/papers/iclr2025/57)", "summary": "The increasing integration of renewable energy sources (RESs) into modern power systems presents significant opportunities but also notable challenges, primarily due to the inherent variability of RES generation. Accurate forecasting of RES generation is crucial for maintaining the reliability, stability, and economic efficiency of power system operations. Traditional approaches, such as deterministic methods and stochastic programming, frequently depend on representative scenarios generated through clustering techniques like K-means. However, these methods may fail to fully capture the complex temporal dependencies and non-linear patterns within RES data. This paper introduces a multivariate Long Short-Term Memory (LSTM)-based network designed to forecast RESs generation using their real-world historical data. The proposed model effectively captures long-term dependencies and interactions between different RESs, utilizing historical data from both local and neighboring areas to enhance predictive accuracy. In the case study, we showed that the proposed forecasting approach results in lower CO2 emissions, and a more reliable supply of electric loads."}
{"id": "2601.11334", "categories": ["cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11334", "abs": "https://arxiv.org/abs/2601.11334", "authors": ["Deborah Pereg"], "title": "Information Theoretic Perspective on Representation Learning", "comment": null, "summary": "An information-theoretic framework is introduced to analyze last-layer embedding, focusing on learned representations for regression tasks. We define representation-rate and derive limits on the reliability with which input-output information can be represented as is inherently determined by the input-source entropy. We further define representation capacity in a perturbed setting, and representation rate-distortion for a compressed output. We derive the achievable capacity, the achievable representation-rate, and their converse. Finally, we combine the results in a unified setting."}
{"id": "2601.11104", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.11104", "abs": "https://arxiv.org/abs/2601.11104", "authors": ["Grazia D'Onghia", "Diana Gratiela Berbecaru", "Antonio Lioy"], "title": "Shaping a Quantum-Resistant Future: Strategies for Post-Quantum PKI", "comment": "Author-accepted manuscript of a paper published in the 2024 IEEE Symposium on Computers and Communications (ISCC), Paris, France, 2024, pp. 1-6, doi: 10.1109/ISCC61673.2024.10733624", "summary": "As the quantum computing era approaches, securing classical cryptographic protocols becomes imperative. Public key cryptography is widely used for signature and key exchange but it is the type of cryptography more threatened by quantum computing. Its application typically requires support via a public-key certificate, which is a signed data structure and must therefore face twice the quantum challenge: for the certified keys and for the signature itself. We present the latest developments in selecting robust Post-Quantum algorithms and investigate their applicability in the Public Key Infrastructure context. Our contribution entails defining requirements for a secure transition to a quantum-resistant Public Key Infrastructure, with a focus on adaptations for the X.509 certificate format. Additionally, we explore transitioning Certificate Revocation List and Online Certificate Status Protocol to support quantum-resistant algorithms. Through comparative analysis, we elucidate the complex transition to a quantum-resistant PKI."}
{"id": "2601.11323", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11323", "abs": "https://arxiv.org/abs/2601.11323", "authors": ["Botao Zhu", "Xianbin Wang"], "title": "Composite and Staged Trust Evaluation for Multi-Hop Collaborator Selection", "comment": null, "summary": "Multi-hop collaboration offers new perspectives for enhancing task execution efficiency by increasing available distributed collaborators for resource sharing. Consequently, selecting trustworthy collaborators becomes critical for realizing effective multi-hop collaboration. However, evaluating device trust requires the consideration of multiple factors, including relatively stable factors, such as historical interaction data, and dynamic factors, such as varying resources and network conditions. This differentiation makes it challenging to achieve the accurate evaluation of composite trust factors using one identical evaluation approach. To address this challenge, this paper proposes a composite and staged trust evaluation (CSTE) mechanism, where stable and dynamic factors are separately evaluated at different stages and then integrated for a final trust decision. First, a device interaction graph is constructed from stable historical interaction data to represent direct trust relationships between devices. A graph neural network framework is then used to propagate and aggregate these trust relationships to produce the historical trustworthiness of devices. In addition, a task-specific trust evaluation method is developed to assess the dynamic resources of devices based on task requirements, which generates the task-specific resource trustworthiness of devices. After these evaluations, CSTE integrates their results to identify devices within the network topology that satisfy the minimum trust thresholds of tasks. These identified devices then establish a trusted topology. Finally, within this trusted topology, an A* search algorithm is employed to construct a multi-hop collaboration path that satisfies the task requirements. Experimental results demonstrate that CSTE outperforms the comparison algorithms in identifying paths with the highest average trust values."}
{"id": "2601.10771", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10771", "abs": "https://arxiv.org/abs/2601.10771", "authors": ["Nay Klaimi", "Clément Elvira", "Philippe Mary", "Luc Le Magoarou"], "title": "Physically constrained unfolded multi-dimensional OMP for large MIMO systems", "comment": null, "summary": "Sparse recovery methods are essential for channel estimation and localization in modern communication systems, but their reliability relies on accurate physical models, which are rarely perfectly known. Their computational complexity also grows rapidly with the dictionary dimensions in large MIMO systems. In this paper, we propose MOMPnet, a novel unfolded sparse recovery framework that addresses both the reliability and complexity challenges of traditional methods. By integrating deep unfolding with data-driven dictionary learning, MOMPnet mitigates hardware impairments while preserving interpretability. Instead of a single large dictionary, multiple smaller, independent dictionaries are employed, enabling a low-complexity multidimensional Orthogonal Matching Pursuit algorithm. The proposed unfolded network is evaluated on realistic channel data against multiple baselines, demonstrating its strong performance and potential."}
{"id": "2601.10962", "categories": ["cs.LG", "cond-mat.dis-nn"], "pdf": "https://arxiv.org/pdf/2601.10962", "abs": "https://arxiv.org/abs/2601.10962", "authors": ["Ning Yang", "Yikuan Zhang", "Qi Ouyang", "Chao Tang", "Yuhai Tu"], "title": "Transient learning dynamics drive escape from sharp valleys in Stochastic Gradient Descent", "comment": "15 pages, 6 figures", "summary": "Stochastic gradient descent (SGD) is central to deep learning, yet the dynamical origin of its preference for flatter, more generalizable solutions remains unclear. Here, by analyzing SGD learning dynamics, we identify a nonequilibrium mechanism governing solution selection. Numerical experiments reveal a transient exploratory phase in which SGD trajectories repeatedly escape sharp valleys and transition toward flatter regions of the loss landscape. By using a tractable physical model, we show that the SGD noise reshapes the landscape into an effective potential that favors flat solutions. Crucially, we uncover a transient freezing mechanism: as training proceeds, growing energy barriers suppress inter-valley transitions and ultimately trap the dynamics within a single basin. Increasing the SGD noise strength delays this freezing, which enhances convergence to flatter minima. Together, these results provide a unified physical framework linking learning dynamics, loss-landscape geometry, and generalization, and suggest principles for the design of more effective optimization algorithms."}
{"id": "2601.11373", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11373", "abs": "https://arxiv.org/abs/2601.11373", "authors": ["Pin-Jing Li", "Yu-Chih Huang"], "title": "Polar Orbit Decoding: Universal Parallel Soft Decoding via Automorphism Orbits", "comment": null, "summary": "Binary linear block codes (BLBCs) form the foundation of modern communication systems, yet no single code family simultaneously optimizes all performance aspects. This leads to the widely used multi-code architecture in the standard, significantly increasing the hardware complexity since multiple decoders are required in each piece of equipment. A universal decoding framework based on polar transformations has recently been proposed to unify BLBC decoding under polar-style decoders, but its parallelization has not yet been discussed. In this work, we propose Polar Orbit Decoding (POD), a universal parallel decoding framework for BLBCs. We identify that the automorphisms of BLBCs generate an orbit of permutations that induce diverse decoding trajectories with identical dynamic-frozen constraints after the polar transformations. By decoding over this automorphism orbit in parallel, POD achieves substantial latency-performance tradeoffs without requiring frozen-set readaptation or extra exhaustive permutation searches. Moreover, to enable efficient orbit traversal in the implementation, we represent the automorphism group in a base and strong generating set (BSGS) form using Schreier-Sims algorithms, making offline systematic computation accessible in polynomial time. Simulation results on extended BCH and extended Golay codes demonstrate that POD can achieve maximum-likelihood performance while significantly reducing the decoding latency compared to conventional successive cancellation list decoding."}
{"id": "2601.11129", "categories": ["cs.CR", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.11129", "abs": "https://arxiv.org/abs/2601.11129", "authors": ["Stephan Helfrich", "Emilia Grass"], "title": "A Defender-Attacker-Defender Model for Optimizing the Resilience of Hospital Networks to Cyberattacks", "comment": null, "summary": "Considering the increasing frequency of cyberattacks affecting multiple hospitals simultaneously, improving resilience at a network level is essential. Various countermeasures exist to improve resilience against cyberattacks, such as deploying controls that strengthen IT infrastructures to limit their impact, or enabling resource sharing, patient transfers and backup capacities to maintain services of hospitals in response to realized attacks. However, determining the most cost-effective combination among these wide range of countermeasures is a complex challenge, further intensified by constrained budgets and competing priorities between maintaining efficient daily hospital operations and investing in disaster preparedness. To address these challenges, we propose a defender-attacker-defender optimization model that supports decision-makers in identifying effective strategies for improving the resilience of a network of hospitals against cyberattacks. The model explicitly captures interdependence between hospital services and their supporting IT infrastructures. By doing so, cyberattacks can be directly translated into reductions of service capacities, which allows to assess proactive and reactive strategies on both the operational and technical sides within a single framework. Further, time-dependent resilience measures are incorporated as design objectives to account for the mid- to long-term consequences of cyberattacks. The model is validated based on the German hospital network, suggesting that enabling cooperation with backup capacities particularly in urban areas, alongside strengthening of IT infrastructures across all hospitals, are crucial strategies."}
{"id": "2601.11326", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11326", "abs": "https://arxiv.org/abs/2601.11326", "authors": ["Luisa Schuhmacher", "Jimmy Fernandez Landivar", "Ihsane Gryech", "Hazem Sallouha", "Michele Rossi", "Sofie Pollin"], "title": "Machine Learning on the Edge for Sustainable IoT Networks: A Systematic Literature Review", "comment": "Published in Elsevier Internet of Things", "summary": "The Internet of Things (IoT) has become integral to modern technology, enhancing daily life and industrial processes through seamless connectivity. However, the rapid expansion of IoT systems presents significant sustainability challenges, such as high energy consumption and inefficient resource management. Addressing these issues is critical for the long-term viability of IoT networks. Machine learning (ML), with its proven success across various domains, offers promising solutions for optimizing IoT operations. ML algorithms can learn directly from raw data, uncovering hidden patterns and optimizing processes in dynamic environments. Executing ML at the edge of IoT networks can further enhance sustainability by reducing bandwidth usage, enabling real-time decision-making, and improving data privacy. Additionally, testing ML models on actual hardware is essential to ensure satisfactory performance under real-world conditions, as it captures the complexities and constraints of real-world IoT deployments. Combining ML at the edge and actual hardware testing, therefore, increases the reliability of ML models to effectively improve the sustainability of IoT systems. The present systematic literature review explores how ML can be utilized to enhance the sustainability of IoT networks, examining current methodologies, benefits, challenges, and future opportunities. Through our analysis, we aim to provide insights that will drive future innovations in making IoT networks more sustainable."}
{"id": "2601.10780", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.10780", "abs": "https://arxiv.org/abs/2601.10780", "authors": ["Nursultan Daupayev", "Christian Engel", "Ricky Bendyk", "Soeren Hirsch"], "title": "Adaptive algorithm for microsensor in sustainable environmental monitoring", "comment": null, "summary": "Traditional data collection from sensors produce a lot of data, which lead to constant power consumption and require more storage space. This study proposes an algorithm for a data acquisition and processing method based on Fourier transform (DFT), which extracts dominant frequency components using harmonic analysis (HA) to identify frequency peaks. This algorithm allows sensors to activate only when an event occurs, while preserving critical information for detecting defects, such as those in the surface structures of buildings and ensuring accuracy for further predictions."}
{"id": "2601.10973", "categories": ["cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10973", "abs": "https://arxiv.org/abs/2601.10973", "authors": ["Zain ul Abdeen", "Waris Gill", "Ming Jin"], "title": "Toward Adaptive Grid Resilience: A Gradient-Free Meta-RL Framework for Critical Load Restoration", "comment": null, "summary": "Restoring critical loads after extreme events demands adaptive control to maintain distribution-grid resilience, yet uncertainty in renewable generation, limited dispatchable resources, and nonlinear dynamics make effective restoration difficult. Reinforcement learning (RL) can optimize sequential decisions under uncertainty, but standard RL often generalizes poorly and requires extensive retraining for new outage configurations or generation patterns. We propose a meta-guided gradient-free RL (MGF-RL) framework that learns a transferable initialization from historical outage experiences and rapidly adapts to unseen scenarios with minimal task-specific tuning. MGF-RL couples first-order meta-learning with evolutionary strategies, enabling scalable policy search without gradient computation while accommodating nonlinear, constrained distribution-system dynamics. Experiments on IEEE 13-bus and IEEE 123-bus test systems show that MGF-RL outperforms standard RL, MAML-based meta-RL, and model predictive control across reliability, restoration speed, and adaptation efficiency under renewable forecast errors. MGF-RL generalizes to unseen outages and renewable patterns while requiring substantially fewer fine-tuning episodes than conventional RL. We also provide sublinear regret bounds that relate adaptation efficiency to task similarity and environmental variation, supporting the empirical gains and motivating MGF-RL for real-time load restoration in renewable-rich distribution grids."}
{"id": "2601.11407", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11407", "abs": "https://arxiv.org/abs/2601.11407", "authors": ["Cel Thys", "Rodney Martinez Alonso", "Sofie Pollin"], "title": "Efficient Channel Autoencoders for Wideband Communications leveraging Walsh-Hadamard interleaving", "comment": "16 pages, 17 figures", "summary": "This paper investigates how end-to-end (E2E) channel autoencoders (AEs) can achieve energy-efficient wideband communications by leveraging Walsh-Hadamard (WH) interleaved converters. WH interleaving enables high sampling rate analog-digital conversion with reduced power consumption using an analog WH transformation. We demonstrate that E2E-trained neural coded modulation can transparently adapt to the WH-transceiver hardware without requiring algorithmic redesign. Focusing on the short block length regime, we train WH-domain AEs and benchmark them against standard neural and conventional baselines, including 5G Polar codes. We quantify the system-level energy tradeoffs among baseband compute, channel signal-to-noise ratio (SNR), and analog converter power. Our analysis shows that the proposed WH-AE system can approach conventional Polar code SNR performance within 0.14dB while consuming comparable or lower system power. Compared to the best neural baseline, WH-AE achieves, on average, 29% higher energy efficiency (in bit/J) for the same reliability. These findings establish WH-domain learning as a viable path to energy-efficient, high-throughput wideband communications by explicitly balancing compute complexity, SNR, and analog power consumption."}
{"id": "2601.11173", "categories": ["cs.CR", "cs.LO"], "pdf": "https://arxiv.org/pdf/2601.11173", "abs": "https://arxiv.org/abs/2601.11173", "authors": ["Sirui Shen", "Zunchen Huang", "Chenglu Jin"], "title": "Proving Circuit Functional Equivalence in Zero Knowledge", "comment": null, "summary": "The modern integrated circuit ecosystem is increasingly reliant on third-party intellectual property integration, which introduces security risks, including hardware Trojans and security vulnerabilities. Addressing the resulting trust deadlock between IP vendors and system integrators without exposing proprietary designs requires novel privacy-preserving verification techniques. However, existing privacy-preserving hardware verification methods are all simulation-based and fail to offer formal guarantees. In this paper, we propose ZK-CEC, the first privacy-preserving framework for hardware formal verification. By combining formal verification and zero-knowledge proof (ZKP), ZK-CEC establishes a foundation for formally verifying IP correctness and security without compromising the confidentiality of the designs.\n  We observe that existing zero-knowledge protocols for formal verification are designed to prove statements of public formulas. However, in a privacy-preserving verification context where the formula is secret, these protocols cannot prevent a malicious prover from forging the formula, thereby compromising the soundness of the verification. To address these gaps, we first propose a blueprint for proving the unsatisfiability of a secret design against a public constraint, which is widely applicable to proving properties in software, hardware, and cyber-physical systems. Based on the proposed blueprint, we construct ZK-CEC, which enables a prover to convince the verifier that a secret IP's functionality aligns perfectly with the public specification in zero knowledge, revealing only the length and width of the proof. We implement ZK-CEC and evaluate its performance across various circuits, including arithmetic units and cryptographic components. Experimental results show that ZK-CEC successfully verifies practical designs, such as the AES S-Box, within practical time limits."}
{"id": "2601.11426", "categories": ["eess.SY", "cs.RO", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.11426", "abs": "https://arxiv.org/abs/2601.11426", "authors": ["Abdelrahman Ramadan", "Sidney Givigi"], "title": "Learning-Based Shrinking Disturbance-Invariant Tubes for State- and Input-Dependent Uncertainty", "comment": null, "summary": "We develop a learning-based framework for constructing shrinking disturbance-invariant tubes under state- and input-dependent uncertainty, intended as a building block for tube Model Predictive Control (MPC), and certify safety via a lifted, isotone (order-preserving) fixed-point map. Gaussian Process (GP) posteriors become $(1-α)$ credible ellipsoids, then polytopic outer sets for deterministic set operations. A two-time-scale scheme separates learning epochs, where these polytopes are frozen, from an inner, outside-in iteration that converges to a compact fixed point $Z^\\star\\!\\subseteq\\!\\mathcal G$; its state projection is RPI for the plant. As data accumulate, disturbance polytopes tighten, and the associated tubes nest monotonically, resolving the circular dependence between the set to be verified and the disturbance model while preserving hard constraints. A double-integrator study illustrates shrinking tube cross-sections in data-rich regions while maintaining invariance."}
{"id": "2601.10846", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10846", "abs": "https://arxiv.org/abs/2601.10846", "authors": ["Fabiola Colone", "Filippo Costa", "Yiding Gao", "Chengpeng Hao", "Linjie Yan", "Giuliano Manara", "Danilo Orlando"], "title": "RIS-aided Radar Detection Architectures with Application to Low-RCS Targets", "comment": null, "summary": "In this paper, we address the radar detection of low observable targets with the assistance of a reconfigurable intelligent surface (RIS). Instead of using a multistatic radar network as counter-stealth strategy with its synchronization, costs, phase coherence, and energy consumption issues, we exploit a RIS to form a joint monostatic and bistatic configuration that can intercept the energy backscattered by the target along irrelevant directions different from the line-of-sight of the radar. Then, this energy is redirected towards the radar that capitalizes all the backscattered energy to detect the low observable target. To this end, five different detection architectures are devised that jointly process monostatic and bistatic echoes and exhibit the constant false alarm rate property at least with respect to the clutter power. To support the practical implementation, we also provide a guideline for the design of a RIS that satisfies the operating requirements of the considered application. The performance analysis is carried out in comparison with conventional detectors and shows that the proposed strategy leads to effective solutions to the detection of low observable targets."}
{"id": "2601.10987", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10987", "abs": "https://arxiv.org/abs/2601.10987", "authors": ["Aanand Balasubramanian", "Sashank Silwal"], "title": "Reasoning Distillation for Lightweight Automated Program Repair", "comment": "8 pages, 5 tables. Preprint", "summary": "We study whether lightweight symbolic reasoning supervision can improve fix type classification in compact automated program repair models. Small code models are attractive for resource-constrained settings, but they typically produce only a single prediction, making it unclear whether they learn meaningful program structure or rely on shallow correlations. We propose a reasoning distillation approach in which a large teacher model provides structured symbolic reasoning tags alongside fix-type labels. These tags capture high-level causal properties of bugs without relying on free-form explanations. We train a CodeT5-based student model under label-only and reasoning-distilled settings on the IntroClass benchmark. Reasoning supervision consistently improves macro averaged performance, particularly on less frequent bug categories, without increasing model size or complexity. We further analyze the relationship between reasoning accuracy and fix-type prediction, showing that correct reasoning traces strongly correlate with correct predictions, while not fully determining them. Our results suggest that symbolic reasoning distillation is a practical way to improve interpretability and robustness in lightweight program repair models."}
{"id": "2601.11498", "categories": ["cs.IT", "cs.NI", "eess.SP", "quant-ph"], "pdf": "https://arxiv.org/pdf/2601.11498", "abs": "https://arxiv.org/abs/2601.11498", "authors": ["Alptug Aytekin", "Mohamed Nomeir", "Lei Hu", "Sennur Ulukus"], "title": "Convergence Properties of Good Quantum Codes for Classical Communication", "comment": null, "summary": "An important part of the information theory folklore had been about the output statistics of codes that achieve the capacity and how the empirical distributions compare to the output distributions induced by the optimal input in the channel capacity problem. Results for a variety of such empirical output distributions of good codes have been known in the literature, such as the comparison of the output distribution of the code to the optimal output distribution in vanishing and non-vanishing error probability cases. Motivated by these, we aim to achieve similar results for the quantum codes that are used for classical communication, that is the setting in which the classical messages are communicated through quantum codewords that pass through a noisy quantum channel. We first show the uniqueness of the optimal output distribution, to be able to talk more concretely about the optimal output distribution. Then, we extend the vanishing error probability results to the quantum case, by using techniques that are close in spirit to the classical case. We also extend non-vanishing error probability results to the quantum case on block codes, by using the second-order converses for such codes based on hypercontractivity results for the quantum generalized depolarizing semi-groups."}
{"id": "2601.11199", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11199", "abs": "https://arxiv.org/abs/2601.11199", "authors": ["Aiman Al Masoud", "Marco Arazzi", "Antonino Nocera"], "title": "SD-RAG: A Prompt-Injection-Resilient Framework for Selective Disclosure in Retrieval-Augmented Generation", "comment": null, "summary": "Retrieval-Augmented Generation (RAG) has attracted significant attention due to its ability to combine the generative capabilities of Large Language Models (LLMs) with knowledge obtained through efficient retrieval mechanisms over large-scale data collections. Currently, the majority of existing approaches overlook the risks associated with exposing sensitive or access-controlled information directly to the generation model. Only a few approaches propose techniques to instruct the generative model to refrain from disclosing sensitive information; however, recent studies have also demonstrated that LLMs remain vulnerable to prompt injection attacks that can override intended behavioral constraints. For these reasons, we propose a novel approach to Selective Disclosure in Retrieval-Augmented Generation, called SD-RAG, which decouples the enforcement of security and privacy constraints from the generation process itself. Rather than relying on prompt-level safeguards, SD-RAG applies sanitization and disclosure controls during the retrieval phase, prior to augmenting the language model's input. Moreover, we introduce a semantic mechanism to allow the ingestion of human-readable dynamic security and privacy constraints together with an optimized graph-based data model that supports fine-grained, policy-aware retrieval. Our experimental evaluation demonstrates the superiority of SD-RAG over baseline existing approaches, achieving up to a $58\\%$ improvement in the privacy score, while also showing a strong resilience to prompt injection attacks targeting the generative model."}
{"id": "2601.11453", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11453", "abs": "https://arxiv.org/abs/2601.11453", "authors": ["Matt Baughman", "Marena Trujillo", "Bri-Mathias Hodge", "Emily Jensen"], "title": "Implications of Grid-Forming Inverter Parameters on Disturbance Localization and Controllability", "comment": null, "summary": "The shift from traditional synchronous generator (SG) based power generation to generation driven by power electronic devices introduces new dynamic phenomena and considerations for the control of large-scale power systems. In this paper, two aspects of all-inverter power systems are investigated: greater localization of system disturbance response and greater system controllability. The prevalence of both of these aspects are shown to be related to the lower effective inertia of inverters and have implications for future widearea control system design. Greater disturbance localization implies the need for feedback measurement placement close to generator nodes to properly reject disturbances in the system while increased system controllability implies that widearea control systems should preferentially actuate inverters to most efficiently control the system. This investigation utilizes reduced-order linear time-invariant models of both SGs and inverters that are shown to capture the frequency dynamics of interest in both all-SG and all-inverter systems, allowing for the efficient use of both frequency and time domain analysis methods."}
{"id": "2601.10963", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10963", "abs": "https://arxiv.org/abs/2601.10963", "authors": ["Xiang Cheng", "Boxun Liu", "Xuanyu Liu", "Xuesong Cai"], "title": "Large Wireless Foundation Models: Stronger over Bigger", "comment": null, "summary": "AI-communication integration is widely regarded as a core enabling technology for 6G. Most existing AI-based physical-layer designs rely on task-specific models that are separately tailored to individual modules, resulting in poor generalization. In contrast, communication systems are inherently general-purpose and should support broad applicability and robustness across diverse scenarios. Foundation models offer a promising solution through strong reasoning and generalization, yet wireless-system constraints hinder a direct transfer of large language model (LLM)-style success to the wireless domain. Therefore, we introduce the concept of large wireless foundation models (LWFMs) and present a novel framework for empowering the physical layer with foundation models under wireless constraints. Specifically, we propose two paradigms for realizing LWFMs, including leveraging existing general-purpose foundation models and building novel wireless foundation models. Based on recent progress, we distill two roadmaps for each paradigm and formulate design principles under wireless constraints. We further provide case studies of LWFM-empowered wireless systems to intuitively validate their advantages. Finally, we characterize the notion of \"large\" in LWFMs through a multidimensional analysis of existing work and outline promising directions for future research."}
{"id": "2601.10992", "categories": ["cs.LG", "stat.CO"], "pdf": "https://arxiv.org/pdf/2601.10992", "abs": "https://arxiv.org/abs/2601.10992", "authors": ["Kisung You"], "title": "Constant Metric Scaling in Riemannian Computation", "comment": null, "summary": "Constant rescaling of a Riemannian metric appears in many computational settings, often through a global scale parameter that is introduced either explicitly or implicitly. Although this operation is elementary, its consequences are not always made clear in practice and may be confused with changes in curvature, manifold structure, or coordinate representation. In this note we provide a short, self-contained account of constant metric scaling on arbitrary Riemannian manifolds. We distinguish between quantities that change under such a scaling, including norms, distances, volume elements, and gradient magnitudes, and geometric objects that remain invariant, such as the Levi--Civita connection, geodesics, exponential and logarithmic maps, and parallel transport. We also discuss implications for Riemannian optimization, where constant metric scaling can often be interpreted as a global rescaling of step sizes rather than a modification of the underlying geometry. The goal of this note is purely expository and is intended to clarify how a global metric scale parameter can be introduced in Riemannian computation without altering the geometric structures on which these methods rely."}
{"id": "2601.11501", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11501", "abs": "https://arxiv.org/abs/2601.11501", "authors": ["Frederik Walter", "Maria Abu-Sini", "Nils Weinhardt", "Antonia Wachter-Zeh"], "title": "Coding Schemes for the Noisy Torn Paper Channel", "comment": null, "summary": "To make DNA a suitable medium for archival data storage, it is essential to consider the decay process of the strands observed in DNA storage systems. This paper studies the decay process as a probabilistic noisy torn paper channel (TPC), which first corrupts the bits of the transmitted sequence in a probabilistic manner by substitutions, then breaks the sequence into a set of noisy unordered substrings. The present work devises coding schemes for the noisy TPC by embedding markers in the transmitted sequence. We investigate the use of static markers and markers connected to the data in the form of hash functions. These two tools have also been recently exploited to tackle the noiseless TPC. Simulations show that static markers excel at higher substitution probabilities, while data-dependent markers are superior at lower noise levels. Both approaches achieve reconstruction rates exceeding $99\\%$ with no false decodings observed, primarily limited by computational resources."}
{"id": "2601.11207", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11207", "abs": "https://arxiv.org/abs/2601.11207", "authors": ["Marco Arazzi", "Antonino Nocera"], "title": "LoRA as Oracle", "comment": null, "summary": "Backdoored and privacy-leaking deep neural networks pose a serious threat to the deployment of machine learning systems in security-critical settings. Existing defenses for backdoor detection and membership inference typically require access to clean reference models, extensive retraining, or strong assumptions about the attack mechanism. In this work, we introduce a novel LoRA-based oracle framework that leverages low-rank adaptation modules as a lightweight, model-agnostic probe for both backdoor detection and membership inference.\n  Our approach attaches task-specific LoRA adapters to a frozen backbone and analyzes their optimization dynamics and representation shifts when exposed to suspicious samples. We show that poisoned and member samples induce distinctive low-rank updates that differ significantly from those generated by clean or non-member data. These signals can be measured using simple ranking and energy-based statistics, enabling reliable inference without access to the original training data or modification of the deployed model."}
{"id": "2601.10746", "categories": ["eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10746", "abs": "https://arxiv.org/abs/2601.10746", "authors": ["Yuxin Yang", "Hang Zhou", "Hourong Song", "Branislav Hredzak"], "title": "On the static and small signal analysis of DAB converter", "comment": null, "summary": "This document develops a method to solve the periodic operating point of Dual-Active-Bridge (DAB)."}
{"id": "2601.10972", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10972", "abs": "https://arxiv.org/abs/2601.10972", "authors": ["Mengning Li", "Wenye Wang"], "title": "DuTrack: Long-Term Indoor Human Tracking with Dual-Channel Sensing and Inference", "comment": null, "summary": "Wi-Fi tracking technology demonstrates promising potential for future smart home and intelligent family care. Currently, accurate Wi-Fi tracking methods rely primarily on fine-grained velocity features. However, such velocity-based approaches suffer from the problem of accumulative errors, making it challenging to stably track users' trajectories over a long period of time. This paper presents DuTrack, a fusion-based tracking system for stable human tracking. The fundamental idea is to leverage the ubiquitous acoustic signals in households to rectify the accumulative Wi-Fi tracking error. Theoretically, Wi-Fi sensing in line-of-sight (LoS) and non-line-of-sight (NLoS) scenarios can be modeled as elliptical Fresnel zones and hyperbolic zones, respectively. By designing acoustic sensing signals, we are able to model the acoustic sensing zones as a series of hyperbolic clusters. We reveal how to fuse the fields of electromagnetic waves and mechanical waves, and establish the optimization equation. Next, we design a data-driven architecture to solve the aforementioned optimization equation. Experimental results show that the proposed multimodal tracking scheme exhibits superior performance. We achieve a 89.37% reduction in median tracking error compared to model-based methods and a 65.02% reduction compared to data-driven methods."}
{"id": "2601.11006", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11006", "abs": "https://arxiv.org/abs/2601.11006", "authors": ["Simi D Kuniyilh", "Rita Machacy"], "title": "Backdoor Attacks on Multi-modal Contrastive Learning", "comment": null, "summary": "Contrastive learning has become a leading self- supervised approach to representation learning across domains, including vision, multimodal settings, graphs, and federated learning. However, recent studies have shown that contrastive learning is susceptible to backdoor and data poisoning attacks. In these attacks, adversaries can manipulate pretraining data or model updates to insert hidden malicious behavior. This paper offers a thorough and comparative review of backdoor attacks in contrastive learning. It analyzes threat models, attack methods, target domains, and available defenses. We summarize recent advancements in this area, underline the specific vulnerabilities inherent to contrastive learning, and discuss the challenges and future research directions. Our findings have significant implications for the secure deployment of systems in industrial and distributed environments."}
{"id": "2601.11520", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11520", "abs": "https://arxiv.org/abs/2601.11520", "authors": ["Mengyuan Zhao", "Maël Le Treust", "Tobias J. Oechtering"], "title": "Empirical Coordination over Markov Channel with Independent Source", "comment": null, "summary": "We study joint source-channel coding over Markov channels through the empirical coordination framework. More specifically, we aim at determining the empirical distributions of source and channel symbols that can be induced by a coding scheme. We consider strictly causal encoders that generate channel inputs, without access to the past channel states, henceforth driving the current Markov state evolution. Our main result is the single-letter inner and outer bounds of the set of achievable joint distributions, coordinating all the symbols in the network. To establish the inner bound, we introduce a new notion of typicality, the input-driven Markov typicality, and develop its fundamental properties. Contrary to the classical block-Markov coding schemes that rely on blockwise independence for discrete memoryless channels, our analysis directly exploits the Markov channel structure and improves beyond the independence-based arguments."}
{"id": "2601.11210", "categories": ["cs.CR", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.11210", "abs": "https://arxiv.org/abs/2601.11210", "authors": ["Li Wang", "Wenyu Chen", "Ning Yu", "Zheng Li", "Shanqing Guo"], "title": "VidLeaks: Membership Inference Attacks Against Text-to-Video Models", "comment": null, "summary": "The proliferation of powerful Text-to-Video (T2V) models, trained on massive web-scale datasets, raises urgent concerns about copyright and privacy violations. Membership inference attacks (MIAs) provide a principled tool for auditing such risks, yet existing techniques - designed for static data like images or text - fail to capture the spatio-temporal complexities of video generation. In particular, they overlook the sparsity of memorization signals in keyframes and the instability introduced by stochastic temporal dynamics. In this paper, we conduct the first systematic study of MIAs against T2V models and introduce a novel framework VidLeaks, which probes sparse-temporal memorization through two complementary signals: 1) Spatial Reconstruction Fidelity (SRF), using a Top-K similarity to amplify spatial memorization signals from sparsely memorized keyframes, and 2) Temporal Generative Stability (TGS), which measures semantic consistency across multiple queries to capture temporal leakage. We evaluate VidLeaks under three progressively restrictive black-box settings - supervised, reference-based, and query-only. Experiments on three representative T2V models reveal severe vulnerabilities: VidLeaks achieves AUC of 82.92% on AnimateDiff and 97.01% on InstructVideo even in the strict query-only setting, posing a realistic and exploitable privacy risk. Our work provides the first concrete evidence that T2V models leak substantial membership information through both sparse and temporal memorization, establishing a foundation for auditing video generation systems and motivating the development of new defenses. Code is available at: https://zenodo.org/records/17972831."}
{"id": "2601.10929", "categories": ["cs.CR", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10929", "abs": "https://arxiv.org/abs/2601.10929", "authors": ["Dalibor Sain", "Thomas Rosenstatter", "Olaf Saßnick", "Christian Schäfer", "Stefan Huber"], "title": "Secure Data Bridging in Industry 4.0: An OPC UA Aggregation Approach for Including Insecure Legacy Systems", "comment": null, "summary": "The increased connectivity of industrial networks has led to a surge in cyberattacks, emphasizing the need for cybersecurity measures tailored to the specific requirements of industrial systems. Modern Industry 4.0 technologies, such as OPC UA, offer enhanced resilience against these threats. However, widespread adoption remains limited due to long installation times, proprietary technology, restricted flexibility, and formal process requirements (e.g. safety certifications). Consequently, many systems do not yet implement these technologies, or only partially. This leads to the challenge of dealing with so-called brownfield systems, which are often placed in isolated security zones to mitigate risks. However, the need for data exchange between secure and insecure zones persists.\n  This paper reviews existing solutions to address this challenge by analysing their approaches, advantages, and limitations. Building on these insights, we identify three key concepts, evaluate their suitability and compatibility, and ultimately introduce the SigmaServer, a novel TCP-level aggregation method. The developed proof-of-principle implementation is evaluated in an operational technology (OT) testbed, demonstrating its applicability and effectiveness in bridging secure and insecure zones."}
{"id": "2601.10978", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10978", "abs": "https://arxiv.org/abs/2601.10978", "authors": ["Nan An", "Hongyi He", "Fang Yang", "Chang Liu", "Jian Song", "Zhu Han", "Binbin Zhu"], "title": "Delay-Aware Task Offloading for Heterogeneous VLC-RF-based Vehicular Fog Computing", "comment": null, "summary": "Vehicular fog computing (VFC) is a promising paradigm for reducing the computation burden of vehicles, thus supporting delay-sensitive services in next-generation transportation networks. However, traditional VFC schemes rely on radio frequency (RF) communications, which limits their adaptability for dense vehicular environments. In this paper, a heterogeneous visible light communication (VLC)-RF architecture is designed for VFC systems to facilitate efficient task offloading. Specifically, computing tasks are dynamically partitioned and offloaded to idle vehicles via both VLC and RF links, thereby fully exploiting the interference resilience of VLC and the coverage advantage of RF. To minimize the average task processing delay (TPD), an optimization problem of task offloading and computing resource allocation is formulated, and then solved by the developed residual-based majorization-minimization (RBMM) algorithm. Simulation results confirm that the heterogeneous VLC-RF architecture with the proposed algorithm achieves a 15% average TPD reduction compared to VFC systems relying solely on VLC or RF."}
{"id": "2601.11021", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11021", "abs": "https://arxiv.org/abs/2601.11021", "authors": ["Kecheng Cai", "Chenyang Xu", "Chao Peng"], "title": "Combating Spurious Correlations in Graph Interpretability via Self-Reflection", "comment": null, "summary": "Interpretable graph learning has recently emerged as a popular research topic in machine learning. The goal is to identify the important nodes and edges of an input graph that are crucial for performing a specific graph reasoning task. A number of studies have been conducted in this area, and various benchmark datasets have been proposed to facilitate evaluation. Among them, one of the most challenging is the Spurious-Motif benchmark, introduced at ICLR 2022. The datasets in this synthetic benchmark are deliberately designed to include spurious correlations, making it particularly difficult for models to distinguish truly relevant structures from misleading patterns. As a result, existing methods exhibit significantly worse performance on this benchmark compared to others.\n  In this paper, we focus on improving interpretability on the challenging Spurious-Motif datasets. We demonstrate that the self-reflection technique, commonly used in large language models to tackle complex tasks, can also be effectively adapted to enhance interpretability in datasets with strong spurious correlations. Specifically, we propose a self-reflection framework that can be integrated with existing interpretable graph learning methods. When such a method produces importance scores for each node and edge, our framework feeds these predictions back into the original method to perform a second round of evaluation. This iterative process mirrors how large language models employ self-reflective prompting to reassess their previous outputs. We further analyze the reasons behind this improvement from the perspective of graph representation learning, which motivates us to propose a fine-tuning training method based on this feedback mechanism."}
{"id": "2601.10780", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.10780", "abs": "https://arxiv.org/abs/2601.10780", "authors": ["Nursultan Daupayev", "Christian Engel", "Ricky Bendyk", "Soeren Hirsch"], "title": "Adaptive algorithm for microsensor in sustainable environmental monitoring", "comment": null, "summary": "Traditional data collection from sensors produce a lot of data, which lead to constant power consumption and require more storage space. This study proposes an algorithm for a data acquisition and processing method based on Fourier transform (DFT), which extracts dominant frequency components using harmonic analysis (HA) to identify frequency peaks. This algorithm allows sensors to activate only when an event occurs, while preserving critical information for detecting defects, such as those in the surface structures of buildings and ensuring accuracy for further predictions."}
{"id": "2601.11368", "categories": ["cs.CR", "cs.AR"], "pdf": "https://arxiv.org/pdf/2601.11368", "abs": "https://arxiv.org/abs/2601.11368", "authors": ["Ishraq Tashdid", "Tasnuva Farheen", "Sazadur Rahman"], "title": "InterPUF: Distributed Authentication via Physically Unclonable Functions and Multi-party Computation for Reconfigurable Interposers", "comment": "Accepted to IEEE International Symposium on Hardware Oriented Security and Trust (HOST) 2026", "summary": "Modern system-in-package (SiP) platforms increasingly adopt reconfigurable interposers to enable plug-and-play chiplet integration across heterogeneous multi-vendor ecosystems. However, this flexibility introduces severe trust challenges, as traditional authentication schemes fail to scale or adapt in decentralized, post-fabrication programmable environments. This paper presents InterPUF, a compact and scalable authentication framework that transforms the interposer into a distributed root of trust. InterPUF embeds a route-based differential delay physically unclonable function (PUF) across the reconfigurable interconnect and secures authentication using multi-party computation (MPC), ensuring raw PUF signatures are never exposed. Our hardware evaluation shows only 0.23% area and 0.072% power overhead across diverse chiplets while preserving authentication latency within tens of nanoseconds. Simulation results using pyPUF confirm strong uniqueness, reliability, and modeling resistance under process, voltage, and temperature variations. By combining interposer-resident PUF primitives with cryptographic hashing and collaborative verification, InterPUF enforces a minimal-trust authentication model without relying on a centralized anchor."}
{"id": "2601.10973", "categories": ["cs.LG", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.10973", "abs": "https://arxiv.org/abs/2601.10973", "authors": ["Zain ul Abdeen", "Waris Gill", "Ming Jin"], "title": "Toward Adaptive Grid Resilience: A Gradient-Free Meta-RL Framework for Critical Load Restoration", "comment": null, "summary": "Restoring critical loads after extreme events demands adaptive control to maintain distribution-grid resilience, yet uncertainty in renewable generation, limited dispatchable resources, and nonlinear dynamics make effective restoration difficult. Reinforcement learning (RL) can optimize sequential decisions under uncertainty, but standard RL often generalizes poorly and requires extensive retraining for new outage configurations or generation patterns. We propose a meta-guided gradient-free RL (MGF-RL) framework that learns a transferable initialization from historical outage experiences and rapidly adapts to unseen scenarios with minimal task-specific tuning. MGF-RL couples first-order meta-learning with evolutionary strategies, enabling scalable policy search without gradient computation while accommodating nonlinear, constrained distribution-system dynamics. Experiments on IEEE 13-bus and IEEE 123-bus test systems show that MGF-RL outperforms standard RL, MAML-based meta-RL, and model predictive control across reliability, restoration speed, and adaptation efficiency under renewable forecast errors. MGF-RL generalizes to unseen outages and renewable patterns while requiring substantially fewer fine-tuning episodes than conventional RL. We also provide sublinear regret bounds that relate adaptation efficiency to task similarity and environmental variation, supporting the empirical gains and motivating MGF-RL for real-time load restoration in renewable-rich distribution grids."}
{"id": "2601.10980", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.10980", "abs": "https://arxiv.org/abs/2601.10980", "authors": ["Mengning Li", "Wenye Wang"], "title": "Uni-Fi: Integrated Multi-Task Wi-Fi Sensing", "comment": null, "summary": "Wi-Fi sensing technology enables non-intrusive, continuous monitoring of user locations and activities, which supports diverse smart home applications. Since different sensing tasks exhibit contextual relationships, their integration can enhance individual module performance. However, integrating sensing tasks across different research efforts faces challenges due to the absence of two key elements. The first is a unified architecture that captures the fundamental nature shared across diverse sensing tasks. The second is an extensible pipeline that can integrate sensing methodologies proposed in potential future research. This paper presents Uni-Fi, an extensible framework for multi-task Wi-Fi sensing integration. This paper makes the following contributions. First, we propose a unified theoretical framework that reveals the fundamental differences between single-task and multi-task sensing. Second, we develop a scalable sensing pipeline that automatically generates multi-task sensing solvers, enabling seamless integration of multiple sensing models. Experimental results show that Uni-Fi achieves robust performance across tasks, with a localization error of approximately 0.54 meters, 98.34 percent accuracy for activity classification, and 98.57 percent accuracy for presence detection."}
{"id": "2601.11022", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.11022", "abs": "https://arxiv.org/abs/2601.11022", "authors": ["Sravan Danda", "Aditya Challa", "Shlok Mehendale", "Snehanshu Saha"], "title": "Matching High-Dimensional Geometric Quantiles for Test-Time Adaptation of Transformers and Convolutional Networks Alike", "comment": null, "summary": "Test-time adaptation (TTA) refers to adapting a classifier for the test data when the probability distribution of the test data slightly differs from that of the training data of the model. To the best of our knowledge, most of the existing TTA approaches modify the weights of the classifier relying heavily on the architecture. It is unclear as to how these approaches are extendable to generic architectures. In this article, we propose an architecture-agnostic approach to TTA by adding an adapter network pre-processing the input images suitable to the classifier. This adapter is trained using the proposed quantile loss. Unlike existing approaches, we correct for the distribution shift by matching high-dimensional geometric quantiles. We prove theoretically that under suitable conditions minimizing quantile loss can learn the optimal adapter. We validate our approach on CIFAR10-C, CIFAR100-C and TinyImageNet-C by training both classic convolutional and transformer networks on CIFAR10, CIFAR100 and TinyImageNet datasets."}
{"id": "2601.11438", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11438", "abs": "https://arxiv.org/abs/2601.11438", "authors": ["Qiaosen Zhang", "Matteo Nerini", "Bruno Clerckx"], "title": "Channel Estimation in MIMO Systems Aided by Microwave Linear Analog Computers (MiLACs)", "comment": "Submitted to IEEE for publication", "summary": "Microwave linear analog computers (MiLACs) have recently emerged as a promising solution for future gigantic multiple-input multiple-output (MIMO) systems, enabling beamforming with greatly reduced hardware and computational cost. However, channel estimation for MiLAC-aided systems remains an open problem. Conventional least squares (LS) and minimum mean square error (MMSE) estimation rely on intensive digital computation, which undermines the benefits offered by MiLACs. In this letter, we propose efficient LS and MMSE channel estimation schemes for MiLAC-aided MIMO systems. By designing training precoders and combiners implemented by MiLACs, both LS and MMSE estimation are performed fully in the analog domain, achieving identical performance to their digital counterparts while significantly reducing computational complexity, transmit RF chains, analog-to-digital/digital-to-analog converters (ADCs/DACs) resolution requirements, and peak-to-average power ratio (PAPR). Numerical results verify the effectiveness and advantages of the proposed schemes."}
{"id": "2601.11398", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.11398", "abs": "https://arxiv.org/abs/2601.11398", "authors": ["Kurt Thomas", "Sai Teja Peddinti", "Sarah Meiklejohn", "Tara Matthews", "Amelia Hassoun", "Animesh Srivastava", "Jessica McClearn", "Patrick Gage Kelley", "Sunny Consolvo", "Nina Taft"], "title": "Understanding Help Seeking for Digital Privacy, Safety, and Security", "comment": null, "summary": "The complexity of navigating digital privacy, safety, and security threats often falls directly on users. This leads to users seeking help from family and peers, platforms and advice guides, dedicated communities, and even large language models (LLMs). As a precursor to improving resources across this ecosystem, our community needs to understand what help seeking looks like in the wild. To that end, we blend qualitative coding with LLM fine-tuning to sift through over one billion Reddit posts from the last four years to identify where and for what users seek digital privacy, safety, or security help. We isolate three million relevant posts with 93% precision and recall and automatically annotate each with the topics discussed (e.g., security tools, privacy configurations, scams, account compromise, content moderation, and more). We use this dataset to understand the scope and scale of help seeking, the communities that provide help, and the types of help sought. Our work informs the development of better resources for users (e.g., user guides or LLM help-giving agents) while underscoring the inherent challenges of supporting users through complex combinations of threats, platforms, mitigations, context, and emotions."}
{"id": "2601.11352", "categories": ["cs.LG", "cs.PF", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11352", "abs": "https://arxiv.org/abs/2601.11352", "authors": ["Akhilesh Raj", "Swann Perarnau", "Aniruddha Gokhale", "Solomon Bekele Abera"], "title": "Offline Reinforcement-Learning-Based Power Control for Application-Agnostic Energy Efficiency", "comment": "11 pages, 5 figures, 3 tables and unpublished", "summary": "Energy efficiency has become an integral aspect of modern computing infrastructure design, impacting the performance, cost, scalability, and durability of production systems. The incorporation of power actuation and sensing capabilities in CPU designs is indicative of this, enabling the deployment of system software that can actively monitor and adjust energy consumption and performance at runtime. While reinforcement learning (RL) would seem ideal for the design of such energy efficiency control systems, online training presents challenges ranging from the lack of proper models for setting up an adequate simulated environment, to perturbation (noise) and reliability issues, if training is deployed on a live system.\n  In this paper we discuss the use of offline reinforcement learning as an alternative approach for the design of an autonomous CPU power controller, with the goal of improving the energy efficiency of parallel applications at runtime without unduly impacting their performance. Offline RL sidesteps the issues incurred by online RL training by leveraging a dataset of state transitions collected from arbitrary policies prior to training.\n  Our methodology applies offline RL to a gray-box approach to energy efficiency, combining online application-agnostic performance data (e.g., heartbeats) and hardware performance counters to ensure that the scientific objectives are met with limited performance degradation. Evaluating our method on a variety of compute-bound and memory-bound benchmarks and controlling power on a live system through Intel's Running Average Power Limit, we demonstrate that such an offline-trained agent can substantially reduce energy consumption at a tolerable performance degradation cost."}
{"id": "2601.11110", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11110", "abs": "https://arxiv.org/abs/2601.11110", "authors": ["Marcus Henninger", "Lucas Giroto", "Ahmed Elkelesh", "Silvio Mandelli"], "title": "Hybrid Resource Allocation Scheme for Bistatic ISAC with Data Channels", "comment": "6 pages, 5 figures. This work has been submitted to the IEEE for possible publication", "summary": "Bistatic integrated sensing and communication (ISAC) enables efficient reuse of the existing cellular infrastructure and is likely to play an important role in future sensing networks. In this context, ISAC using the data channel is a promising approach to improve the bistatic sensing performance compared to relying solely on pilots. One of the challenges associated with this approach is resource allocation: the communication link aims to transmit higher modulation order (MO) symbols to maximize the throughput, whereas a lower MO is preferable for sensing to achieve a higher signal-to-noise ratio in the radar image. To address this conflict, this paper introduces a hybrid resource allocation scheme. By placing lower MO symbols as pseudo-pilots on a suitable sensing grid, we enhance the bistatic sensing performance while only slightly reducing the spectral efficiency of the communication link. Simulation results validate our approach against different baselines and provide practical insights into how decoding errors affect the sensing performance."}
{"id": "2601.11028", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11028", "abs": "https://arxiv.org/abs/2601.11028", "authors": ["Xinru Wen", "Weizhong Lin", "zi liu", "Xuan Xiao"], "title": "AVP-Pro: An Adaptive Multi-Modal Fusion and Contrastive Learning Approach for Comprehensive Two-Stage Antiviral Peptide Identification", "comment": "arXiv admin note: substantial text overlap with arXiv:2512.21544", "summary": "The accurate identification of antiviral peptides (AVPs) is crucial for novel drug development. However, existing methods still have limitations in capturing complex sequence dependencies and distinguishing confusing samples with high similarity. To address these challenges, we propose AVP-Pro, a novel two-stage predictive framework that integrates adaptive feature fusion and contrastive learning. To comprehensively capture the physicochemical properties and deep-seated patterns of peptide sequences, we constructed a panoramic feature space encompassing 10 distinct descriptors and designed a hierarchical fusion architecture. This architecture integrates self-attention and adaptive gating mechanisms to dynamically modulate the weights of local motifs extracted by CNNs and global dependencies captured by BiLSTMs based on sequence context. Targeting the blurred decision boundary caused by the high similarity between positive and negative sample sequences, we adopted an Online Hard Example Mining (OHEM)-driven contrastive learning strategy enhanced by BLOSUM62. This approach significantly sharpened the model's discriminative power. Model evaluation results show that in the first stage of general AVP identification, the model achieved an accuracy of 0.9531 and an MCC of 0.9064, outperforming existing state-of-the-art (SOTA) methods. In the second stage of functional subtype prediction, combined with a transfer learning strategy, the model realized accurate classification of 6 viral families and 8 specific viruses under small-sample conditions. AVP-Pro provides a powerful and interpretable new tool for the high-throughput screening of antiviral drugs. To further enhance accessibility for users, we have developed a user-friendly web interface, which is available at https://wwwy1031-avp-pro.hf.space."}
{"id": "2601.11447", "categories": ["cs.CR", "cs.AR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11447", "abs": "https://arxiv.org/abs/2601.11447", "authors": ["Wadid Foudhaili", "Aykut Rencber", "Anouar Nechi", "Rainer Buchty", "Mladen Berekovic", "Andres Gomez", "Saleh Mulhem"], "title": "IMS: Intelligent Hardware Monitoring System for Secure SoCs", "comment": "The final version is accepted for publication at the Design, Automation & Test in Europe Conference (DATE) 2026", "summary": "In the modern Systems-on-Chip (SoC), the Advanced eXtensible Interface (AXI) protocol exhibits security vulnerabilities, enabling partial or complete denial-of-service (DoS) through protocol-violation attacks. The recent countermeasures lack a dedicated real-time protocol semantic analysis and evade protocol compliance checks. This paper tackles this AXI vulnerability issue and presents an intelligent hardware monitoring system (IMS) for real-time detection of AXI protocol violations. IMS is a hardware module leveraging neural networks to achieve high detection accuracy. For model training, we perform DoS attacks through header-field manipulation and systematic malicious operations, while recording AXI transactions to build a training dataset. We then deploy a quantization-optimized neural network, achieving 98.7% detection accuracy with <=3% latency overhead, and throughput of >2.5 million inferences/s. We subsequently integrate this IMS into a RISC-V SoC as a memory-mapped IP core to monitor its AXI bus. For demonstration and initial assessment for later ASIC integration, we implemented this IMS on an AMD Zynq UltraScale+ MPSoC ZCU104 board, showing an overall small hardware footprint (9.04% look-up-tables (LUTs), 0.23% DSP slices, and 0.70% flip-flops) and negligible impact on the overall design's achievable frequency. This demonstrates the feasibility of lightweight, security monitoring for resource-constrained edge environments."}
{"id": "2601.11505", "categories": ["cs.LG", "cs.AI", "eess.SY", "q-bio.QM"], "pdf": "https://arxiv.org/pdf/2601.11505", "abs": "https://arxiv.org/abs/2601.11505", "authors": ["Miriam K. Wolff", "Peter Calhoun", "Eleonora Maria Aiello", "Yao Qin", "Sam F. Royston"], "title": "MetaboNet: The Largest Publicly Available Consolidated Dataset for Type 1 Diabetes Management", "comment": "22 pages, 5 figures, 7 supplementary figures, submitted to JDST", "summary": "Progress in Type 1 Diabetes (T1D) algorithm development is limited by the fragmentation and lack of standardization across existing T1D management datasets. Current datasets differ substantially in structure and are time-consuming to access and process, which impedes data integration and reduces the comparability and generalizability of algorithmic developments. This work aims to establish a unified and accessible data resource for T1D algorithm development. Multiple publicly available T1D datasets were consolidated into a unified resource, termed the MetaboNet dataset. Inclusion required the availability of both continuous glucose monitoring (CGM) data and corresponding insulin pump dosing records. Additionally, auxiliary information such as reported carbohydrate intake and physical activity was retained when present. The MetaboNet dataset comprises 3135 subjects and 1228 patient-years of overlapping CGM and insulin data, making it substantially larger than existing standalone benchmark datasets. The resource is distributed as a fully public subset available for immediate download at https://metabo-net.org/ , and with a Data Use Agreement (DUA)-restricted subset accessible through their respective application processes. For the datasets in the latter subset, processing pipelines are provided to automatically convert the data into the standardized MetaboNet format. A consolidated public dataset for T1D research is presented, and the access pathways for both its unrestricted and DUA-governed components are described. The resulting dataset covers a broad range of glycemic profiles and demographics and thus can yield more generalizable algorithmic performance than individual datasets."}
{"id": "2601.11116", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11116", "abs": "https://arxiv.org/abs/2601.11116", "authors": ["Yuki Nakamura", "Shingo Takemoto", "Shunsuke Ono"], "title": "Comprehensive Robust Dynamic Mode Decomposition from Mode Extraction to Dimensional Reduction", "comment": "Submitted to IEEE Transactions on Signal Processing. The source code is available at https://github.com/MDI-TokyoTech/Comprehensive-Robust-Dynamic-Mode-Decomposition. The project page is https://www.mdi.c.titech.ac.jp/publications/cr-dmd", "summary": "We propose Comprehensive Robust Dynamic Mode Decomposition (CR-DMD), a novel framework that robustifies the entire DMD process - from mode extraction to dimensional reduction - against mixed noise. Although standard DMD widely used for uncovering spatio-temporal patterns and constructing low-dimensional models of dynamical systems, it suffers from significant performance degradation under noise due to its reliance on least-squares estimation for computing the linear time evolution operator. Existing robust variants typically modify the least-squares formulation, but they remain unstable and fail to ensure faithful low-dimensional representations. First, we introduce a convex optimization-based preprocessing method designed to effectively remove mixed noise, achieving accurate and stable mode extraction. Second, we propose a new convex formulation for dimensional reduction that explicitly links the robustly extracted modes to the original noisy observations, constructing a faithful representation of the original data via a sparse weighted sum of the modes. Both stages are efficiently solved by a preconditioned primal-dual splitting method. Experiments on fluid dynamics datasets demonstrate that CR-DMD consistently outperforms state-of-the-art robust DMD methods in terms of mode accuracy and fidelity of low-dimensional representations under noisy conditions."}
{"id": "2601.11036", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11036", "abs": "https://arxiv.org/abs/2601.11036", "authors": ["Kecheng Cai", "Chao Peng", "Chenyang Xu", "Xia Chen"], "title": "Self-Augmented Mixture-of-Experts for QoS Prediction", "comment": null, "summary": "Quality of Service (QoS) prediction is one of the most fundamental problems in service computing and personalized recommendation. In the problem, there is a set of users and services, each associated with a set of descriptive features. Interactions between users and services produce feedback values, typically represented as numerical QoS metrics such as response time or availability. Given the observed feedback for a subset of user-service pairs, the goal is to predict the QoS values for the remaining pairs.\n  A key challenge in QoS prediction is the inherent sparsity of user-service interactions, as only a small subset of feedback values is typically observed. To address this, we propose a self-augmented strategy that leverages a model's own predictions for iterative refinement. In particular, we partially mask the predicted values and feed them back into the model to predict again. Building on this idea, we design a self-augmented mixture-of-experts model, where multiple expert networks iteratively and collaboratively estimate QoS values. We find that the iterative augmentation process naturally aligns with the MoE architecture by enabling inter-expert communication: in the second round, each expert receives the first-round predictions and refines its output accordingly. Experiments on benchmark datasets show that our method outperforms existing baselines and achieves competitive results."}
{"id": "2601.11113", "categories": ["cs.LG", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.11113", "abs": "https://arxiv.org/abs/2601.11113", "authors": ["Lele Zheng", "Xiang Wang", "Tao Zhang", "Yang Cao", "Ke Cheng", "Yulong Shen"], "title": "Differentially Private Subspace Fine-Tuning for Large Language Models", "comment": null, "summary": "Fine-tuning large language models on downstream tasks is crucial for realizing their cross-domain potential but often relies on sensitive data, raising privacy concerns. Differential privacy (DP) offers rigorous privacy guarantees and has been widely adopted in fine-tuning; however, naively injecting noise across the high-dimensional parameter space creates perturbations with large norms, degrading performance and destabilizing training. To address this issue, we propose DP-SFT, a two-stage subspace fine-tuning method that substantially reduces noise magnitude while preserving formal DP guarantees. Our intuition is that, during fine-tuning, significant parameter updates lie within a low-dimensional, task-specific subspace, while other directions change minimally. Hence, we only inject DP noise into this subspace to protect privacy without perturbing irrelevant parameters. In phase one, we identify the subspace by analyzing principal gradient directions to capture task-specific update signals. In phase two, we project full gradients onto this subspace, add DP noise, and map the perturbed gradients back to the original parameter space for model updates, markedly lowering noise impact. Experiments on multiple datasets demonstrate that DP-SFT enhances accuracy and stability under rigorous DP constraints, accelerates convergence, and achieves substantial gains over DP fine-tuning baselines."}
{"id": "2601.11307", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11307", "abs": "https://arxiv.org/abs/2601.11307", "authors": ["Julia Schwarzbeck", "Robin Neuder", "Marc Späth", "Alejandro Jiménez-Sáez"], "title": "Scalable mm-Wave Liquid Crystal Reconfigurable Intelligent Surfaces based on the Delay Line Architecture", "comment": null, "summary": "This paper presents the design, fabrication, and characterization of broadband liquid crystal (LC) reconfigurable intelligent surfaces (RIS) operating around 60 GHz and scaling up to 750 radiating elements. The RISs employ a delay line architecture (DLA) that decouples the phase shifting and radiating layer, enabling wide bandwidth, continuous phase control exceeding 360°, and fast response times with a micrometer-thin LC layer of 4.6 micrometer. Two prototypes with 120 and 750 elements are realized using identical unit cells and column-wise biasing. Measurements demonstrate beam steering over +-60° and -3 dB bandwidths exceeding 9% for both apertures, confirming the scalability of the proposed architecture. On top of a measured nanowatt power consumption per unit cell, aperture efficiencies above 20% are predicted by simulations. While the measured efficiencies are reduced to 9.2% and 2.6%, a detailed analysis verifies that this reduction can be attributed to technological challenges in a laboratory environment. Finally, a comprehensive comparison between the applied DLA-based LC-RIS and a conventional approach highlights the superior potential of applied architecture."}
{"id": "2601.11046", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11046", "abs": "https://arxiv.org/abs/2601.11046", "authors": ["Shahbaz Alvi", "Giusy Fedele", "Gabriele Accarino", "Italo Epicoco", "Ilenia Manco", "Pasquale Schiano"], "title": "OpFML: Pipeline for ML-based Operational Forecasting", "comment": null, "summary": "Machine learning is finding its application in a multitude of areas in science and research, and Climate and Earth Sciences is no exception to this trend. Operational forecasting systems based on data-driven approaches and machine learning methods deploy models for periodic forecasting. Wildfire danger assessment using machine learning has garnered significant interest in the last decade, as conventional methods often overestimate the risk of wildfires. In this work, we present the code OpFML: Operational Forecasting with Machine Learning. OpFML is a configurable and adaptable pipeline that can be utilized to serve a machine learning model for periodic forecasting. We further demonstrate the capabilities of the pipeline through its application to daily Fire Danger Index forecasting and outline its various features."}
{"id": "2601.11351", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11351", "abs": "https://arxiv.org/abs/2601.11351", "authors": ["Ruifeng Zheng", "Pengjie Zhou", "Pit Hofmann", "Martín Schottlender", "Fatima Rani", "Juan A. Cabrera", "Frank H. P. Fitzek"], "title": "Modulation, ISI, and Detection for Langmuir Adsorption-Based Microfluidic Molecular Communication", "comment": "5 pages", "summary": "This paper studies microfluidic molecular communication receivers with finite-capacity Langmuir adsorption driven by an effective surface concentration. In the reaction-limited regime, we derive a closed-form single-pulse response kernel and a symbol-rate recursion for on-off keying that explicitly exposes channel memory and inter-symbol interference. We further develop short-pulse and long-pulse approximations, revealing an interference asymmetry in the long-pulse regime due to saturation. To account for stochasticity, we adopt a finite-receptor binomial counting model, employ pulse-end sampling, and propose a low-complexity midpoint-threshold detector that reduces to a fixed threshold when interference is negligible. Numerical results corroborate the proposed characterization and quantify detection performance versus pulse and symbol durations."}
{"id": "2601.11061", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.11061", "abs": "https://arxiv.org/abs/2601.11061", "authors": ["Lecheng Yan", "Ruizhe Li", "Guanhua Chen", "Qing Li", "Jiahui Geng", "Wenxi Li", "Vincent Wang", "Chris Lee"], "title": "Spurious Rewards Paradox: Mechanistically Understanding How RLVR Activates Memorization Shortcuts in LLMs", "comment": "Work in process", "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) is highly effective for enhancing LLM reasoning, yet recent evidence shows models like Qwen 2.5 achieve significant gains even with spurious or incorrect rewards. We investigate this phenomenon and identify a \"Perplexity Paradox\": spurious RLVR triggers a divergence where answer-token perplexity drops while prompt-side coherence degrades, suggesting the model is bypassing reasoning in favor of memorization. Using Path Patching, Logit Lens, JSD analysis, and Neural Differential Equations, we uncover a hidden Anchor-Adapter circuit that facilitates this shortcut. We localize a Functional Anchor in the middle layers (L18-20) that triggers the retrieval of memorized solutions, followed by Structural Adapters in later layers (L21+) that transform representations to accommodate the shortcut signal. Finally, we demonstrate that scaling specific MLP keys within this circuit allows for bidirectional causal steering-artificially amplifying or suppressing contamination-driven performance. Our results provide a mechanistic roadmap for identifying and mitigating data contamination in RLVR-tuned models. Code is available at https://github.com/idwts/How-RLVR-Activates-Memorization-Shortcuts."}
{"id": "2601.11438", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.11438", "abs": "https://arxiv.org/abs/2601.11438", "authors": ["Qiaosen Zhang", "Matteo Nerini", "Bruno Clerckx"], "title": "Channel Estimation in MIMO Systems Aided by Microwave Linear Analog Computers (MiLACs)", "comment": "Submitted to IEEE for publication", "summary": "Microwave linear analog computers (MiLACs) have recently emerged as a promising solution for future gigantic multiple-input multiple-output (MIMO) systems, enabling beamforming with greatly reduced hardware and computational cost. However, channel estimation for MiLAC-aided systems remains an open problem. Conventional least squares (LS) and minimum mean square error (MMSE) estimation rely on intensive digital computation, which undermines the benefits offered by MiLACs. In this letter, we propose efficient LS and MMSE channel estimation schemes for MiLAC-aided MIMO systems. By designing training precoders and combiners implemented by MiLACs, both LS and MMSE estimation are performed fully in the analog domain, achieving identical performance to their digital counterparts while significantly reducing computational complexity, transmit RF chains, analog-to-digital/digital-to-analog converters (ADCs/DACs) resolution requirements, and peak-to-average power ratio (PAPR). Numerical results verify the effectiveness and advantages of the proposed schemes."}
{"id": "2601.11073", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11073", "abs": "https://arxiv.org/abs/2601.11073", "authors": ["Rongkun Cui", "Nana Zhang", "Kun Zhu", "Qi Zhang"], "title": "Bridging Cognitive Neuroscience and Graph Intelligence: Hippocampus-Inspired Multi-View Hypergraph Learning for Web Finance Fraud", "comment": null, "summary": "Online financial services constitute an essential component of contemporary web ecosystems, yet their openness introduces substantial exposure to fraud that harms vulnerable users and weakens trust in digital finance. Such threats have become a significant web harm that erodes societal fairness and affects the well being of online communities. However, existing detection methods based on graph neural networks (GNNs) struggle with two persistent challenges: (1) fraud camouflage, where malicious transactions mimic benign behaviors to evade detection, and (2) long-tailed data distributions, which obscure rare but critical fraudulent cases. To fill these gaps, we propose HIMVH, a Hippocampus-Inspired Multi-View Hypergraph learning model for web finance fraud detection. Specifically, drawing inspiration from the scene conflict monitoring role of the hippocampus, we design a cross-view inconsistency perception module that captures subtle discrepancies and behavioral heterogeneity across multiple transaction views. This module enables the model to identify subtle cross-view conflicts for detecting online camouflaged fraudulent behaviors. Furthermore, inspired by the match-mismatch novelty detection mechanism of the CA1 region, we introduce a novelty-aware hypergraph learning module that measures feature deviations from neighborhood expectations and adaptively reweights messages, thereby enhancing sensitivity to online rare fraud patterns in the long-tailed settings. Extensive experiments on six web-based financial fraud datasets demonstrate that HIMVH achieves 6.42\\% improvement in AUC, 9.74\\% in F1 and 39.14\\% in AP on average over 15 SOTA models."}
{"id": "2601.11025", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11025", "abs": "https://arxiv.org/abs/2601.11025", "authors": ["Lei Li", "Yanqing Xu", "Ye Xue", "Feng Yin", "Chao Shen", "Rui Zhang", "Tsung-Hui Chang"], "title": "PEMNet: Towards Autonomous and Enhanced Environment-Aware Mobile Networks", "comment": null, "summary": "With 5G deployment and the evolution toward 6G, mobile networks must make decisions in highly dynamic environments under strict latency, energy, and spectrum constraints. Achieving this goal, however, depends on prior knowledge of spatial-temporal variations in wireless channels and traffic demands. This motivates a joint, site-specific representation of radio propagation and user demand that is queryable at low online overhead. In this work, we propose the perception embedding map (PEM), a localized framework that embeds fine-grained channel statistics together with grid-level spatial-temporal traffic patterns over a base station's coverage. PEM is built from standard-compliant measurements -- such as measurement report and scheduling/quality-of-service logs -- so it can be deployed and maintained at scale with low cost. Integrated into PEM, this joint knowledge supports enhanced environment-aware optimization across PHY, MAC, and network layers while substantially reducing training overhead and signaling. Compared with existing site-specific channel maps and digital-twin replicas, PEM distinctively emphasizes (i) joint channel-traffic embedding, which is essential for network optimization, and (ii) practical construction using standard measurements, enabling network autonomy while striking a favorable fidelity-cost balance."}
{"id": "2601.11079", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11079", "abs": "https://arxiv.org/abs/2601.11079", "authors": ["Shota Saito", "Yuta Nakahara", "Toshiyasu Matsushima"], "title": "Soft Bayesian Context Tree Models for Real-Valued Time Series", "comment": null, "summary": "This paper proposes the soft Bayesian context tree model (Soft-BCT), which is a novel BCT model for real-valued time series. The Soft-BCT considers soft (probabilistic) splits of the context space, instead of hard (deterministic) splits of the context space as in the previous BCT for real-valued time series. A learning algorithm of the Soft-BCT is proposed based on the variational inference. For some real-world datasets, the Soft-BCT demonstrates almost the same or superior performance to the previous BCT."}
{"id": "2601.11179", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11179", "abs": "https://arxiv.org/abs/2601.11179", "authors": ["Noor Ul Ain", "Lorenzo Miretti", "Renato L. G. Cavalcante", "Sławomir Stańczak"], "title": "Performance Analysis of Cell-Free Massive MIMO under Imperfect LoS Phase Tracking", "comment": "6 pages, 1 figure and 1 table", "summary": "We study the impact of imperfect line-of-sight (LoS) phase tracking on the performance of cell-free massive MIMO networks. Unlike prior works that assume perfectly known or completely unknown phases, we consider a realistic regime where LoS phases are estimated with residual uncertainty due to hardware impairments, mobility, and synchronization errors. To this end, we propose a Rician fading model where LoS components are rotated by imperfect phase estimates and attenuated by a deterministic phase-error penalty factor. We derive a linear MMSE channel estimator that captures statistical phase errors and unifies prior results, reducing to the Bayesian MMSE estimator with perfect phase knowledge and to a zero-mean model in the absence of phase knowledge. To address the non-Gaussian setting, we introduce a virtual uplink model that preserves second-order statistics of channel estimation, enabling the derivation of tractable centralized and distributed MMSE beamformers. To ensure fair assessment of the network performance, we apply these beamformers to the true uplink model and compute the spectral efficiency bounds available in the literature. Numerical results show that our framework bridges idealized assumptions and practical tracking limitations, providing rigorous performance benchmarks and design insights for 6G cell-free networks."}
{"id": "2601.11113", "categories": ["cs.LG", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.11113", "abs": "https://arxiv.org/abs/2601.11113", "authors": ["Lele Zheng", "Xiang Wang", "Tao Zhang", "Yang Cao", "Ke Cheng", "Yulong Shen"], "title": "Differentially Private Subspace Fine-Tuning for Large Language Models", "comment": null, "summary": "Fine-tuning large language models on downstream tasks is crucial for realizing their cross-domain potential but often relies on sensitive data, raising privacy concerns. Differential privacy (DP) offers rigorous privacy guarantees and has been widely adopted in fine-tuning; however, naively injecting noise across the high-dimensional parameter space creates perturbations with large norms, degrading performance and destabilizing training. To address this issue, we propose DP-SFT, a two-stage subspace fine-tuning method that substantially reduces noise magnitude while preserving formal DP guarantees. Our intuition is that, during fine-tuning, significant parameter updates lie within a low-dimensional, task-specific subspace, while other directions change minimally. Hence, we only inject DP noise into this subspace to protect privacy without perturbing irrelevant parameters. In phase one, we identify the subspace by analyzing principal gradient directions to capture task-specific update signals. In phase two, we project full gradients onto this subspace, add DP noise, and map the perturbed gradients back to the original parameter space for model updates, markedly lowering noise impact. Experiments on multiple datasets demonstrate that DP-SFT enhances accuracy and stability under rigorous DP constraints, accelerates convergence, and achieves substantial gains over DP fine-tuning baselines."}
{"id": "2601.11407", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.11407", "abs": "https://arxiv.org/abs/2601.11407", "authors": ["Cel Thys", "Rodney Martinez Alonso", "Sofie Pollin"], "title": "Efficient Channel Autoencoders for Wideband Communications leveraging Walsh-Hadamard interleaving", "comment": "16 pages, 17 figures", "summary": "This paper investigates how end-to-end (E2E) channel autoencoders (AEs) can achieve energy-efficient wideband communications by leveraging Walsh-Hadamard (WH) interleaved converters. WH interleaving enables high sampling rate analog-digital conversion with reduced power consumption using an analog WH transformation. We demonstrate that E2E-trained neural coded modulation can transparently adapt to the WH-transceiver hardware without requiring algorithmic redesign. Focusing on the short block length regime, we train WH-domain AEs and benchmark them against standard neural and conventional baselines, including 5G Polar codes. We quantify the system-level energy tradeoffs among baseband compute, channel signal-to-noise ratio (SNR), and analog converter power. Our analysis shows that the proposed WH-AE system can approach conventional Polar code SNR performance within 0.14dB while consuming comparable or lower system power. Compared to the best neural baseline, WH-AE achieves, on average, 29% higher energy efficiency (in bit/J) for the same reliability. These findings establish WH-domain learning as a viable path to energy-efficient, high-throughput wideband communications by explicitly balancing compute complexity, SNR, and analog power consumption."}
{"id": "2601.11118", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11118", "abs": "https://arxiv.org/abs/2601.11118", "authors": ["Chaoqi Jia", "Weihong Wu", "Longkun Guo", "Zhigang Lu", "Chao Chen", "Kok-Leong Ong"], "title": "Optimized Algorithms for Text Clustering with LLM-Generated Constraints", "comment": "AAAI-26", "summary": "Clustering is a fundamental tool that has garnered significant interest across a wide range of applications including text analysis. To improve clustering accuracy, many researchers have incorporated background knowledge, typically in the form of must-link and cannot-link constraints, to guide the clustering process. With the recent advent of large language models (LLMs), there is growing interest in improving clustering quality through LLM-based automatic constraint generation. In this paper, we propose a novel constraint-generation approach that reduces resource consumption by generating constraint sets rather than using traditional pairwise constraints. This approach improves both query efficiency and constraint accuracy compared to state-of-the-art methods. We further introduce a constrained clustering algorithm tailored to the characteristics of LLM-generated constraints. Our method incorporates a confidence threshold and a penalty mechanism to address potentially inaccurate constraints. We evaluate our approach on five text datasets, considering both the cost of constraint generation and the overall clustering performance. The results show that our method achieves clustering accuracy comparable to the state-of-the-art algorithms while reducing the number of LLM queries by more than 20 times."}
{"id": "2601.11498", "categories": ["cs.IT", "cs.NI", "eess.SP", "quant-ph"], "pdf": "https://arxiv.org/pdf/2601.11498", "abs": "https://arxiv.org/abs/2601.11498", "authors": ["Alptug Aytekin", "Mohamed Nomeir", "Lei Hu", "Sennur Ulukus"], "title": "Convergence Properties of Good Quantum Codes for Classical Communication", "comment": null, "summary": "An important part of the information theory folklore had been about the output statistics of codes that achieve the capacity and how the empirical distributions compare to the output distributions induced by the optimal input in the channel capacity problem. Results for a variety of such empirical output distributions of good codes have been known in the literature, such as the comparison of the output distribution of the code to the optimal output distribution in vanishing and non-vanishing error probability cases. Motivated by these, we aim to achieve similar results for the quantum codes that are used for classical communication, that is the setting in which the classical messages are communicated through quantum codewords that pass through a noisy quantum channel. We first show the uniqueness of the optimal output distribution, to be able to talk more concretely about the optimal output distribution. Then, we extend the vanishing error probability results to the quantum case, by using techniques that are close in spirit to the classical case. We also extend non-vanishing error probability results to the quantum case on block codes, by using the second-order converses for such codes based on hypercontractivity results for the quantum generalized depolarizing semi-groups."}
{"id": "2601.11126", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11126", "abs": "https://arxiv.org/abs/2601.11126", "authors": ["Lu Chen", "Gengxiang Chen", "Xu Liu", "Jingyan Su", "Xuhao Lyu", "Lihui Wang", "Yingguang Li"], "title": "Shape-morphing programming of soft materials on complex geometries via neural operator", "comment": "20 pages,5 Figures", "summary": "Shape-morphing soft materials can enable diverse target morphologies through voxel-level material distribution design, offering significant potential for various applications. Despite progress in basic shape-morphing design with simple geometries, achieving advanced applications such as conformal implant deployment or aerodynamic morphing requires accurate and diverse morphing designs on complex geometries, which remains challenging. Here, we present a Spectral and Spatial Neural Operator (S2NO), which enables high-fidelity morphing prediction on complex geometries. S2NO effectively captures global and local morphing behaviours on irregular computational domains by integrating Laplacian eigenfunction encoding and spatial convolutions. Combining S2NO with evolutionary algorithms enables voxel-level optimisation of material distributions for shape morphing programming on various complex geometries, including irregular-boundary shapes, porous structures, and thin-walled structures. Furthermore, the neural operator's discretisation-invariant property enables super-resolution material distribution design, further expanding the diversity and complexity of morphing design. These advancements significantly improve the efficiency and capability of programming complex shape morphing."}
{"id": "2601.11134", "categories": ["cs.LG", "q-fin.RM", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.11134", "abs": "https://arxiv.org/abs/2601.11134", "authors": ["Sultan Amed", "Tanmay Sen", "Sayantan Banerjee"], "title": "FSL-BDP: Federated Survival Learning with Bayesian Differential Privacy for Credit Risk Modeling", "comment": null, "summary": "Credit risk models are a critical decision-support tool for financial institutions, yet tightening data-protection rules (e.g., GDPR, CCPA) increasingly prohibit cross-border sharing of borrower data, even as these models benefit from cross-institution learning. Traditional default prediction suffers from two limitations: binary classification ignores default timing, treating early defaulters (high loss) equivalently to late defaulters (low loss), and centralized training violates emerging regulatory constraints. We propose a Federated Survival Learning framework with Bayesian Differential Privacy (FSL-BDP) that models time-to-default trajectories without centralizing sensitive data. The framework provides Bayesian (data-dependent) differential privacy (DP) guarantees while enabling institutions to jointly learn risk dynamics. Experiments on three real-world credit datasets (LendingClub, SBA, Bondora) show that federation fundamentally alters the relative effectiveness of privacy mechanisms. While classical DP performs better than Bayesian DP in centralized settings, the latter benefits substantially more from federation (+7.0\\% vs +1.4\\%), achieving near parity of non-private performance and outperforming classical DP in the majority of participating clients. This ranking reversal yields a key decision-support insight: privacy mechanism selection should be evaluated in the target deployment architecture, rather than centralized benchmarks. These findings provide actionable guidance for practitioners designing privacy-preserving decision support systems in regulated, multi-institutional environments."}
{"id": "2601.11135", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11135", "abs": "https://arxiv.org/abs/2601.11135", "authors": ["Van Thuy Hoang", "O-Joun Lee"], "title": "Context-aware Graph Causality Inference for Few-Shot Molecular Property Prediction", "comment": "15 pages", "summary": "Molecular property prediction is becoming one of the major applications of graph learning in Web-based services, e.g., online protein structure prediction and drug discovery. A key challenge arises in few-shot scenarios, where only a few labeled molecules are available for predicting unseen properties. Recently, several studies have used in-context learning to capture relationships among molecules and properties, but they face two limitations in: (1) exploiting prior knowledge of functional groups that are causally linked to properties and (2) identifying key substructures directly correlated with properties. We propose CaMol, a context-aware graph causality inference framework, to address these challenges by using a causal inference perspective, assuming that each molecule consists of a latent causal structure that determines a specific property. First, we introduce a context graph that encodes chemical knowledge by linking functional groups, molecules, and properties to guide the discovery of causal substructures. Second, we propose a learnable atom masking strategy to disentangle causal substructures from confounding ones. Third, we introduce a distribution intervener that applies backdoor adjustment by combining causal substructures with chemically grounded confounders, disentangling causal effects from real-world chemical variations. Experiments on diverse molecular datasets showed that CaMol achieved superior accuracy and sample efficiency in few-shot tasks, showing its generalizability to unseen properties. Also, the discovered causal substructures were strongly aligned with chemical knowledge about functional groups, supporting the model interpretability."}
{"id": "2601.11154", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11154", "abs": "https://arxiv.org/abs/2601.11154", "authors": ["P. Sánchez", "K. Reyes", "B. Radu", "E. Fernández"], "title": "Assesing the Viability of Unsupervised Learning with Autoencoders for Predictive Maintenance in Helicopter Engines", "comment": null, "summary": "Unplanned engine failures in helicopters can lead to severe operational disruptions, safety hazards, and costly repairs. To mitigate these risks, this study compares two predictive maintenance strategies for helicopter engines: a supervised classification pipeline and an unsupervised anomaly detection approach based on autoencoders (AEs). The supervised method relies on labelled examples of both normal and faulty behaviour, while the unsupervised approach learns a model of normal operation using only healthy engine data, flagging deviations as potential faults. Both methods are evaluated on a real-world dataset comprising labelled snapshots of helicopter engine telemetry. While supervised models demonstrate strong performance when annotated failures are available, the AE achieves effective detection without requiring fault labels, making it particularly well suited for settings where failure data are scarce or incomplete. The comparison highlights the practical trade-offs between accuracy, data availability, and deployment feasibility, and underscores the potential of unsupervised learning as a viable solution for early fault detection in aerospace applications."}
{"id": "2601.11159", "categories": ["cs.LG", "cs.DB"], "pdf": "https://arxiv.org/pdf/2601.11159", "abs": "https://arxiv.org/abs/2601.11159", "authors": ["Yichun Yang", "Longlong Lin", "Rong-Hua Li", "Meihao Liao", "Guoren Wang"], "title": "Theoretically and Practically Efficient Resistance Distance Computation on Large Graphs", "comment": null, "summary": "The computation of resistance distance is pivotal in a wide range of graph analysis applications, including graph clustering, link prediction, and graph neural networks. Despite its foundational importance, efficient algorithms for computing resistance distances on large graphs are still lacking. Existing state-of-the-art (SOTA) methods, including power iteration-based algorithms and random walk-based local approaches, often struggle with slow convergence rates, particularly when the condition number of the graph Laplacian matrix, denoted by $κ$, is large. To tackle this challenge, we propose two novel and efficient algorithms inspired by the classic Lanczos method: Lanczos Iteration and Lanczos Push, both designed to reduce dependence on $κ$. Among them, Lanczos Iteration is a near-linear time global algorithm, whereas Lanczos Push is a local algorithm with a time complexity independent of the size of the graph. More specifically, we prove that the time complexity of Lanczos Iteration is $\\tilde{O}(\\sqrtκ m)$ ($m$ is the number of edges of the graph and $\\tilde{O}$ means the complexity omitting the $\\log$ terms) which achieves a speedup of $\\sqrtκ$ compared to previous power iteration-based global methods. For Lanczos Push, we demonstrate that its time complexity is $\\tilde{O}(κ^{2.75})$ under certain mild and frequently established assumptions, which represents a significant improvement of $κ^{0.25}$ over the SOTA random walk-based local algorithms. We validate our algorithms through extensive experiments on eight real-world datasets of varying sizes and statistical properties, demonstrating that Lanczos Iteration and Lanczos Push significantly outperform SOTA methods in terms of both efficiency and accuracy."}
{"id": "2601.11160", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11160", "abs": "https://arxiv.org/abs/2601.11160", "authors": ["Claudia Plant", "Lena G. M. Bauer", "Christian Böhm"], "title": "Clustering High-dimensional Data: Balancing Abstraction and Representation Tutorial at AAAI 2026", "comment": null, "summary": "How to find a natural grouping of a large real data set? Clustering requires a balance between abstraction and representation. To identify clusters, we need to abstract from superfluous details of individual objects. But we also need a rich representation that emphasizes the key features shared by groups of objects that distinguish them from other groups of objects.\n  Each clustering algorithm implements a different trade-off between abstraction and representation. Classical K-means implements a high level of abstraction - details are simply averaged out - combined with a very simple representation - all clusters are Gaussians in the original data space. We will see how approaches to subspace and deep clustering support high-dimensional and complex data by allowing richer representations. However, with increasing representational expressiveness comes the need to explicitly enforce abstraction in the objective function to ensure that the resulting method performs clustering and not just representation learning. We will see how current deep clustering methods define and enforce abstraction through centroid-based and density-based clustering losses. Balancing the conflicting goals of abstraction and representation is challenging. Ideas from subspace clustering help by learning one latent space for the information that is relevant to clustering and another latent space to capture all other information in the data.\n  The tutorial ends with an outlook on future research in clustering. Future methods will more adaptively balance abstraction and representation to improve performance, energy efficiency and interpretability. By automatically finding the sweet spot between abstraction and representation, the human brain is very good at clustering and other related tasks such as single-shot learning. So, there is still much room for improvement."}
{"id": "2601.11161", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.11161", "abs": "https://arxiv.org/abs/2601.11161", "authors": ["Pascal Schlachter", "Bin Yang"], "title": "GMM-COMET: Continual Source-Free Universal Domain Adaptation via a Mean Teacher and Gaussian Mixture Model-Based Pseudo-Labeling", "comment": null, "summary": "Unsupervised domain adaptation tackles the problem that domain shifts between training and test data impair the performance of neural networks in many real-world applications. Thereby, in realistic scenarios, the source data may no longer be available during adaptation, and the label space of the target domain may differ from the source label space. This setting, known as source-free universal domain adaptation (SF-UniDA), has recently gained attention, but all existing approaches only assume a single domain shift from source to target. In this work, we present the first study on continual SF-UniDA, where the model must adapt sequentially to a stream of multiple different unlabeled target domains. Building upon our previous methods for online SF-UniDA, we combine their key ideas by integrating Gaussian mixture model-based pseudo-labeling within a mean teacher framework for improved stability over long adaptation sequences. Additionally, we introduce consistency losses for further robustness. The resulting method GMM-COMET provides a strong first baseline for continual SF-UniDA and is the only approach in our experiments to consistently improve upon the source-only model across all evaluated scenarios. Our code is available at https://github.com/pascalschlachter/GMM-COMET."}
{"id": "2601.11163", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11163", "abs": "https://arxiv.org/abs/2601.11163", "authors": ["P. Sánchez", "K. Reyes", "B. Radu", "E. Fernández"], "title": "LSTM VS. Feed-Forward Autoencoders for Unsupervised Fault Detection in Hydraulic Pumps", "comment": null, "summary": "Unplanned failures in industrial hydraulic pumps can halt production and incur substantial costs. We explore two unsupervised autoencoder (AE) schemes for early fault detection: a feed-forward model that analyses individual sensor snapshots and a Long Short-Term Memory (LSTM) model that captures short temporal windows. Both networks are trained only on healthy data drawn from a minute-level log of 52 sensor channels; evaluation uses a separate set that contains seven annotated fault intervals. Despite the absence of fault samples during training, the models achieve high reliability."}
{"id": "2601.11184", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11184", "abs": "https://arxiv.org/abs/2601.11184", "authors": ["Xiangyu Xu", "Qingsong Zhong", "Jilin Hu"], "title": "TimeMar: Multi-Scale Autoregressive Modeling for Unconditional Time Series Generation", "comment": null, "summary": "Generative modeling offers a promising solution to data scarcity and privacy challenges in time series analysis. However, the structural complexity of time series, characterized by multi-scale temporal patterns and heterogeneous components, remains insufficiently addressed. In this work, we propose a structure-disentangled multiscale generation framework for time series. Our approach encodes sequences into discrete tokens at multiple temporal resolutions and performs autoregressive generation in a coarse-to-fine manner, thereby preserving hierarchical dependencies. To tackle structural heterogeneity, we introduce a dual-path VQ-VAE that disentangles trend and seasonal components, enabling the learning of semantically consistent latent representations. Additionally, we present a guidance-based reconstruction strategy, where coarse seasonal signals are utilized as priors to guide the reconstruction of fine-grained seasonal patterns. Experiments on six datasets show that our approach produces higher-quality time series than existing methods. Notably, our model achieves strong performance with a significantly reduced parameter count and exhibits superior capability in generating high-quality long-term sequences. Our implementation is available at https://anonymous.4open.science/r/TimeMAR-BC5B."}
{"id": "2601.11200", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11200", "abs": "https://arxiv.org/abs/2601.11200", "authors": ["Haiyang Xiao", "Weiqing Li", "Jinyue Guo", "Guochao Jiang", "Guohua Liu", "Yuewei Zhang"], "title": "FAQ: Mitigating Quantization Error via Regenerating Calibration Data with Family-Aware Quantization", "comment": null, "summary": "Although post-training quantization (PTQ) provides an efficient numerical compression scheme for deploying large language models (LLMs) on resource-constrained devices, the representativeness and universality of calibration data remain a core bottleneck in determining the accuracy of quantization parameters. Traditional PTQ methods typically rely on limited samples, making it difficult to capture the activation distribution during the inference phase, leading to biases in quantization parameters. To address this, we propose \\textbf{FAQ} (Family-Aware Quantization), a calibration data regeneration framework that leverages prior knowledge from LLMs of the same family to generate high-fidelity calibration samples. Specifically, FAQ first inputs the original calibration samples into a larger LLM from the same family as the target model, regenerating a series of high-fidelity calibration data using a highly consistent knowledge system. Subsequently, this data, carrying Chain-of-Thought reasoning and conforming to the expected activation distribution, undergoes group competition under expert guidance to select the best samples, which are then re-normalized to enhance the effectiveness of standard PTQ. Experiments on multiple model series, including Qwen3-8B, show that FAQ reduces accuracy loss by up to 28.5\\% compared to the baseline with original calibration data, demonstrating its powerful potential and contribution."}
{"id": "2601.11219", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11219", "abs": "https://arxiv.org/abs/2601.11219", "authors": ["Zhikang Shen", "Jianrong Lu", "Haiyuan Wan", "Jianhai Chen"], "title": "SDFLoRA: Selective Dual-Module LoRA for Federated Fine-tuning with Heterogeneous Clients", "comment": null, "summary": "Federated learning (FL) for large language models (LLMs) has attracted increasing attention as a way to enable privacy-preserving adaptation over distributed data. Parameter-efficient methods such as LoRA are widely adopted to reduce communication and memory costs. Despite these advances, practical FL deployments often exhibit rank heterogeneity, since different clients may use different low-rank configurations. This makes direct aggregation of LoRA updates biased and unstable. Existing solutions typically enforce unified ranks or align heterogeneous updates into a shared subspace, which over-constrains client-specific semantics, limits personalization, and provides weak protection of local client information under differential privacy noise. To address this issue, we propose Selective Dual-module Federated LoRA (SDFLoRA), which decomposes each client adapter into a global module that captures transferable knowledge and a local module that preserves client-specific adaptations. The global module is selectively aligned and aggregated across clients, while local modules remain private. This design enables robust learning under rank heterogeneity and supports privacy-aware optimization by injecting differential privacy noise exclusively into the global module. Experiments on GLUE benchmarks demonstrate that SDFLoRA outperforms representative federated LoRA baselines and achieves a better utility-privacy trade-off."}
{"id": "2601.11222", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11222", "abs": "https://arxiv.org/abs/2601.11222", "authors": ["Haochen Wu", "Heng Wu", "Benzhuo Lu"], "title": "Operator learning on domain boundary through combining fundamental solution-based artificial data and boundary integral techniques", "comment": "31 pages", "summary": "For linear partial differential equations with known fundamental solutions, this work introduces a novel operator learning framework that relies exclusively on domain boundary data, including solution values and normal derivatives, rather than full-domain sampling. By integrating the previously developed Mathematical Artificial Data (MAD) method, which enforces physical consistency, all training data are synthesized directly from the fundamental solutions of the target problems, resulting in a fully data-driven pipeline without the need for external measurements or numerical simulations. We refer to this approach as the Mathematical Artificial Data Boundary Neural Operator (MAD-BNO), which learns boundary-to-boundary mappings using MAD-generated Dirichlet-Neumann data pairs. Once trained, the interior solution at arbitrary locations can be efficiently recovered through boundary integral formulations, supporting Dirichlet, Neumann, and mixed boundary conditions as well as general source terms. The proposed method is validated on benchmark operator learning tasks for two-dimensional Laplace, Poisson, and Helmholtz equations, where it achieves accuracy comparable to or better than existing neural operator approaches while significantly reducing training time. The framework is naturally extensible to three-dimensional problems and complex geometries."}
{"id": "2601.11258", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.11258", "abs": "https://arxiv.org/abs/2601.11258", "authors": ["Pingzhi Tang", "Yiding Wang", "Muhan Zhang"], "title": "Knowledge is Not Enough: Injecting RL Skills for Continual Adaptation", "comment": null, "summary": "Large Language Models (LLMs) face the \"knowledge cutoff\" challenge, where their frozen parametric memory prevents direct internalization of new information. While Supervised Fine-Tuning (SFT) is commonly used to update model knowledge, it often updates factual content without reliably improving the model's ability to use the newly incorporated information for question answering or decision-making. Reinforcement Learning (RL) is essential for acquiring reasoning skills; however, its high computational cost makes it impractical for efficient online adaptation. We empirically observe that the parameter updates induced by SFT and RL are nearly orthogonal. Based on this observation, we propose Parametric Skill Transfer (PaST), a framework that supports modular skill transfer for efficient and effective knowledge adaptation. By extracting a domain-agnostic Skill Vector from a source domain, we can linearly inject knowledge manipulation skills into a target model after it has undergone lightweight SFT on new data. Experiments on knowledge-incorporation QA (SQuAD, LooGLE) and agentic tool-use benchmarks (ToolBench) demonstrate the effectiveness of our method. On SQuAD, PaST outperforms the state-of-the-art self-editing SFT baseline by up to 9.9 points. PaST further scales to long-context QA on LooGLE with an 8.0-point absolute accuracy gain, and improves zero-shot ToolBench success rates by +10.3 points on average with consistent gains across tool categories, indicating strong scalability and cross-domain transferability of the Skill Vector."}
{"id": "2601.11259", "categories": ["cs.LG", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.11259", "abs": "https://arxiv.org/abs/2601.11259", "authors": ["Lorenzo Tomada", "Federico Pichi", "Gianluigi Rozza"], "title": "Latent Dynamics Graph Convolutional Networks for model order reduction of parameterized time-dependent PDEs", "comment": null, "summary": "Graph Neural Networks (GNNs) are emerging as powerful tools for nonlinear Model Order Reduction (MOR) of time-dependent parameterized Partial Differential Equations (PDEs). However, existing methodologies struggle to combine geometric inductive biases with interpretable latent behavior, overlooking dynamics-driven features or disregarding spatial information. In this work, we address this gap by introducing Latent Dynamics Graph Convolutional Network (LD-GCN), a purely data-driven, encoder-free architecture that learns a global, low-dimensional representation of dynamical systems conditioned on external inputs and parameters. The temporal evolution is modeled in the latent space and advanced through time-stepping, allowing for time-extrapolation, and the trajectories are consistently decoded onto geometrically parameterized domains using a GNN. Our framework enhances interpretability by enabling the analysis of the reduced dynamics and supporting zero-shot prediction through latent interpolation. The methodology is mathematically validated via a universal approximation theorem for encoder-free architectures, and numerically tested on complex computational mechanics problems involving physical and geometric parameters, including the detection of bifurcating phenomena for Navier-Stokes equations. Code availability: https://github.com/lorenzotomada/ld-gcn-rom"}
{"id": "2601.11265", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11265", "abs": "https://arxiv.org/abs/2601.11265", "authors": ["Arthur da Cunha", "Miakel Møller Høgsgaard", "Andrea Paudice"], "title": "Sample-Near-Optimal Agnostic Boosting with Improved Running Time", "comment": "28 pages, 0 figures. Accepted at the 37th International Conference on Algorithmic Learning Theory (ALT 2026)", "summary": "Boosting is a powerful method that turns weak learners, which perform only slightly better than random guessing, into strong learners with high accuracy. While boosting is well understood in the classic setting, it is less so in the agnostic case, where no assumptions are made about the data. Indeed, only recently was the sample complexity of agnostic boosting nearly settled arXiv:2503.09384, but the known algorithm achieving this bound has exponential running time. In this work, we propose the first agnostic boosting algorithm with near-optimal sample complexity, running in time polynomial in the sample size when considering the other parameters of the problem fixed."}
{"id": "2601.11283", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11283", "abs": "https://arxiv.org/abs/2601.11283", "authors": ["Nabil Belacel", "Mohamed Rachid Boulassel"], "title": "Metabolomic Biomarker Discovery for ADHD Diagnosis Using Interpretable Machine Learning", "comment": "24 pages, 4 figures, 2 tables, submitted to AI in Medicine", "summary": "Attention Deficit Hyperactivity Disorder (ADHD) is a prevalent neurodevelopmental disorder with limited objective diagnostic tools, highlighting the urgent need for objective, biology-based diagnostic frameworks in precision psychiatry. We integrate urinary metabolomics with an interpretable machine learning framework to identify biochemical signatures associated with ADHD. Targeted metabolomic profiles from 52 ADHD and 46 control participants were analyzed using a Closest Resemblance (CR) classifier with embedded feature selection. The CR model outperformed Random Forest and K-Nearest Neighbor classifiers, achieving an AUC > 0.97 based on a reduced panel of 14 metabolites. These metabolites including dopamine 4-sulfate, N-acetylaspartylglutamic acid, and citrulline map to dopaminergic neurotransmission and amino acid metabolism pathways, offering mechanistic insight into ADHD pathophysiology. The CR classifier's transparent decision boundaries and low computational cost support integration into targeted metabolomic assays and future point of care diagnostic platforms. Overall, this work demonstrates a translational framework combining metabolomics and interpretable machine learning to advance objective, biologically informed diagnostic strategies for ADHD."}
{"id": "2601.11311", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11311", "abs": "https://arxiv.org/abs/2601.11311", "authors": ["Zhihan Yang", "Jiaqi Wei", "Xiang Zhang", "Haoyu Dong", "Yiwen Wang", "Xiaoke Guo", "Pengkun Zhang", "Yiwei Xu", "Chenyu You"], "title": "FORESTLLM: Large Language Models Make Random Forest Great on Few-shot Tabular Learning", "comment": "23 pages", "summary": "Tabular data high-stakes critical decision-making in domains such as finance, healthcare, and scientific discovery. Yet, learning effectively from tabular data in few-shot settings, where labeled examples are scarce, remains a fundamental challenge. Traditional tree-based methods often falter in these regimes due to their reliance on statistical purity metrics, which become unstable and prone to overfitting with limited supervision. At the same time, direct applications of large language models (LLMs) often overlook its inherent structure, leading to suboptimal performance. To overcome these limitations, we propose FORESTLLM, a novel framework that unifies the structural inductive biases of decision forests with the semantic reasoning capabilities of LLMs. Crucially, FORESTLLM leverages the LLM only during training, treating it as an offline model designer that encodes rich, contextual knowledge into a lightweight, interpretable forest model, eliminating the need for LLM inference at test time. Our method is two-fold. First, we introduce a semantic splitting criterion in which the LLM evaluates candidate partitions based on their coherence over both labeled and unlabeled data, enabling the induction of more robust and generalizable tree structures under few-shot supervision. Second, we propose a one-time in-context inference mechanism for leaf node stabilization, where the LLM distills the decision path and its supporting examples into a concise, deterministic prediction, replacing noisy empirical estimates with semantically informed outputs. Across a diverse suite of few-shot classification and regression benchmarks, FORESTLLM achieves state-of-the-art performance."}
{"id": "2601.11342", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.11342", "abs": "https://arxiv.org/abs/2601.11342", "authors": ["Chuanyue Yu", "Jiahui Wang", "Yuhan Li", "Heng Chang", "Ge Lan", "Qingyun Sun", "Jia Li", "Jianxin Li", "Ziwei Zhang"], "title": "Unlocking the Potentials of Retrieval-Augmented Generation for Diffusion Language Models", "comment": "Preprints", "summary": "Diffusion Language Models (DLMs) have recently demonstrated remarkable capabilities in natural language processing tasks. However, the potential of Retrieval-Augmented Generation (RAG), which shows great successes for enhancing large language models (LLMs), has not been well explored, due to the fundamental difference between LLM and DLM decoding. To fill this critical gap, we systematically test the performance of DLMs within the RAG framework. Our findings reveal that DLMs coupled with RAG show promising potentials with stronger dependency on contextual information, but suffer from limited generation precision. We identify a key underlying issue: Response Semantic Drift (RSD), where the generated answer progressively deviates from the query's original semantics, leading to low precision content. We trace this problem to the denoising strategies in DLMs, which fail to maintain semantic alignment with the query throughout the iterative denoising process. To address this, we propose Semantic-Preserving REtrieval-Augmented Diffusion (SPREAD), a novel framework that introduces a query-relevance-guided denoising strategy. By actively guiding the denoising trajectory, SPREAD ensures the generation remains anchored to the query's semantics and effectively suppresses drift. Experimental results demonstrate that SPREAD significantly enhances the precision and effectively mitigates RSD of generated answers within the RAG framework."}
{"id": "2601.11350", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.11350", "abs": "https://arxiv.org/abs/2601.11350", "authors": ["Jaehoon Lee", "Seungwoo Lee", "Younghwi Kim", "Dohee Kim", "Sunghyun Sim"], "title": "FEATHer: Fourier-Efficient Adaptive Temporal Hierarchy Forecaster for Time-Series Forecasting", "comment": "Submitted to IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)", "summary": "Time-series forecasting is fundamental in industrial domains like manufacturing and smart factories. As systems evolve toward automation, models must operate on edge devices (e.g., PLCs, microcontrollers) with strict constraints on latency and memory, limiting parameters to a few thousand. Conventional deep architectures are often impractical here. We propose the Fourier-Efficient Adaptive Temporal Hierarchy Forecaster (FEATHer) for accurate long-term forecasting under severe limits. FEATHer introduces: (i) ultra-lightweight multiscale decomposition into frequency pathways; (ii) a shared Dense Temporal Kernel using projection-depthwise convolution-projection without recurrence or attention; (iii) frequency-aware branch gating that adaptively fuses representations based on spectral characteristics; and (iv) a Sparse Period Kernel reconstructing outputs via period-wise downsampling to capture seasonality. FEATHer maintains a compact architecture (as few as 400 parameters) while outperforming baselines. Across eight benchmarks, it achieves the best ranking, recording 60 first-place results with an average rank of 2.05. These results demonstrate that reliable long-range forecasting is achievable on constrained edge hardware, offering a practical direction for industrial real-time inference."}
{"id": "2601.11352", "categories": ["cs.LG", "cs.PF", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.11352", "abs": "https://arxiv.org/abs/2601.11352", "authors": ["Akhilesh Raj", "Swann Perarnau", "Aniruddha Gokhale", "Solomon Bekele Abera"], "title": "Offline Reinforcement-Learning-Based Power Control for Application-Agnostic Energy Efficiency", "comment": "11 pages, 5 figures, 3 tables and unpublished", "summary": "Energy efficiency has become an integral aspect of modern computing infrastructure design, impacting the performance, cost, scalability, and durability of production systems. The incorporation of power actuation and sensing capabilities in CPU designs is indicative of this, enabling the deployment of system software that can actively monitor and adjust energy consumption and performance at runtime. While reinforcement learning (RL) would seem ideal for the design of such energy efficiency control systems, online training presents challenges ranging from the lack of proper models for setting up an adequate simulated environment, to perturbation (noise) and reliability issues, if training is deployed on a live system.\n  In this paper we discuss the use of offline reinforcement learning as an alternative approach for the design of an autonomous CPU power controller, with the goal of improving the energy efficiency of parallel applications at runtime without unduly impacting their performance. Offline RL sidesteps the issues incurred by online RL training by leveraging a dataset of state transitions collected from arbitrary policies prior to training.\n  Our methodology applies offline RL to a gray-box approach to energy efficiency, combining online application-agnostic performance data (e.g., heartbeats) and hardware performance counters to ensure that the scientific objectives are met with limited performance degradation. Evaluating our method on a variety of compute-bound and memory-bound benchmarks and controlling power on a live system through Intel's Running Average Power Limit, we demonstrate that such an offline-trained agent can substantially reduce energy consumption at a tolerable performance degradation cost."}
{"id": "2601.11397", "categories": ["cs.LG", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.11397", "abs": "https://arxiv.org/abs/2601.11397", "authors": ["Emma Hart", "Bas Peters", "Julianne Chung", "Matthias Chung"], "title": "Latent Space Inference via Paired Autoencoders", "comment": "21 pages, 7 figures", "summary": "This work describes a novel data-driven latent space inference framework built on paired autoencoders to handle observational inconsistencies when solving inverse problems. Our approach uses two autoencoders, one for the parameter space and one for the observation space, connected by learned mappings between the autoencoders' latent spaces. These mappings enable a surrogate for regularized inversion and optimization in low-dimensional, informative latent spaces. Our flexible framework can work with partial, noisy, or out-of-distribution data, all while maintaining consistency with the underlying physical models. The paired autoencoders enable reconstruction of corrupted data, and then use the reconstructed data for parameter estimation, which produces more accurate reconstructions compared to paired autoencoders alone and end-to-end encoder-decoders of the same architecture, especially in scenarios with data inconsistencies. We demonstrate our approaches on two imaging examples in medical tomography and geophysical seismic-waveform inversion, but the described approaches are broadly applicable to a variety of inverse problems in scientific and engineering applications."}
{"id": "2601.11401", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11401", "abs": "https://arxiv.org/abs/2601.11401", "authors": ["Ahmed Rashwan", "Keith Briggs", "Chris Budd", "Lisa Kreusser"], "title": "Factored Value Functions for Graph-Based Multi-Agent Reinforcement Learning", "comment": null, "summary": "Credit assignment is a core challenge in multi-agent reinforcement learning (MARL), especially in large-scale systems with structured, local interactions. Graph-based Markov decision processes (GMDPs) capture such settings via an influence graph, but standard critics are poorly aligned with this structure: global value functions provide weak per-agent learning signals, while existing local constructions can be difficult to estimate and ill-behaved in infinite-horizon settings. We introduce the Diffusion Value Function (DVF), a factored value function for GMDPs that assigns to each agent a value component by diffusing rewards over the influence graph with temporal discounting and spatial attenuation. We show that DVF is well-defined, admits a Bellman fixed point, and decomposes the global discounted value via an averaging property. DVF can be used as a drop-in critic in standard RL algorithms and estimated scalably with graph neural networks. Building on DVF, we propose Diffusion A2C (DA2C) and a sparse message-passing actor, Learned DropEdge GNN (LD-GNN), for learning decentralised algorithms under communication costs. Across the firefighting benchmark and three distributed computation tasks (vector graph colouring and two transmit power optimisation problems), DA2C consistently outperforms local and global critic baselines, improving average reward by up to 11%."}
{"id": "2601.11428", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11428", "abs": "https://arxiv.org/abs/2601.11428", "authors": ["Lennon Shikhman"], "title": "Forcing and Diagnosing Failure Modes of Fourier Neural Operators Across Diverse PDE Families", "comment": "17 pages, 8 figures", "summary": "Fourier Neural Operators (FNOs) have shown strong performance in learning solution maps of partial differential equations (PDEs), but their robustness under distribution shifts, long-horizon rollouts, and structural perturbations remains poorly understood. We present a systematic stress-testing framework that probes failure modes of FNOs across five qualitatively different PDE families: dispersive, elliptic, multi-scale fluid, financial, and chaotic systems. Rather than optimizing in-distribution accuracy, we design controlled stress tests--including parameter shifts, boundary or terminal condition changes, resolution extrapolation with spectral analysis, and iterative rollouts--to expose vulnerabilities such as spectral bias, compounding integration errors, and overfitting to restricted boundary regimes. Our large-scale evaluation (1{,}000 trained models) reveals that distribution shifts in parameters or boundary conditions can inflate errors by more than an order of magnitude, while resolution changes primarily concentrate error in high-frequency modes. Input perturbations generally do not amplify error, though worst-case scenarios (e.g., localized Poisson perturbations) remain challenging. These findings provide a comparative failure-mode atlas and actionable insights for improving robustness in operator learning."}
{"id": "2601.11433", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11433", "abs": "https://arxiv.org/abs/2601.11433", "authors": ["Wout Mommen", "Lars Keuninckx", "Paul Detterer", "Achiel Colpaert", "Piet Wambacq"], "title": "Inter-patient ECG Arrhythmia Classification with LGNs and LUTNs", "comment": null, "summary": "Deep Differentiable Logic Gate Networks (LGNs) and Lookup Table Networks (LUTNs) are demonstrated to be suitable for the automatic classification of electrocardiograms (ECGs) using the inter-patient paradigm. The methods are benchmarked using the MIT-BIH arrhythmia data set, achieving up to 94.28% accuracy and a $jκ$ index of 0.683 on a four-class classification problem. Our models use between 2.89k and 6.17k FLOPs, including preprocessing and readout, which is three to six orders of magnitude less compared to SOTA methods. A novel preprocessing method is utilized that attains superior performance compared to existing methods for both the mixed-patient and inter-patient paradigms. In addition, a novel method for training the Lookup Tables (LUTs) in LUTNs is devised that uses the Boolean equation of a multiplexer (MUX). Additionally, rate coding was utilized for the first time in these LGNs and LUTNs, enhancing the performance of LGNs. Furthermore, it is the first time that LGNs and LUTNs have been benchmarked on the MIT-BIH arrhythmia dataset using the inter-patient paradigm. Using an Artix 7 FPGA, between 2000 and 2990 LUTs were needed, and between 5 to 7 mW (i.e. 50 pJ to 70 pJ per inference) was estimated for running these models. The performance in terms of both accuracy and $jκ$-index is significantly higher compared to previous LGN results. These positive results suggest that one can utilize LGNs and LUTNs for the detection of arrhythmias at extremely low power and high speeds in heart implants or wearable devices, even for patients not included in the training set."}
{"id": "2601.11440", "categories": ["cs.LG", "cs.AI", "cs.CE"], "pdf": "https://arxiv.org/pdf/2601.11440", "abs": "https://arxiv.org/abs/2601.11440", "authors": ["Francisco Giral", "Álvaro Manzano", "Ignacio Gómez", "Ricardo Vinuesa", "Soledad Le Clainche"], "title": "GenDA: Generative Data Assimilation on Complex Urban Areas via Classifier-Free Diffusion Guidance", "comment": null, "summary": "Urban wind flow reconstruction is essential for assessing air quality, heat dispersion, and pedestrian comfort, yet remains challenging when only sparse sensor data are available. We propose GenDA, a generative data assimilation framework that reconstructs high-resolution wind fields on unstructured meshes from limited observations. The model employs a multiscale graph-based diffusion architecture trained on computational fluid dynamics (CFD) simulations and interprets classifier-free guidance as a learned posterior reconstruction mechanism: the unconditional branch learns a geometry-aware flow prior, while the sensor-conditioned branch injects observational constraints during sampling. This formulation enables obstacle-aware reconstruction and generalization across unseen geometries, wind directions, and mesh resolutions without retraining. We consider both sparse fixed sensors and trajectory-based observations using the same reconstruction procedure. When evaluated against supervised graph neural network (GNN) baselines and classical reduced-order data assimilation methods, GenDA reduces the relative root-mean-square error (RRMSE) by 25-57% and increases the structural similarity index (SSIM) by 23-33% across the tested meshes. Experiments are conducted on Reynolds-averaged Navier-Stokes (RANS) simulations of a real urban neighbourhood in Bristol, United Kingdom, at a characteristic Reynolds number of $\\mathrm{Re}\\approx2\\times10^{7}$, featuring complex building geometry and irregular terrain. The proposed framework provides a scalable path toward generative, geometry-aware data assimilation for environmental monitoring in complex domains."}
{"id": "2601.11444", "categories": ["cs.LG", "cs.CV", "math.ST", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.11444", "abs": "https://arxiv.org/abs/2601.11444", "authors": ["Raphaël Razafindralambo", "Rémy Sun", "Frédéric Precioso", "Damien Garreau", "Pierre-Alexandre Mattei"], "title": "When Are Two Scores Better Than One? Investigating Ensembles of Diffusion Models", "comment": "Accepted at TMLR. Code: https://github.com/rarazafin/score_diffusion_ensemble", "summary": "Diffusion models now generate high-quality, diverse samples, with an increasing focus on more powerful models. Although ensembling is a well-known way to improve supervised models, its application to unconditional score-based diffusion models remains largely unexplored. In this work we investigate whether it provides tangible benefits for generative modelling. We find that while ensembling the scores generally improves the score-matching loss and model likelihood, it fails to consistently enhance perceptual quality metrics such as FID on image datasets. We confirm this observation across a breadth of aggregation rules using Deep Ensembles, Monte Carlo Dropout, on CIFAR-10 and FFHQ. We attempt to explain this discrepancy by investigating possible explanations, such as the link between score estimation and image quality. We also look into tabular data through random forests, and find that one aggregation strategy outperforms the others. Finally, we provide theoretical insights into the summing of score models, which shed light not only on ensembling but also on several model composition techniques (e.g. guidance)."}
{"id": "2601.11471", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11471", "abs": "https://arxiv.org/abs/2601.11471", "authors": ["James O'Neill", "Robert Clancy", "Mariia Matskevichus", "Fergal Reid"], "title": "Low-Rank Key Value Attention", "comment": null, "summary": "Transformer pretraining is increasingly constrained by memory and compute requirements, with the key-value (KV) cache emerging as a dominant bottleneck during training and autoregressive decoding. We propose \\textit{low-rank KV adaptation} (LRKV), a simple modification of multi-head attention that reduces KV cache memory by exploiting redundancy across attention heads while preserving full token-level resolution. Each layer uses a shared full-rank KV projection augmented with low-rank, head-specific residuals, yielding a continuous trade-off between complete sharing and fully independent attention.\n  LRKV is a drop-in replacement for standard multi-head attention and directly subsumes query-sharing approaches such as multi-query and grouped-query attention, while remaining distinct from latent-compression methods such as multi-latent attention (MLA). Across large-scale pretraining experiments, LRKV consistently achieves faster loss reduction, lower validation perplexity, and stronger downstream task performance than standard attention, MQA/GQA, and MLA. At the 2.5B scale, LRKV outperforms standard attention while using roughly half the KV cache, and reaches equivalent model quality with up to \\textbf{20-25\\% less training compute} when measured in cumulative FLOPs. To explain these gains, we analyze attention head structure in operator space and show that LRKV preserves nearly all functional head diversity relative to standard attention, whereas more aggressive KV-sharing mechanisms rely on compensatory query specialization. Together, these results establish LRKV as a practical and effective attention mechanism for scaling Transformer pretraining under memory- and compute-constrained regimes."}
{"id": "2601.11491", "categories": ["cs.LG", "cs.ET"], "pdf": "https://arxiv.org/pdf/2601.11491", "abs": "https://arxiv.org/abs/2601.11491", "authors": ["Ziqing Zeng", "Abhimanyu Kumar", "Chris H. Kim", "Ulya R. Karpuzcu", "Sachin S. Sapatnekar"], "title": "Extractive summarization on a CMOS Ising machine", "comment": null, "summary": "Extractive summarization (ES) aims to generate a concise summary by selecting a subset of sentences from a document while maximizing relevance and minimizing redundancy. Although modern ES systems achieve high accuracy using powerful neural models, their deployment typically relies on CPU or GPU infrastructures that are energy-intensive and poorly suited for real-time inference in resource-constrained environments. In this work, we explore the feasibility of implementing McDonald-style extractive summarization on a low-power CMOS coupled oscillator-based Ising machine (COBI) that supports integer-valued, all-to-all spin couplings. We first propose a hardware-aware Ising formulation that reduces the scale imbalance between local fields and coupling terms, thereby improving robustness to coefficient quantization: this method can be applied to any problem formulation that requires k of n variables to be chosen. We then develop a complete ES pipeline including (i) stochastic rounding and iterative refinement to compensate for precision loss, and (ii) a decomposition strategy that partitions a large ES problem into smaller Ising subproblems that can be efficiently solved on COBI and later combined. Experimental results on the CNN/DailyMail dataset show that our pipeline can produce high-quality summaries using only integer-coupled Ising hardware with limited precision. COBI achieves 3-4.5x runtime speedups compared to a brute-force method, which is comparable to software Tabu search, and two to three orders of magnitude reductions in energy, while maintaining competitive summary quality. These results highlight the potential of deploying CMOS Ising solvers for real-time, low-energy text summarization on edge devices."}
{"id": "2601.11500", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11500", "abs": "https://arxiv.org/abs/2601.11500", "authors": ["Hoang M. Ngo", "Tre' R. Jeter", "Jung Taek Seo", "My T. Thai"], "title": "QUPID: A Partitioned Quantum Neural Network for Anomaly Detection in Smart Grid", "comment": null, "summary": "Smart grid infrastructures have revolutionized energy distribution, but their day-to-day operations require robust anomaly detection methods to counter risks associated with cyber-physical threats and system faults potentially caused by natural disasters, equipment malfunctions, and cyber attacks. Conventional machine learning (ML) models are effective in several domains, yet they struggle to represent the complexities observed in smart grid systems. Furthermore, traditional ML models are highly susceptible to adversarial manipulations, making them increasingly unreliable for real-world deployment. Quantum ML (QML) provides a unique advantage, utilizing quantum-enhanced feature representations to model the intricacies of the high-dimensional nature of smart grid systems while demonstrating greater resilience to adversarial manipulation. In this work, we propose QUPID, a partitioned quantum neural network (PQNN) that outperforms traditional state-of-the-art ML models in anomaly detection. We extend our model to R-QUPID that even maintains its performance when including differential privacy (DP) for enhanced robustness. Moreover, our partitioning framework addresses a significant scalability problem in QML by efficiently distributing computational workloads, making quantum-enhanced anomaly detection practical in large-scale smart grid environments. Our experimental results across various scenarios exemplifies the efficacy of QUPID and R-QUPID to significantly improve anomaly detection capabilities and robustness compared to traditional ML approaches."}
{"id": "2601.11505", "categories": ["cs.LG", "cs.AI", "eess.SY", "q-bio.QM"], "pdf": "https://arxiv.org/pdf/2601.11505", "abs": "https://arxiv.org/abs/2601.11505", "authors": ["Miriam K. Wolff", "Peter Calhoun", "Eleonora Maria Aiello", "Yao Qin", "Sam F. Royston"], "title": "MetaboNet: The Largest Publicly Available Consolidated Dataset for Type 1 Diabetes Management", "comment": "22 pages, 5 figures, 7 supplementary figures, submitted to JDST", "summary": "Progress in Type 1 Diabetes (T1D) algorithm development is limited by the fragmentation and lack of standardization across existing T1D management datasets. Current datasets differ substantially in structure and are time-consuming to access and process, which impedes data integration and reduces the comparability and generalizability of algorithmic developments. This work aims to establish a unified and accessible data resource for T1D algorithm development. Multiple publicly available T1D datasets were consolidated into a unified resource, termed the MetaboNet dataset. Inclusion required the availability of both continuous glucose monitoring (CGM) data and corresponding insulin pump dosing records. Additionally, auxiliary information such as reported carbohydrate intake and physical activity was retained when present. The MetaboNet dataset comprises 3135 subjects and 1228 patient-years of overlapping CGM and insulin data, making it substantially larger than existing standalone benchmark datasets. The resource is distributed as a fully public subset available for immediate download at https://metabo-net.org/ , and with a Data Use Agreement (DUA)-restricted subset accessible through their respective application processes. For the datasets in the latter subset, processing pipelines are provided to automatically convert the data into the standardized MetaboNet format. A consolidated public dataset for T1D research is presented, and the access pathways for both its unrestricted and DUA-governed components are described. The resulting dataset covers a broad range of glycemic profiles and demographics and thus can yield more generalizable algorithmic performance than individual datasets."}
{"id": "2601.11516", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.11516", "abs": "https://arxiv.org/abs/2601.11516", "authors": ["János Kramár", "Joshua Engels", "Zheng Wang", "Bilal Chughtai", "Rohin Shah", "Neel Nanda", "Arthur Conmy"], "title": "Building Production-Ready Probes For Gemini", "comment": null, "summary": "Frontier language model capabilities are improving rapidly. We thus need stronger mitigations against bad actors misusing increasingly powerful systems. Prior work has shown that activation probes may be a promising misuse mitigation technique, but we identify a key remaining challenge: probes fail to generalize under important production distribution shifts. In particular, we find that the shift from short-context to long-context inputs is difficult for existing probe architectures. We propose several new probe architecture that handle this long-context distribution shift.\n  We evaluate these probes in the cyber-offensive domain, testing their robustness against various production-relevant shifts, including multi-turn conversations, static jailbreaks, and adaptive red teaming. Our results demonstrate that while multimax addresses context length, a combination of architecture choice and training on diverse distributions is required for broad generalization. Additionally, we show that pairing probes with prompted classifiers achieves optimal accuracy at a low cost due to the computational efficiency of probes.\n  These findings have informed the successful deployment of misuse mitigation probes in user-facing instances of Gemini, Google's frontier language model. Finally, we find early positive results using AlphaEvolve to automate improvements in both probe architecture search and adaptive red teaming, showing that automating some AI safety research is already possible."}
{"id": "2601.10735", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10735", "abs": "https://arxiv.org/abs/2601.10735", "authors": ["Lizy Abraham", "Siobhan Coughlan", "Kritika Rajain", "Changhong Li", "Saji Philip", "Adam James"], "title": "SSC-UNet: UNet with Self-Supervised Contrastive Learning for Phonocardiography Noise Reduction", "comment": "Accepted by IEEE Healthcom 2025", "summary": "Congenital Heart Disease (CHD) remains a significant global health concern affecting approximately 1\\% of births worldwide. Phonocardiography has emerged as a supplementary tool to diagnose CHD cost-effectively. However, the performance of these diagnostic models highly depends on the quality of the phonocardiography, thus, noise reduction is particularly critical. Supervised UNet effectively improves noise reduction capabilities, but limited clean data hinders its application. The complex time-frequency characteristics of phonocardiography further complicate finding the balance between effectively removing noise and preserving pathological features. In this study, we proposed a self-supervised phonocardiography noise reduction model based on Noise2Noise to enable training without clean data. Augmentation and contrastive learning are applied to enhance its performance. We obtained an average SNR of 12.98 dB after filtering under 10~dB of hospital noise. Classification sensitivity after filtering was improved from 27\\% to 88\\%, indicating its promising pathological feature retention capabilities in practical noisy environments."}
{"id": "2601.10743", "categories": ["eess.SP", "cs.LG", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.10743", "abs": "https://arxiv.org/abs/2601.10743", "authors": ["Ayesh Abu Lehyeh", "Anastassia Gharib", "Tian Xia", "Dryver Huston", "Safwan Wshah"], "title": "UBiGTLoc: A Unified BiLSTM-Graph Transformer Localization Framework for IoT Sensor Networks", "comment": "Accepted and published in IEEE Internet of Things Journal", "summary": "Sensor nodes localization in wireless Internet of Things (IoT) sensor networks is crucial for the effective operation of diverse applications, such as smart cities and smart agriculture. Existing sensor nodes localization approaches heavily rely on anchor nodes within wireless sensor networks (WSNs). Anchor nodes are sensor nodes equipped with global positioning system (GPS) receivers and thus, have known locations. These anchor nodes operate as references to localize other sensor nodes. However, the presence of anchor nodes may not always be feasible in real-world IoT scenarios. Additionally, localization accuracy can be compromised by fluctuations in Received Signal Strength Indicator (RSSI), particularly under non-line-of-sight (NLOS) conditions. To address these challenges, we propose UBiGTLoc, a Unified Bidirectional Long Short-Term Memory (BiLSTM)-Graph Transformer Localization framework. The proposed UBiGTLoc framework effectively localizes sensor nodes in both anchor-free and anchor-presence WSNs. The framework leverages BiLSTM networks to capture temporal variations in RSSI data and employs Graph Transformer layers to model spatial relationships between sensor nodes. Extensive simulations demonstrate that UBiGTLoc consistently outperforms existing methods and provides robust localization across both dense and sparse WSNs while relying solely on cost-effective RSSI data."}
{"id": "2601.10747", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10747", "abs": "https://arxiv.org/abs/2601.10747", "authors": ["Silke K. Kaiser"], "title": "Sensor Placement for Urban Traffic Interpolation: A Data-Driven Evaluation to Inform Policy", "comment": null, "summary": "Data on citywide street-segment traffic volumes are essential for urban planning and sustainable mobility management. Yet such data are available only for a limited subset of streets due to the high costs of sensor deployment and maintenance. Traffic volumes on the remaining network are therefore interpolated based on existing sensor measurements. However, current sensor locations are often determined by administrative priorities rather than by data-driven optimization, leading to biased coverage and reduced estimation performance. This study provides a large-scale, real-world benchmarking of easily implementable, data-driven strategies for optimizing the placement of permanent and temporary traffic sensors, using segment-level data from Berlin (Strava bicycle counts) and Manhattan (taxi counts). It compares spatial placement strategies based on network centrality, spatial coverage, feature coverage, and active learning. In addition, the study examines temporal deployment schemes for temporary sensors. The findings highlight that spatial placement strategies that emphasize even spatial coverage and employ active learning achieve the lowest prediction errors. With only 10 sensors, they reduce the mean absolute error by over 60% in Berlin and 70% in Manhattan compared to alternatives. Temporal deployment choices further improve performance: distributing measurements evenly across weekdays reduces error by an additional 7% in Berlin and 21% in Manhattan. Together, these spatial and temporal principles allow temporary deployments to closely approximate the performance of optimally placed permanent deployments. From a policy perspective, the results indicate that cities can substantially improve data usefulness by adopting data-driven sensor placement strategies, while retaining flexibility in choosing between temporary and permanent deployments."}
{"id": "2601.10748", "categories": ["eess.SP", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10748", "abs": "https://arxiv.org/abs/2601.10748", "authors": ["Jun Li", "Hongling Zhu", "Yujie Xiao", "Qinghao Zhao", "Yalei Ke", "Gongzheng Tang", "Guangkun Nie", "Deyun Zhang", "Jin Li", "Canqing Yu", "Shenda Hong"], "title": "AnyECG: Evolved ECG Foundation Model for Holistic Health Profiling", "comment": "in progress", "summary": "Background: Artificial intelligence enabled electrocardiography (AI-ECG) has demonstrated the ability to detect diverse pathologies, but most existing models focus on single disease identification, neglecting comorbidities and future risk prediction. Although ECGFounder expanded cardiac disease coverage, a holistic health profiling model remains needed.\n  Methods: We constructed a large multicenter dataset comprising 13.3 million ECGs from 2.98 million patients. Using transfer learning, ECGFounder was fine-tuned to develop AnyECG, a foundation model for holistic health profiling. Performance was evaluated using external validation cohorts and a 10-year longitudinal cohort for current diagnosis, future risk prediction, and comorbidity identification.\n  Results: AnyECG demonstrated systemic predictive capability across 1172 conditions, achieving an AUROC greater than 0.7 for 306 diseases. The model revealed novel disease associations, robust comorbidity patterns, and future disease risks. Representative examples included high diagnostic performance for hyperparathyroidism (AUROC 0.941), type 2 diabetes (0.803), Crohn disease (0.817), lymphoid leukemia (0.856), and chronic obstructive pulmonary disease (0.773).\n  Conclusion: The AnyECG foundation model provides substantial evidence that AI-ECG can serve as a systemic tool for concurrent disease detection and long-term risk prediction."}
{"id": "2601.10771", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10771", "abs": "https://arxiv.org/abs/2601.10771", "authors": ["Nay Klaimi", "Clément Elvira", "Philippe Mary", "Luc Le Magoarou"], "title": "Physically constrained unfolded multi-dimensional OMP for large MIMO systems", "comment": null, "summary": "Sparse recovery methods are essential for channel estimation and localization in modern communication systems, but their reliability relies on accurate physical models, which are rarely perfectly known. Their computational complexity also grows rapidly with the dictionary dimensions in large MIMO systems. In this paper, we propose MOMPnet, a novel unfolded sparse recovery framework that addresses both the reliability and complexity challenges of traditional methods. By integrating deep unfolding with data-driven dictionary learning, MOMPnet mitigates hardware impairments while preserving interpretability. Instead of a single large dictionary, multiple smaller, independent dictionaries are employed, enabling a low-complexity multidimensional Orthogonal Matching Pursuit algorithm. The proposed unfolded network is evaluated on realistic channel data against multiple baselines, demonstrating its strong performance and potential."}
{"id": "2601.10915", "categories": ["cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10915", "abs": "https://arxiv.org/abs/2601.10915", "authors": ["Yangshuo He", "Guanding Yu", "Jingge Zhu"], "title": "A PAC-Bayesian Analysis of Channel-Induced Degradation in Edge Inference", "comment": null, "summary": "In the emerging paradigm of edge inference, neural networks (NNs) are partitioned across distributed edge devices that collaboratively perform inference via wireless transmission. However, standard NNs are generally trained in a noiseless environment, creating a mismatch with the noisy channels during edge deployment. In this paper, we address this issue by characterizing the channel-induced performance deterioration as a generalization error against unseen channels. We introduce an augmented NN model that incorporates channel statistics directly into the weight space, allowing us to derive PAC-Bayesian generalization bounds that explicitly quantifies the impact of wireless distortion. We further provide closed-form expressions for practical channels to demonstrate the tractability of these bounds. Inspired by the theoretical results, we propose a channel-aware training algorithm that minimizes a surrogate objective based on the derived bound. Simulations show that the proposed algorithm can effectively improve inference accuracy by leveraging channel statistics, without end-to-end re-training."}
{"id": "2601.11116", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11116", "abs": "https://arxiv.org/abs/2601.11116", "authors": ["Yuki Nakamura", "Shingo Takemoto", "Shunsuke Ono"], "title": "Comprehensive Robust Dynamic Mode Decomposition from Mode Extraction to Dimensional Reduction", "comment": "Submitted to IEEE Transactions on Signal Processing. The source code is available at https://github.com/MDI-TokyoTech/Comprehensive-Robust-Dynamic-Mode-Decomposition. The project page is https://www.mdi.c.titech.ac.jp/publications/cr-dmd", "summary": "We propose Comprehensive Robust Dynamic Mode Decomposition (CR-DMD), a novel framework that robustifies the entire DMD process - from mode extraction to dimensional reduction - against mixed noise. Although standard DMD widely used for uncovering spatio-temporal patterns and constructing low-dimensional models of dynamical systems, it suffers from significant performance degradation under noise due to its reliance on least-squares estimation for computing the linear time evolution operator. Existing robust variants typically modify the least-squares formulation, but they remain unstable and fail to ensure faithful low-dimensional representations. First, we introduce a convex optimization-based preprocessing method designed to effectively remove mixed noise, achieving accurate and stable mode extraction. Second, we propose a new convex formulation for dimensional reduction that explicitly links the robustly extracted modes to the original noisy observations, constructing a faithful representation of the original data via a sparse weighted sum of the modes. Both stages are efficiently solved by a preconditioned primal-dual splitting method. Experiments on fluid dynamics datasets demonstrate that CR-DMD consistently outperforms state-of-the-art robust DMD methods in terms of mode accuracy and fidelity of low-dimensional representations under noisy conditions."}
{"id": "2601.11334", "categories": ["cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11334", "abs": "https://arxiv.org/abs/2601.11334", "authors": ["Deborah Pereg"], "title": "Information Theoretic Perspective on Representation Learning", "comment": null, "summary": "An information-theoretic framework is introduced to analyze last-layer embedding, focusing on learned representations for regression tasks. We define representation-rate and derive limits on the reliability with which input-output information can be represented as is inherently determined by the input-source entropy. We further define representation capacity in a perturbed setting, and representation rate-distortion for a compressed output. We derive the achievable capacity, the achievable representation-rate, and their converse. Finally, we combine the results in a unified setting."}
{"id": "2601.11447", "categories": ["cs.CR", "cs.AR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.11447", "abs": "https://arxiv.org/abs/2601.11447", "authors": ["Wadid Foudhaili", "Aykut Rencber", "Anouar Nechi", "Rainer Buchty", "Mladen Berekovic", "Andres Gomez", "Saleh Mulhem"], "title": "IMS: Intelligent Hardware Monitoring System for Secure SoCs", "comment": "The final version is accepted for publication at the Design, Automation & Test in Europe Conference (DATE) 2026", "summary": "In the modern Systems-on-Chip (SoC), the Advanced eXtensible Interface (AXI) protocol exhibits security vulnerabilities, enabling partial or complete denial-of-service (DoS) through protocol-violation attacks. The recent countermeasures lack a dedicated real-time protocol semantic analysis and evade protocol compliance checks. This paper tackles this AXI vulnerability issue and presents an intelligent hardware monitoring system (IMS) for real-time detection of AXI protocol violations. IMS is a hardware module leveraging neural networks to achieve high detection accuracy. For model training, we perform DoS attacks through header-field manipulation and systematic malicious operations, while recording AXI transactions to build a training dataset. We then deploy a quantization-optimized neural network, achieving 98.7% detection accuracy with <=3% latency overhead, and throughput of >2.5 million inferences/s. We subsequently integrate this IMS into a RISC-V SoC as a memory-mapped IP core to monitor its AXI bus. For demonstration and initial assessment for later ASIC integration, we implemented this IMS on an AMD Zynq UltraScale+ MPSoC ZCU104 board, showing an overall small hardware footprint (9.04% look-up-tables (LUTs), 0.23% DSP slices, and 0.70% flip-flops) and negligible impact on the overall design's achievable frequency. This demonstrates the feasibility of lightweight, security monitoring for resource-constrained edge environments."}
