{"id": "2601.14648", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14648", "abs": "https://arxiv.org/abs/2601.14648", "authors": ["Qingji Jiang", "Jing jin", "Qixing Wang", "Yuanyuan Tang", "Yang Cao", "Bin Kuang", "Jing Dong", "Siying Lv", "Dongming Wang", "Yongming Huang", "Jiangzhou Wang", "Xiaohu You"], "title": "Experimental Performance of Bidirectional Phase Coherent Transmission and Sensing for mmWave Cell-free Massive MIMO Systems with Reciprocity Calibration", "comment": null, "summary": "Phase synchronization among distributed transmission reception points (TRPs) is a prerequisite for enabling coherent joint transmission and high-precision sensing in millimeter wave (mmWave) cell-free massive multiple-input and multiple-output (MIMO) systems. This paper proposes a bidirectional calibration scheme and a calibration coefficient estimation method for phase synchronization, and presents a calibration coefficient phase tracking method using unilateral uplink/downlink channel state information (CSI). Furthermore, this paper introduces the use of reciprocity calibration to eliminate non-ideal factors in sensing and leverages sensing results to achieve calibration coefficient phase tracking in dynamic scenarios, thus enabling bidirectional empowerment of both communication and sensing. Simulation results demonstrate that the proposed method can effectively implement reciprocal calibration with lower overhead, enabling coherent collaborative transmission, and resolving non-ideal factors to acquire lower sensing error in sensing applications. Experimental results show that, in the mmWave band, over-the-air (OTA) bidirectional calibration enables coherent collaborative transmission for both collaborative TRPs and collaborative user equipments (UEs), achieving beamforming gain and long-time coherent sensing capabilities."}
{"id": "2601.14759", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14759", "abs": "https://arxiv.org/abs/2601.14759", "authors": ["Syed Luqman Shah", "Nurul Huda Mahmood", "Italo Atzeni"], "title": "Improved GPR-Based CSI Acquisition via Spatial-Correlation Kernel", "comment": "Submiited for possible publication in IEEE", "summary": "Accurate channel estimation with low pilot overhead and computational complexity is key to efficiently utilizing multi-antenna wireless systems. Motivated by the evolution from purely statistical descriptions toward physics- and geometry-aware propagation models, this work focuses on incorporating channel information into a Gaussian process regression (GPR) framework for improving the channel estimation accuracy. In this work, we propose a GPR-based channel estimation framework along with a novel Spatial-correlation (SC) kernel that explicitly captures the channel's second-order statistics. We derive a closed-form expression of the proposed SC-based GPR estimator and prove that its posterior mean is optimal in terms of minimum mean-square error (MMSE) under the same second-order statistics, without requiring the underlying channel distribution to be Gaussian. Our analysis reveals that, with up to 50% pilot overhead reduction, the proposed method achieves the lowest normalized mean-square error, the highest empirical 95% credible-interval coverage, and superior preservation of spectral efficiency compared to benchmark estimators, while maintaining lower computational complexity than the conventional MMSE estimator."}
{"id": "2601.14783", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14783", "abs": "https://arxiv.org/abs/2601.14783", "authors": ["Zhiqing Wei", "Yucong Du", "Zhiyong Feng", "Haotian Liu", "Yanpeng Cui", "Tao Zhang", "Ying Zhou", "Huici Wu"], "title": "Integrated Sensing, Communication and Control enabled Agile UAV Swarm", "comment": null, "summary": "Uncrewed aerial vehicle (UAV) swarms are pivotal in the applications such as disaster relief, aerial base station (BS) and logistics transportation. These scenarios require the capabilities in accurate sensing, efficient communication and flexible control for real-time and reliable task execution. However, sensing, communication and control are studied independently in traditional research, which limits the overall performance of UAV swarms. To overcome this disadvantage, we propose a deeply coupled scheme of integrated sensing, communication and control (ISCC) for UAV swarms, which is a systemic paradigm that transcends traditional isolated designs of sensing, communication and control by establishing a tightly-coupled closed-loop through the co-optimization of sensing, communication and control. In this article, we firstly analyze the requirements of scenarios and key performance metrics. Subsequently, the enabling technologies are proposed, including communication-and-control-enhanced sensing, sensing-and-control-enhanced communication, and sensing-and-communication-enhanced control. Simulation results validate the performance of the proposed ISCC framework, demonstrating its application potential in the future."}
{"id": "2601.14820", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14820", "abs": "https://arxiv.org/abs/2601.14820", "authors": ["Maria A van Agthoven", "Marek Polák", "Jan Fiala", "Claude Nelcy Ounounou", "Petr Halada", "Michael Palasser", "Anne Briot-Dietsch", "Alan Kádek", "Kathrin Breuker", "Petr Novák", "Carlos Afonso", "Marc-André Delsuc"], "title": "Absorption mode broadband 2D MS for proteomics and metabolomics", "comment": null, "summary": "Two-dimensional mass spectrometry (2D MS) is a method for tandem mass spectrometry that enables the correlation between precursor and fragment ions without the need for ion isolation. On a Fourier transform ion cyclotron resonance mass spectrometer, the phase correction functions for absorption mode data processing were found to be linear in the precursor ion dimension and quadratic in the fragment ion dimension. Absorption mode data processing on limited data sets has previously shown improvements in signal-to-noise ratio and resolving power by a factor of 2. Here, we have expanded absorption mode data processing to 2D mass spectra regardless of size and frequency range. We have applied absorption mode 2D MS to top-down analysis of variously oxidized ubiquitin proteoforms generated by fast photochemical oxidation of proteins (FPOP) and to an extract of ergot alkaloids. We show that absorption mode data processing significantly improves both the signal-to-noise ratio and the resolving power of the 2D mass spectrum compared to standard magnitude mode in terms of sequence coverage in top-down proteomics, as well as the accuracy of precursor-fragment correlation in metabolomics."}
{"id": "2601.14480", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2601.14480", "abs": "https://arxiv.org/abs/2601.14480", "authors": ["Egemen Erbayat", "Gustavo B. Figueiredo", "Shih-Chun Lin", "Motoharu Matsuura", "Hiroshi Hasegawa", "Suresh Subramaniam"], "title": "A benchmarking framework for PON-based fronthaul network design", "comment": null, "summary": "As mobile networks transition toward 5G and 6G RAN architectures, Passive Optical Networks (PONs) offer a critical solution for cost-effective fronthaul transport. However, the lack of standardized evaluation models in current literature makes an objective comparison of diverse optimization strategies difficult. This paper addresses this gap by proposing a unified benchmarking framework that standardizes cost catalogs and deployment scenarios. We formulate the network design problem using Integer Linear Programming (ILP) to establish optimality bounds and evaluate three scalable heuristic strategies: a Genetic Algorithm, K-Means Clustering (KMC+), and a graph-based Randomized Successive Splitter Assignment (RSSA+) algorithm. Simulation results show that a time-limited ILP remains a strong reference point, even when optimality is not reached. Despite being rarely used in prior fronthaul planning studies, it consistently yields solutions superior to those produced by standard heuristic methods. Among scalable approaches, RSSA+ reliably attains near-ILP performance while ensuring feasibility across all evaluated scenarios, which underscores the importance of advanced, constraint-aware algorithmic designs over simpler heuristics. The complete benchmarking framework and datasets are publicly shared in [1]."}
{"id": "2601.14597", "categories": ["cs.IT", "cs.AI", "cs.CR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.14597", "abs": "https://arxiv.org/abs/2601.14597", "authors": ["James Melbourne", "Mario Diaz", "Shahab Asoodeh"], "title": "Optimality of Staircase Mechanisms for Vector Queries under Differential Privacy", "comment": "Submitted for possible publication", "summary": "We study the optimal design of additive mechanisms for vector-valued queries under $ε$-differential privacy (DP). Given only the sensitivity of a query and a norm-monotone cost function measuring utility loss, we ask which noise distribution minimizes expected cost among all additive $ε$-DP mechanisms. Using convex rearrangement theory, we show that this infinite-dimensional optimization problem admits a reduction to a one-dimensional compact and convex family of radially symmetric distributions whose extreme points are the staircase distributions. As a consequence, we prove that for any dimension, any norm, and any norm-monotone cost function, there exists an $ε$-DP staircase mechanism that is optimal among all additive mechanisms. This result resolves a conjecture of Geng, Kairouz, Oh, and Viswanath, and provides a geometric explanation for the emergence of staircase mechanisms as extremal solutions in differential privacy."}
{"id": "2601.14263", "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.HC", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2601.14263", "abs": "https://arxiv.org/abs/2601.14263", "authors": ["Alex Echeverria", "Sávio Salvarino Teles de Oliveira", "Fernando Marques Federson"], "title": "Call2Instruct: Automated Pipeline for Generating Q&A Datasets from Call Center Recordings for LLM Fine-Tuning", "comment": "15 pages, 1 figures, conference", "summary": "The adaptation of Large-Scale Language Models (LLMs) to specific domains depends on high-quality fine-tuning datasets, particularly in instructional format (e.g., Question-Answer - Q&A). However, generating these datasets, particularly from unstructured sources such as call center audio recordings, poses a significant challenge due to the noisy and disorganized nature of the data. This paper presents a solution to this challenge by offering an end-to-end automated pipeline for generating Q&A instructional datasets from such recordings. The methodology developed comprises sequential steps of audio processing (including diarization, noise removal and automatic transcription), textual processing (cleaning, normalization, and anonymization), semantic extraction of customer demands and attendant responses using vector embeddings, and matching via semantic search to form the final Q&A pairs. As a result, the complete pipeline was successfully implemented, generating a dataset specifically formatted for Instruct Fine Tuning. The practical value and feasibility of the generated dataset were substantiated and functionally demonstrated through the successful fine-tuning of an LLM model (based on Llama 2 7B). The conclusion of the paper states that the proposed approach is viable for converting unstructured conversational data from call centers into valuable resources for training LLMs. This development has the potential to open up avenues for creating more effective AI systems for Q&A tasks in the customer service domain. The developed codes have been made publicly available to promote reproducibility and future research."}
{"id": "2601.14468", "categories": ["eess.SY", "math.NA", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.14468", "abs": "https://arxiv.org/abs/2601.14468", "authors": ["Milad Hasanzadeh", "Amin Kargarian", "Javad Lavaei"], "title": "All-Pass Fractional OPF: A Solver-Friendly, Physics-Preserving Approximation of AC OPF", "comment": null, "summary": "This paper presents a fractional approximation of the AC optimal power flow (AC OPF) problem based on an all-pass approximation of the exponential power flow kernel. The classical AC OPF relies on trigonometric coupling between bus voltage phasors, which yields a nonconvex program with oscillatory derivatives that can slow, or in some cases destabilize, interior-point methods. We replace the trigonometric terms with an all-pass fractional (APF) approximation whose real and imaginary components act as smooth surrogates for the cosine and sine functions, and we introduce a pre-rotation to shift the argument of the approximation toward its most accurate region, ensuring that the reformulated power flow model preserves physical loss behavior, maintains the symmetry of the classical kernels, and improves the conditioning of the Jacobian and Hessian matrices. The proposed APF OPF formulation remains nonconvex, as in the classical model, but it eliminates trigonometric evaluations and empirically produces larger and more stable Newton steps under standard interior-point solvers. Numerical results on more than 25 IEEE and PGLib test systems ranging from 9 to 10{,}000 buses demonstrate that the APF OPF model achieves solutions with accuracy comparable to that of the classical formulation while reducing solver times, indicating a more solver-friendly nonconvex representation of AC OPF. All code, functions, verification scripts, and generated results are publicly available on \\href{https://github.com/LSU-RAISE-LAB/APF-OPF}{GitHub}, along with a README describing how to run and reproduce the experiments."}
{"id": "2601.14298", "categories": ["cs.CR", "cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2601.14298", "abs": "https://arxiv.org/abs/2601.14298", "authors": ["Anjanava Biswas", "Wrick Talukdar"], "title": "Guardrails for trust, safety, and ethical development and deployment of Large Language Models (LLM)", "comment": null, "summary": "The AI era has ushered in Large Language Models (LLM) to the technological forefront, which has been much of the talk in 2023, and is likely to remain as such for many years to come. LLMs are the AI models that are the power house behind generative AI applications such as ChatGPT. These AI models, fueled by vast amounts of data and computational prowess, have unlocked remarkable capabilities, from human-like text generation to assisting with natural language understanding (NLU) tasks. They have quickly become the foundation upon which countless applications and software services are being built, or at least being augmented with. However, as with any groundbreaking innovations, the rise of LLMs brings forth critical safety, privacy, and ethical concerns. These models are found to have a propensity to leak private information, produce false information, and can be coerced into generating content that can be used for nefarious purposes by bad actors, or even by regular users unknowingly. Implementing safeguards and guardrailing techniques is imperative for applications to ensure that the content generated by LLMs are safe, secure, and ethical. Thus, frameworks to deploy mechanisms that prevent misuse of these models via application implementations is imperative. In this study, wepropose a Flexible Adaptive Sequencing mechanism with trust and safety modules, that can be used to implement safety guardrails for the development and deployment of LLMs."}
{"id": "2601.14868", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14868", "abs": "https://arxiv.org/abs/2601.14868", "authors": ["Ran Yang", "Ning Wei", "Zheng Dong", "Lin Zhang", "Wanting Lyu", "Yue Xiu", "Ahmad Bazzi", "Chadi Assi"], "title": "Movable Antenna Empowered Covert Dual-Functional Radar-Communication", "comment": null, "summary": "Movable antenna (MA) has emerged as a promising technology to flexibly reconfigure wireless channels by adjusting antenna placement. In this paper, we study a secured dual-functional radar-communication (DFRC) system aided by movable antennas. To enhance the communication security, we aim to maximize the achievable sum rate by jointly optimizing the transmitter beamforming vectors, receiving filter, and antenna placement, subject to radar signal-to-noise ratio (SINR) and transmission covertness constraints. We consider multiple Willies operating in both non-colluding and colluding modes. For noncolluding Willies, we first employ a Lagrangian dual transformation procedure to reformulate the challenging optimization problem into a more tractable form. Subsequently, we develop an efficient block coordinate descent (BCD) algorithm that integrates semidefinite relaxation (SDR), projected gradient descent (PGD), Dinkelbach transformation, and successive convex approximation (SCA) techniques to tackle the resulting problem. For colluding Willies, we first derive the minimum detection error probability (DEP) by characterizing the optimal detection statistic, which is proven to follow the generalized Erlang distribution. Then, we develop a minimum mean square error (MMSE)-based algorithm to address the colluding detection problem. We further provide a comprehensive complexity analysis on the unified design framework. Simulation results demonstrate that the proposed method can significantly improve the covert sum rate, and achieve a superior balance between communication and radar performance compared with existing benchmark schemes."}
{"id": "2601.14883", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2601.14883", "abs": "https://arxiv.org/abs/2601.14883", "authors": ["Francesco Rossato", "Mattia Figaro", "Alessandro Traspadini", "Takayuki Shimizu", "Chinmay Mahabal", "Sanjeewa Herath", "Chunghan Lee", "Dogan Kutay Pekcan", "Michele Zorzi", "Marco Giordani"], "title": "5G NR Non-Terrestrial Networks: Open Challenges for Full-Stack Protocol Design", "comment": "8 pages, 4 figures, 1 table, This article has been submitted to IEEE for publication. Copyright may change without notice", "summary": "As 5th generation (5G) networks continue to evolve, there is a growing interest toward the integration of Terrestrial Networks (TNs) and Non-Terrestrial Networks (NTNs). Specifically, NTNs leverage space/air base stations such as satellites, High Altitude Platforms (HAPs), and Unmanned Aerial Vehicles (UAVs) for expanding wireless coverage to underserved rural/remote areas, supporting emergency communications, and offloading traffic in highly congested urban environments. In this paper we focus on the 3GPP 5G NR-NTN standard in the context of satellite communication networks, and highlight critical challenges that must be addressed for proper full-stack protocol design, with considerations related to the PHY, MAC, and higher layers. We also present simulation results in ns-3 to demonstrate the impact of some of these challenges on the network, as an initial step toward more advanced standardization activities on 3GPP 5G NR-NTN."}
{"id": "2601.14621", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.14621", "abs": "https://arxiv.org/abs/2601.14621", "authors": ["Keigo Takeuchi"], "title": "Direct and Converse Theorems in Estimating Signals with Sublinear Sparsity", "comment": "submitted to IEEE Trans. Inf. Theory", "summary": "This paper addresses the estimation of signals with sublinear sparsity sent over the additive white Gaussian noise channel. This fundamental problem arises in designing denoisers used in message-passing algorithms for sublinear sparsity. The main results are direct and converse theorems in the sublinear sparsity limit, where the signal sparsity grows sublinearly in the signal dimension as the signal dimension tends to infinity. As a direct theorem, the maximum likelihood estimator is proved to achieve vanishing square error in the sublinear sparsity limit if the noise variance is smaller than a threshold. As a converse theorem, all estimators cannot achieve square errors smaller than the signal power under a mild condition if the noise variance is larger than another threshold. In particular, the two thresholds coincide with each other when non-zero signals have constant amplitude. These results imply the asymptotic optimality of an existing separable Bayesian estimator used in approximate message-passing for sublinear sparsity."}
{"id": "2601.14266", "categories": ["cs.LG", "cs.CL", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14266", "abs": "https://arxiv.org/abs/2601.14266", "authors": ["Ruben Neyroud", "Sam Corley"], "title": "GCG Attack On A Diffusion LLM", "comment": null, "summary": "While most LLMs are autoregressive, diffusion-based LLMs have recently emerged as an alternative method for generation. Greedy Coordinate Gradient (GCG) attacks have proven effective against autoregressive models, but their applicability to diffusion language models remains largely unexplored. In this work, we present an exploratory study of GCG-style adversarial prompt attacks on LLaDA (Large Language Diffusion with mAsking), an open-source diffusion LLM. We evaluate multiple attack variants, including prefix perturbations and suffix-based adversarial generation, on harmful prompts drawn from the AdvBench dataset. Our study provides initial insights into the robustness and attack surface of diffusion language models and motivates the development of alternative optimization and evaluation strategies for adversarial analysis in this setting."}
{"id": "2601.14613", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14613", "abs": "https://arxiv.org/abs/2601.14613", "authors": ["Tingwei Zhang", "Jiahui Liu", "David Allstot", "Huaping Liu"], "title": "An Ion-Intercalation Memristor for Enabling Full Parallel Writing in Crossbar Networks", "comment": null, "summary": "Crossbar architectures have long been seen as a promising foundation for in-memory computing, using memristor arrays for high-density, energy-efficient analog computation. However, this conventional architecture suffers from a fundamental limitation: the inability to perform parallel write operations due to the sneak path problem. This arises from the structural overlap of read and write paths, forcing sequential or semi-parallel updates and severely limiting scalability. To address this, we introduce a new memristor design that decouples read and write operations at the device level. This design enables orthogonal conductive paths, and employs a reversible ion doping mechanism, inspired by lithium-ion battery principles, to modulate resistance states independently of computation. Fabricated devices exhibit near-ideal memristive characteristics and stable performance under isolated read/write conditions."}
{"id": "2601.14299", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14299", "abs": "https://arxiv.org/abs/2601.14299", "authors": ["Ambarish Gurjar", "L Jean Camp"], "title": "Predicting Tail-Risk Escalation in IDS Alert Time Series", "comment": "20 pages. Under review", "summary": "Network defenders face a steady stream of attacks, observed as raw Intrusion Detection System (IDS) alerts. The sheer volume of alerts demands prioritization, typically based on high-level risk classifications. This work expands the scope of risk measurement by examining alerts not only through their technical characteristics but also by examining and classifying their temporal patterns. One critical issue in responding to intrusion alerts is determining whether an alert is part of an escalating attack pattern or an opportunistic scan. To identify the former, we apply extreme-regime forecasting methods from financial modeling to IDS data. Extreme-regime forecasting is designed to identify likely future high-impact events or significant shifts in system behavior. Using these methods, we examine attack patterns by computing per-minute alert intensity, volatility, and a short-term momentum measure derived from weighted moving averages.\n  We evaluate the efficacy of a supervised learning model for forecasting future escalation patterns using these derived features. The trained model identifies future high-intensity attacks and demonstrates strong predictive performance, achieving approximately 91\\% accuracy, 89\\% recall, and 98\\% precision. Our contributions provide a temporal measurement framework for identifying future high-intensity attacks and demonstrate the presence of predictive early-warning signals within the temporal structure of IDS alert streams. We describe our methods in sufficient detail to enable reproduction using other IDS datasets. In addition, we make the trained models openly available to support further research. Finally, we introduce an interpretable visualization that enables defenders to generate early predictive warnings of elevated volumetric arrival risk."}
{"id": "2601.14881", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14881", "abs": "https://arxiv.org/abs/2601.14881", "authors": ["Lucas Giroto", "Ândrei Camponogara", "Yueheng Li", "Jiayi Chen", "Lukas Sigg", "Thomas Zwick", "Benjamin Nuss"], "title": "Analysis of Sensing in OFDM-based ISAC under the Influence of Sampling Jitter", "comment": null, "summary": "To enable integrated sensing and communication (ISAC) in cellular networks, a wide range of additional requirements and challenges are either imposed or become more critical. One such impairment is sampling jitter (SJ), which arises due to imperfections in the sampling instants of the clocks of digital-to-analog converters (DACs) and analog-to-digital converters (ADCs). While SJ is already well studied for communication systems based on orthogonal frequency-division multiplexing (OFDM), which is expected to be the waveform of choice for most sixth-generation (6G) scenarios where ISAC could be possible, the implications of SJ on the OFDM-based radar sensing must still be thoroughly analyzed. Considering that phase-locked loop (PLL)-based oscillators are used to derive sampling clocks, which leads to colored SJ, i.e., SJ with non-flat power spectral density, this article analyzes the resulting distortion of the adopted digital constellation modulation and sensing performance in OFDM-based ISAC for both baseband (BB) and bandpass (BP) sampling strategies and different oversampling factors. For BB sampling, it is seen that SJ induces intercarrier interference (ICI), while for BP sampling, it causes carrier phase error and more severe ICI due to a phase noise-like effect at the digital intermediate frequency. Obtained results for a single-input single-output OFDM-based ISAC system with various OFDM signal parameterizations demonstrate that SJ-induced degradation becomes non-negligible for both BB and BP sampling only for root mean square (RMS) SJ values above 10^-11 s at both DAC and ADC, which corresponds to 0.5*10^-2 times the considered critical sampling period without oversampling. Based on the achieved results, it can be concluded that state-of-the-art hardware enables sufficient communication and sensing robustness against SJ, as RMS SJ values in the femtosecond range can be achieved."}
{"id": "2601.15103", "categories": ["cs.NI", "econ.TH"], "pdf": "https://arxiv.org/pdf/2601.15103", "abs": "https://arxiv.org/abs/2601.15103", "authors": ["Erwin J. Sacoto-Cabrera", "Luis Guijarro", "Jose R. Vidal", "Vicent Pla"], "title": "Economic feasibility of virtual operators in 5G via network slicing", "comment": null, "summary": "The provision of services by more than one operator over a common network infrastructure, as enabled by 5G network slicing, is analyzed. Two business models to be implemented by a network operator, who owns the network, and a virtual operator, who does not, are proposed. In one business model, named \\emph{strategic}, the network operator provides service to its user base and the virtual operator provides service to its user base and pays a per-subscriber fee to the network operator. In the other business model, named \\emph{monopolistic}, the network operator provides service to both user bases. The two proposals are analyzed by means of a model that captures both system and economic features. As regards the systems features, the slicing of the network is modeled by means of a Discriminatory Processor Sharing queue. As regards the economic features, the incentives are modeled by means of the user utilities and the operators' revenues; and game theory is used to model the strategic interaction between the users' subscription decision and the operators' pricing decision. In both business models, it is shown that the network operator can be provided with the appropriate economic incentives so that it acquiesces in serving the virtual operator's user base (monopolistic model) and in allowing the virtual operator to provide service over the network operator's infrastructure (strategic model). From the point of view of the users, the strategic model results in a higher subscription rate than the monopolistic model."}
{"id": "2601.14623", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.14623", "abs": "https://arxiv.org/abs/2601.14623", "authors": ["Canran Wang", "Minghui Liwang", "Netanel Raviv"], "title": "Break-Resilient Codes with Loss Tolerance", "comment": null, "summary": "Emerging applications in manufacturing, wireless communication, and molecular data storage require robust coding schemes that remain effective under physical distortions where codewords may be arbitrarily fragmented and partially missing. To address such challenges, we propose a new family of error-correcting codes, termed $(t,s)$-break-resilient codes ($(t,s)$-BRCs). A $(t,s)$-BRC guarantees correct decoding of the original message even after up to~$t$ arbitrary breaks of the codeword and the complete loss of some fragments whose total length is at most~$s$. This model unifies and generalizes previous approaches, extending break-resilient codes (which handle arbitrary fragmentation without fragment loss) and deletion codes (which correct bit losses in unknown positions without fragmentation) into a single information-theoretic framework. We develop a theoretical foundation for $(t,s)$-BRCs, including a formal adversarial channel model, lower bounds on the necessary redundancy, and explicit code constructions that approach these bounds."}
{"id": "2601.14274", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14274", "abs": "https://arxiv.org/abs/2601.14274", "authors": ["Anh-Tuan Mai", "Cam-Van Thi Nguyen", "Duc-Trong Le"], "title": "Divide and Refine: Enhancing Multimodal Representation and Explainability for Emotion Recognition in Conversation", "comment": null, "summary": "Multimodal emotion recognition in conversation (MERC) requires representations that effectively integrate signals from multiple modalities. These signals include modality-specific cues, information shared across modalities, and interactions that emerge only when modalities are combined. In information-theoretic terms, these correspond to \\emph{unique}, \\emph{redundant}, and \\emph{synergistic} contributions. An ideal representation should leverage all three, yet achieving such balance remains challenging. Recent advances in contrastive learning and augmentation-based methods have made progress, but they often overlook the role of data preparation in preserving these components. In particular, applying augmentations directly to raw inputs or fused embeddings can blur the boundaries between modality-unique and cross-modal signals. To address this challenge, we propose a two-phase framework \\emph{\\textbf{D}ivide and \\textbf{R}efine} (\\textbf{DnR}). In the \\textbf{Divide} phase, each modality is explicitly decomposed into uniqueness, pairwise redundancy, and synergy. In the \\textbf{Refine} phase, tailored objectives enhance the informativeness of these components while maintaining their distinct roles. The refined representations are plug-and-play compatible with diverse multimodal pipelines. Extensive experiments on IEMOCAP and MELD demonstrate consistent improvements across multiple MERC backbones. These results highlight the effectiveness of explicitly dividing, refining, and recombining multimodal representations as a principled strategy for advancing emotion recognition. Our implementation is available at https://github.com/mattam301/DnR-WACV2026"}
{"id": "2601.14643", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14643", "abs": "https://arxiv.org/abs/2601.14643", "authors": ["Bhabani Shankar Dey", "Ahan Basu", "Pushpak Jagtap"], "title": "Input-to-State Stabilizing Neural Controllers for Unknown Switched Nonlinear Systems within Compact Sets", "comment": null, "summary": "This paper develops a neural network based control framework that ensures system safety and input-to-state stability (ISS) for general nonlinear switched systems with unknown dynamics. Leveraging the concept of dwell time, we derive Lyapunov based sufficient conditions under which both safety and ISS of the closed-loop switched system are guaranteed. The feedback controllers and the associated Lyapunov functions are parameterized using neural networks and trained from data collected over a compact state space via deterministic sampling. To provide formal stability guarantees under the learned controllers, we introduce a validity condition based on Lipschitz continuity assumptions, which is embedded directly into the training framework. This ensures that the resulting neural network controllers satisfy provable correctness and stability guarantees beyond the sampled data. As a special case, the proposed framework recovers ISS and safety under arbitrary switching when a common Lyapunov function exists. Simulation results on a representative switched nonlinear system demonstrate the effectiveness of the proposed approach."}
{"id": "2601.14302", "categories": ["cs.CR", "cs.AI", "cs.PF"], "pdf": "https://arxiv.org/pdf/2601.14302", "abs": "https://arxiv.org/abs/2601.14302", "authors": ["Jinwei Hu", "Shiyuan Meng", "Yi Dong", "Xiaowei Huang"], "title": "DDSA: Dual-Domain Strategic Attack for Spatial-Temporal Efficiency in Adversarial Robustness Testing", "comment": "Preprint accepted by ICASSP 2026 with minor revisions", "summary": "Image transmission and processing systems in resource-critical applications face significant challenges from adversarial perturbations that compromise mission-specific object classification. Current robustness testing methods require excessive computational resources through exhaustive frame-by-frame processing and full-image perturbations, proving impractical for large-scale deployments where massive image streams demand immediate processing. This paper presents DDSA (Dual-Domain Strategic Attack), a resource-efficient adversarial robustness testing framework that optimizes testing through temporal selectivity and spatial precision. We introduce a scenario-aware trigger function that identifies critical frames requiring robustness evaluation based on class priority and model uncertainty, and employ explainable AI techniques to locate influential pixel regions for targeted perturbation. Our dual-domain approach achieves substantial temporal-spatial resource conservation while maintaining attack effectiveness. The framework enables practical deployment of comprehensive adversarial robustness testing in resource-constrained real-time applications where computational efficiency directly impacts mission success."}
{"id": "2601.14953", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14953", "abs": "https://arxiv.org/abs/2601.14953", "authors": ["Advaith Arun", "Shiv Shankar", "Dhivagar Baskaran", "Klutto Milleth", "Bhaskar Ramamurthi"], "title": "Deep Learning assisted Port-Cycling based Channel Sounding for Precoder Estimation in Massive MIMO Arrays", "comment": "6 pages, 9 figures", "summary": "Future wireless systems are expected to employ a substantially larger number of transmit ports for channel state information (CSI) estimation compared to current specifications. Although scaling ports improves spectral efficiency, it also increases the resource overhead to transmit reference signals across the time-frequency grid, ultimately reducing achievable data throughput. In this work, we propose an deep learning (DL)-based CSI reconstruction framework that serves as an enabler for reliable CSI acquisition in future 6G systems. The proposed solution involves designing a port-cycling mechanism that sequentially sounds different portions of CSI ports across time, thereby lowering the overhead while preserving channel observability. The proposed CSI Adaptive Network (CsiAdaNet) model exploits the resulting sparse measurements and captures both spatial and temporal correlations to accurately reconstruct the full-port CSI. The simulation results show that our method achieves overhead reduction while maintaining high CSI reconstruction accuracy."}
{"id": "2601.14503", "categories": ["cs.CR", "cs.CY", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.14503", "abs": "https://arxiv.org/abs/2601.14503", "authors": ["Wouter Termont", "Beatriz Esteves"], "title": "European digital identity: A missed opportunity?", "comment": "41 pages, 0 figures, uses orcidlink.sty", "summary": "Recent European efforts around digital identity -- the EUDI regulation and its OpenID architecture -- aim high, but start from a narrow and ill-defined conceptualization of authentication. Based on a broader, more grounded understanding of the term, in we identify several issues in the design of OpenID4VCI and OpenID4VP: insecure practices, static, and subject-bound credential types, and a limited query language restrict their application to classic scenarios of credential exchange -- already supported by existing solutions like OpenID Connect, SIOPv2, OIDC4IDA, and OIDC Claims Aggregation -- barring dynamic, asynchronous, or automated use cases. We also debunk OpenID's 'paradigm-shifting' trust-model, which -- when compared to existing decentralized alternatives -- does not deliver any significant increase in control, privacy, and portability of personal information. Not only the technical choices limit the capabilities of the EUDI framework; also the legislation itself cannot accommodate the promise of self-sovereign identity. In particular, we criticize the introduction of institutionalized trusted lists, and discuss their economical and political risks. Their potential to decline into an exclusory, re-centralized ecosystem endangers the vision of a user-oriented identity management in which individuals are in charge. Instead, the consequences might severely restrict people in what they can do with their personal information, and risk increased linkability and monitoring. In anticipation of revisions to the EUDI regulations, we suggest several technical alternatives that overcome some of the issues with the architecture of OpenID. In particular, OAuth's UMA extension and its A4DS profile, as well as their integration in GNAP, are worth looking into. Future research into uniform query (meta-)languages is needed to address the heterogeneity of attestations and providers."}
{"id": "2601.14755", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.14755", "abs": "https://arxiv.org/abs/2601.14755", "authors": ["Lei Xie", "Peilan Wang", "Guanxiong Shen", "Guyue Li", "Weidong Mei", "Liquan Chen"], "title": "Secure Communication in MIMOME Movable-Antenna Systems with Statistical Eavesdropper CSI", "comment": null, "summary": "This paper investigates the potential of movable antennas (MAs) to enhance physical layer security within a multiple-input multiple-output multiple-antenna eavesdropper (MIMOME) system. We consider a practical scenario where the transmitter operates with imperfect eavesdropper channel state information (ECSI), knowing only the instantaneous line-of-sight (LoS) component and the statistical properties of non-line-of-sight (NLoS) component. To rigorously quantify secrecy performance under the ECSI uncertainty, we adopt the ergodic secrecy rate (ESR) as the metric. Since deriving an exact analytical expression for the ESR is intractable, we leverage random matrix theory to derive a deterministic equivalent. This avoids heavy Monte Carlo simulations and also provides explicit insights into the effects of channel spatial statistics on secrecy performance. Building upon the deterministic equivalent, we formulate a joint maximization problem for the transmit precoding matrix and the antenna positions at the legitimate transmitter. To tackle the non-convexity of this optimization problem, we develop a comprehensive alternating optimization framework. Specifically, the precoding matrix is optimized via a majorization-minimization (MM) algorithm, where the gradient is computed by solving an implicit fixed-point equation. For the antenna position optimization, the complexity of the objective function prevents the construction of standard MM surrogate. To this end, we further propose a novel AMSGrad-based surrogate function that relies solely on gradient information. We provide a rigorous theoretical proof that guarantees the convergence of this proposed algorithm despite relaxing the strict majorization conditions."}
{"id": "2601.14275", "categories": ["cs.LG", "cs.MA"], "pdf": "https://arxiv.org/pdf/2601.14275", "abs": "https://arxiv.org/abs/2601.14275", "authors": ["Zewen Yang", "Xiaobing Dai", "Jiajun Cheng", "Yulong Huang", "Peng Shi"], "title": "Quality or Quantity? Error-Informed Selective Online Learning with Gaussian Processes in Multi-Agent Systems: Extended Version", "comment": "Accepted by IEEE/CAA Journal of Automatica Sinica", "summary": "Effective cooperation is pivotal in distributed learning for multi-agent systems, where the interplay between the quantity and quality of the machine learning models is crucial. This paper reveals the irrationality of indiscriminate inclusion of all models on agents for joint prediction, highlighting the imperative to prioritize quality over quantity in cooperative learning. Specifically, we present the first selective online learning framework for distributed Gaussian process (GP) regression, namely distributed error-informed GP (EIGP), that enables each agent to assess its neighboring collaborators, using the proposed selection function to choose the higher quality GP models with less prediction errors. Moreover, algorithmic enhancements are embedded within the EIGP, including a greedy algorithm (gEIGP) for accelerating prediction and an adaptive algorithm (aEIGP) for improving prediction accuracy. In addition, approaches for fast prediction and model update are introduced in conjunction with the error-informed quantification term iteration and a data deletion strategy to achieve real-time learning operations. Numerical simulations are performed to demonstrate the effectiveness of the developed methodology, showcasing its superiority over the state-of-the-art distributed GP methods with different benchmarks."}
{"id": "2601.14663", "categories": ["eess.SY", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14663", "abs": "https://arxiv.org/abs/2601.14663", "authors": ["Yogesh Pipada Sunil Kumar", "S. Ali Pourmousavi", "Jon A. R. Liisberg", "Julian Lesmos-Vinasco"], "title": "Calibrated uncertainty quantification for prosumer flexibility aggregation in ancillary service markets", "comment": "Single column 31 pages, 10 figures, 3 tables, submitted for review to Applied Energy", "summary": "Reliable forecasting of prosumer flexibility is critical for demand response aggregators participating in frequency controlled ancillary services market, where strict reliability requirements such as the P90 standard are enforced. Limited historical data, dependence on exogeneous factors, and heterogenous prosumer behaviour introduce significant epistemic uncertainty, making deterministic or poorly calibrated probabilistic models unsuitable for market bidding. This paper proposes the use of scalable uncertainty quantification framework that integrates Monte Carlo dropout (MCD) with conformal prediction (CP) to produce calibrated, finite sample prediction intervals for aggregated prosumer flexibility. The proposed framework is applied to a behind-the-meter aggregator participating in the Danish manual frequency restoration reserve capacity market. A large-scale synthetic dataset is generated using a modified industry-grade home energy management system, combined with publicly available load, solar, price, activation and device-level data. The resulting machine learning surrogate model captures aggregate prosumer price responsiveness and provides uncertainty-aware estimates suitable for market bidding. Multiple multivariate CP strategies are evaluated and benchmarked against conventional MCD-based methods. Results show that standalone MCD systematically overestimates available flexibility and violates P90 compliance, whereas the proposed MCD-CP framework achieves reliable coverage with controlled conservatism. When embedded in aggregator bidding model, conformalised methods substantially reduce overbidding risk and achieve upto 70% of perfect-information profit while satisfying regulatory reliability constraints, providing practical, computationally efficient, and market-compliant solution for aggregator flexibility forecasting under uncertainty."}
{"id": "2601.14305", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14305", "abs": "https://arxiv.org/abs/2601.14305", "authors": ["Ashikuzzaman", "Md. Shawkat Hossain", "Jubayer Abdullah Joy", "Md Zahid Akon", "Md Manjur Ahmed", "Md. Naimul Islam"], "title": "An Optimized Decision Tree-Based Framework for Explainable IoT Anomaly Detection", "comment": "Acepted and Presented at IEEE 2nd International Conference on Computing, Applications and Systems (COMPAS 2025) , 23-24 October 2025, Kushtia, Bangladesh", "summary": "The increase in the number of Internet of Things (IoT) devices has tremendously increased the attack surface of cyber threats thus making a strong intrusion detection system (IDS) with a clear explanation of the process essential towards resource-constrained environments. Nevertheless, current IoT IDS systems are usually traded off with detection quality, model elucidability, and computational effectiveness, thus the deployment on IoT devices. The present paper counteracts these difficulties by suggesting an explainable AI (XAI) framework based on an optimized Decision Tree classifier with both local and global importance methods: SHAP values that estimate feature attribution using local explanations, and Morris sensitivity analysis that identifies the feature importance in a global view. The proposed system attains the state of art on the test performance with 99.91% accuracy, F1-score of 99.51% and Cohen Kappa of 0.9960 and high stability is confirmed by a cross validation mean accuracy of 98.93%. Efficiency is also enhanced in terms of computations to provide faster inferences compared to those that are generalized in ensemble models. SrcMac has shown as the most significant predictor in feature analyses according to SHAP and Morris methods. Compared to the previous work, our solution eliminates its major drawback lack because it allows us to apply it to edge devices and, therefore, achieve real-time processing, adhere to the new regulation of transparency in AI, and achieve high detection rates on attacks of dissimilar classes. This combination performance of high accuracy, explainability, and low computation make the framework useful and reliable as a resource-constrained IoT security problem in real environments."}
{"id": "2601.15004", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.15004", "abs": "https://arxiv.org/abs/2601.15004", "authors": ["Nipun Agarwal"], "title": "Alternative Shapes of Modulation Schemes Detailed Exposition and Simulation Methodology", "comment": null, "summary": "Modulation constellation design is a core challenge in digital communications, especially under stringent demands on spectral efficiency, robustness, and energy consumption. Classical schemes like PSK and QAM, while analytically tractable, often lose optimality under realistic channels and nonlinear hardware constraints. This paper provides a unified study of constellation design from geometric, probabilistic, optimization, and machine learning perspectives, focusing on symbol error rate (SER), fading robustness, peak-to-average power ratio (PAPR), and energy efficiency. We evaluate classical, lattice-based, asymmetric, probabilistically shaped, Golden Angle, heuristic-optimized, and machine learning assisted constellations under AWGN and Rayleigh fading via large-scale Monte Carlo simulations. Incorporating PAPR-aware and power amplifier models reveals that SER-optimal designs are not always energy-optimal; small SER trade-offs can yield substantial energy savings. Machine learning approaches offer flexible joint optimization of reliability, robustness, and energy efficiency by embedding channel and hardware constraints into the learning objective."}
{"id": "2601.14601", "categories": ["cs.CR", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.14601", "abs": "https://arxiv.org/abs/2601.14601", "authors": ["Haodong Chen", "Ziheng Zhang", "Jinghui Jiang", "Qiang Su", "Qiao Xiang"], "title": "Holmes: An Evidence-Grounded LLM Agent for Auditable DDoS Investigation in Cloud Networks", "comment": null, "summary": "Cloud environments face frequent DDoS threats due to centralized resources and broad attack surfaces. Modern cloud-native DDoS attacks further evolve rapidly and often blend multi-vector strategies, creating an operational dilemma: defenders need wire-speed monitoring while also requiring explainable, auditable attribution for response. Existing rule-based and supervised-learning approaches typically output black-box scores or labels, provide limited evidence chains, and generalize poorly to unseen attack variants; meanwhile, high-quality labeled data is often difficult to obtain in cloud settings.\n  We present Holmes (DDoS Detective), an LLM-based DDoS detection agent that reframes the model as a virtual SRE investigator rather than an end-to-end classifier. Holmes couples a funnel-like hierarchical workflow (counters/sFlow for continuous sensing and triage; PCAP evidence collection triggered only on anomaly windows) with an Evidence Pack abstraction that converts binary packets into compact, reproducible, high-signal structured evidence. On top of this evidence interface, Holmes enforces a structure-first investigation protocol and strict JSON/quotation constraints to produce machine-consumable reports with auditable evidence anchors.\n  We evaluate Holmes on CICDDoS2019 reflection/amplification attacks and script-triggered flooding scenarios. Results show that Holmes produces attribution decisions grounded in salient evidence anchors across diverse attack families, and when errors occur, its audit logs make the failure source easy to localize, demonstrating the practicality of an LLM agent for cost-controlled and traceable DDoS investigation in cloud operations."}
{"id": "2601.14803", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.14803", "abs": "https://arxiv.org/abs/2601.14803", "authors": ["Yuhui Jiao", "Qian Zhang", "Xuejun Cheng", "Yunxiao Li", "Yufei Zhao", "Ju Liu", "Yong Liang Guan"], "title": "Efficient Beamforming for Discrete SIM-Aided Multiuser Systems Under Statistical CSI", "comment": null, "summary": "Stacked Intelligent Metasurfaces (SIM) have emerged as a revolutionary architecture for next-generation wireless communications, offering wave-domain signal processing capabilities with significantly reduced hardware complexity compared to conventional systems. However, most existing SIM research assumes continuous phase shifts and perfect instantaneous channel state information (CSI), which are impractical due to hardware discrete phase shift constraints and prohibitive pilot overhead. This paper presents a joint power allocation and discrete phase shift optimization framework for SIM-aided multiuser multiple-input single-output(MISO) downlink systems under statistical CSI. We formulate the achievable sum rate maximization problem considering practical discrete phase constraints and derive a closed-form expression for the average achievable rate under statistical CSI. To tackle the resulting non-convex optimization problem, we decouple the problem by using the weighted minimum mean square error (WMMSE) algorithm and alternating optimization (AO). Subsequently, we utilize the Lagrangian multiplier method and alternating direction method of multipliers (ADMM) to obtain closed-form iterative solutions. Our simulations demonstrate that the proposed algorithm reduces computational complexity by a factor of 50 compared to semi-definite relaxation (SDR) methods, , while maintaining over 85% of the continuous phase shift performance with only 1-bit quantization, highlighting its feasibility for low-cost hardware systems."}
{"id": "2601.14277", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14277", "abs": "https://arxiv.org/abs/2601.14277", "authors": ["Uygar Kurt"], "title": "Which Quantization Should I Use? A Unified Evaluation of llama.cpp Quantization on Llama-3.1-8B-Instruct", "comment": "17 pages, 6 tables, 1 figure", "summary": "Quantization is a practical technique for making large language models easier to deploy by reducing the precision used to store and operate on model weights. This can lower memory use and improve runtime feasibility on constrained hardware, which is especially relevant for users running models locally. Quantization in llama.cpp enables large language models to run on commodity hardware, but available formats are often evaluated inconsistently, making it hard to choose among schemes. We present a unified empirical study of the llama.cpp quantization on a single modern model, Llama-3.1-8B-Instruct (FP16, GGUF), covering 3-8 bit K-quant and legacy formats. We evaluate downstream task performance across standard reasoning, knowledge, instruction-following, and truthfulness benchmarks, and also measure perplexity and CPU throughput (prefill/decoding) alongside model size, compression, and quantization time. Ultimately, this work is a practical guide for choosing a llama.cpp quantization scheme, helping readers make informed, context-aware decisions for their intended use and resource budget."}
{"id": "2601.14665", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14665", "abs": "https://arxiv.org/abs/2601.14665", "authors": ["Sharaf K. Magableh", "Caisheng Wang", "Oraib Dawaghreh"], "title": "A Two-Stage Risk-Averse DRO-MILP Methodological Framework for Managing AI/Data Center Demand Shocks", "comment": "Submitted to the 2026 IEEE Power and Energy Society General Meeting", "summary": "The rapid growth of artificial intelligence (AI)-driven data centers is reshaping electricity demand patterns. This is achieved by introducing fast, multi-gigawatt load ramps that challenge the stability and resilience of modern power systems. Traditional resilience frameworks focus mainly on physical outages and largely overlook these emerging digital-era disturbances. This paper proposes a unified two-stage, risk-aware distributionally robust optimization (DRO)-MILP framework that coordinates the pre-allocation and post-event dispatch of Flexible Capacity Modules (FCMs), including BESS, fast-ramping generation, demand response, and potential long-duration storage. Stage-I optimally positions FCMs using DRO with CVaR to hedge against uncertain AI load surges. Stage-II models real-time stabilization following stochastic demand-shock scenarios, minimizing imbalance, unserved energy, and restoration penalties. The framework is designed to be applied on IEEE 33-bus system or expanded for scalability to larger IEEE test feeders capable of representing AI-scale loads. This contributes a scalable planning tool for resilient, AI-integrated distribution grids."}
{"id": "2601.14310", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14310", "abs": "https://arxiv.org/abs/2601.14310", "authors": ["Nay Myat Min", "Long H. Pham", "Hongyu Zhang", "Jun Sun"], "title": "CORVUS: Red-Teaming Hallucination Detectors via Internal Signal Camouflage in Large Language Models", "comment": "13 pages, 1 figure", "summary": "Single-pass hallucination detectors rely on internal telemetry (e.g., uncertainty, hidden-state geometry, and attention) of large language models, implicitly assuming hallucinations leave separable traces in these signals. We study a white-box, model-side adversary that fine-tunes lightweight LoRA adapters on the model while keeping the detector fixed, and introduce CORVUS, an efficient red-teaming procedure that learns to camouflage detector-visible telemetry under teacher forcing, including an embedding-space FGSM attention stress test. Trained on 1,000 out-of-distribution Alpaca instructions (<0.5% trainable parameters), CORVUS transfers to FAVA-Annotation across Llama-2, Vicuna, Llama-3, and Qwen2.5, and degrades both training-free detectors (e.g., LLM-Check) and probe-based detectors (e.g., SEP, ICR-probe), motivating adversary-aware auditing that incorporates external grounding or cross-model evidence."}
{"id": "2601.15024", "categories": ["eess.SP", "stat.CO"], "pdf": "https://arxiv.org/pdf/2601.15024", "abs": "https://arxiv.org/abs/2601.15024", "authors": ["Nipun Agarwal"], "title": "Physical Layer Security in Massive MIMO: Challenges and Open Research Directions Against Passive Eavesdroppers", "comment": null, "summary": "Massive Multiple-Input Multiple-Output (MIMO) has become a crucial enabling technology for 5G and beyond, providing previously unheard-of increases in energy and spectrum efficiency. It is still difficult to guarantee secure communication in these systems, particularly when it comes to passive eavesdroppers whose base station is unaware of their channel state information. By taking advantage of the inherent randomness of wireless channels, Physical Layer Security (PLS) offers a promising paradigm; however, its efficacy in massive MIMO is heavily reliant on resource allocation and transmission strategies. In this work, the performance of secure transmission schemes, such as Maximum Ratio Transmission (MRT), Zero-Forcing (ZF), and Artificial Noise (AN)-aided beamforming, is examined when passive eavesdroppers are present. This work will use extensive Monte Carlo simulations to assess important performance metrics such as energy efficiency, secrecy outage probability, and secrecy sum rate under different system parameters (e.g., number of antennas, Signal-to-Noise Ratio (SNR), power allocation). The results aim to provide comparative insight into the strengths and limitations of different PLS strategies and to highlight open research directions to design scalable, energy-efficient, and robust secure transmission techniques in future 6G networks."}
{"id": "2601.14985", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.14985", "abs": "https://arxiv.org/abs/2601.14985", "authors": ["Seyed AmirPouya Moeini", "Albert Guillén i Fàbregas"], "title": "Two-Class Joint Source-Channel Coding: Expurgated Exponents with i.i.d. Distributions", "comment": null, "summary": "This paper studies expurgated exponents for joint source-channel coding of discrete memoryless sources and channels under i.i.d. random coding. We show that a two-class partitioning of source sequences, where the codeword distribution depends on the source type, achieves an exponent at least as high as that of optimal single-class coding, in which the codeword distribution is independent of the source message."}
{"id": "2601.14279", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14279", "abs": "https://arxiv.org/abs/2601.14279", "authors": ["Brady Steele"], "title": "On the Limits of Learned Importance Scoring for KV Cache Compression", "comment": "14 pages, 7 figures, 5 tables", "summary": "We investigate learned KV cache compression through Speculative Importance Prediction (SIP), a 1.7M parameter non-query-aware scorer that predicts token importance from KV representations alone. Despite architectural sophistication (multi-horizon lookahead, cross-attention), SIP does not outperform simple baselines, including random selection, across 5 seeds, 4 retention levels, and 3 tasks. Key findings: (1) position-based heuristics (keep first 4 + last N tokens) match or exceed learned approaches; (2) prefill attention provides equivalent signal to complex learned scorers; (3) marginal information in KV representations beyond position and prefill attention appears limited for importance prediction. We hypothesize that circular dependence between future queries and generation trajectories contributes to this difficulty."}
{"id": "2601.14673", "categories": ["eess.SY", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14673", "abs": "https://arxiv.org/abs/2601.14673", "authors": ["Yogesh Pipada Sunil Kumar", "S. Ali Pourmousavi", "Jon A. R. Liisberg", "Julian Lesmos-Vinasco"], "title": "Efficient reformulations of ReLU deep neural networks for surrogate modelling in power system optimisation", "comment": "24 pages, 7 figures, 3 tables", "summary": "The ongoing decarbonisation of power systems is driving an increasing reliance on distributed energy resources, which introduces complex and nonlinear interactions that are difficult to capture in conventional optimisation models. As a result, machine learning based surrogate modelling has emerged as a promising approach, but integrating machine learning models such as ReLU deep neural networks (DNNs) directly into optimisation often results in nonconvex and computationally intractable formulations. This paper proposes a linear programming (LP) reformulation for a class of convexified ReLU DNNs with non-negative weight matrices beyond the first layer, enabling a tight and tractable embedding of learned surrogate models in optimisation. We evaluate the method using a case study on learning the prosumer's responsiveness within an aggregator bidding problem in the Danish tertiary capacity market. The proposed reformulation is benchmarked against state-of-the-art alternatives, including piecewise linearisation (PWL), MIP-based embedding, and other LP relaxations. Across multiple neural network architectures and market scenarios, the convexified ReLU DNN achieves solution quality comparable to PWL and MIP-based reformulations while significantly improving computational performance and preserving model fidelity, unlike penalty-based reformulations. The results demonstrate that convexified ReLU DNNs offer a scalable and reliable methodology for integrating learned surrogate models in optimisation, with applicability to a wide range of emerging power system applications."}
{"id": "2601.14311", "categories": ["cs.CR", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14311", "abs": "https://arxiv.org/abs/2601.14311", "authors": ["Richard Hohensinner", "Belgin Mutlu", "Inti Gabriel Mendoza Estrada", "Matej Vukovic", "Simone Kopeinik", "Roman Kern"], "title": "Tracing the Data Trail: A Survey of Data Provenance, Transparency and Traceability in LLMs", "comment": "35 pages, 6 figures. Manuscript submitted to ACM Computing Surveys (CSUR) on the 12th of December 2025", "summary": "Large language models (LLMs) are deployed at scale, yet their training data life cycle remains opaque. This survey synthesizes research from the past ten years on three tightly coupled axes: (1) data provenance, (2) transparency, and (3) traceability, and three supporting pillars: (4) bias \\& uncertainty, (5) data privacy, and (6) tools and techniques that operationalize them. A central contribution is a proposed taxonomy defining the field's domains and listing corresponding artifacts. Through analysis of 95 publications, this work identifies key methodologies concerning data generation, watermarking, bias measurement, data curation, data privacy, and the inherent trade-off between transparency and opacity."}
{"id": "2601.15097", "categories": ["eess.SP", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2601.15097", "abs": "https://arxiv.org/abs/2601.15097", "authors": ["Johanna Wilroth", "Oskar Keding", "Martin A. Skoglund", "Maria Sandsten", "Martin Enqvist", "Emina Alickovic"], "title": "Neural Tracking of Sustained Attention, Attention Switching, and Natural Conversation in Audiovisual Environments using Mobile EEG", "comment": "Submitted to European Journal of Neuroscience", "summary": "Everyday communication is dynamic and multisensory, often involving shifting attention, overlapping speech and visual cues. Yet, most neural attention tracking studies are still limited to highly controlled lab settings, using clean, often audio-only stimuli and requiring sustained attention to a single talker. This work addresses that gap by introducing a novel dataset from 24 normal-hearing participants. We used a mobile electroencephalography (EEG) system (44 scalp electrodes and 20 cEEGrid electrodes) in an audiovisual (AV) paradigm with three conditions: sustained attention to a single talker in a two-talker environment, attention switching between two talkers, and unscripted two-talker conversations with a competing single talker. Analysis included temporal response functions (TRFs) modeling, optimal lag analysis, selective attention classification with decision windows ranging from 1.1s to 35s, and comparisons of TRFs for attention to AV conversations versus side audio-only talkers. Key findings show significant differences in the attention-related P2-peak between attended and ignored speech across conditions for scalp EEG. No significant change in performance between switching and sustained attention suggests robustness for attention switches. Optimal lag analysis revealed narrower peak for conversation compared to single-talker AV stimuli, reflecting the additional complexity of multi-talker processing. Classification of selective attention was consistently above chance (55-70% accuracy) for scalp EEG, while cEEGrid data yielded lower correlations, highlighting the need for further methodological improvements. These results demonstrate that mobile EEG can reliably track selective attention in dynamic, multisensory listening scenarios and provide guidance for designing future AV paradigms and real-world attention tracking applications."}
{"id": "2601.14987", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.14987", "abs": "https://arxiv.org/abs/2601.14987", "authors": ["AmirPouya Moeini", "Albert Guillén i Fàbregas"], "title": "Random Gilbert-Varshamov Codes for Joint Source-Channel Coding", "comment": "This paper has been submitted to ISIT 2026 for review", "summary": "We propose a random coding technique for joint source-channel coding of discrete memoryless sources and channels. The approach builds on the random Gilbert-Varshamov code construction of Somekh-Baruch et al. and extends it to the joint source-channel setting. We show that the resulting ensemble attains the maximum of the random-coding and expurgated error exponents."}
{"id": "2601.14283", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14283", "abs": "https://arxiv.org/abs/2601.14283", "authors": ["Kangyu Zheng", "Kai Zhang", "Jiale Tan", "Xuehan Chen", "Yingzhou Lu", "Zaixi Zhang", "Lichao Sun", "Marinka Zitnik", "Tianfan Fu", "Zhiding Liang"], "title": "Beyond Affinity: A Benchmark of 1D, 2D, and 3D Methods Reveals Critical Trade-offs in Structure-Based Drug Design", "comment": null, "summary": "Currently, the field of structure-based drug design is dominated by three main types of algorithms: search-based algorithms, deep generative models, and reinforcement learning. While existing works have typically focused on comparing models within a single algorithmic category, cross-algorithm comparisons remain scarce. In this paper, to fill the gap, we establish a benchmark to evaluate the performance of fifteen models across these different algorithmic foundations by assessing the pharmaceutical properties of the generated molecules and their docking affinities and poses with specified target proteins. We highlight the unique advantages of each algorithmic approach and offer recommendations for the design of future SBDD models. We emphasize that 1D/2D ligand-centric drug design methods can be used in SBDD by treating the docking function as a black-box oracle, which is typically neglected. Our evaluation reveals distinct patterns across model categories. 3D structure-based models excel in binding affinities but show inconsistencies in chemical validity and pose quality. 1D models demonstrate reliable performance in standard molecular metrics but rarely achieve optimal binding affinities. 2D models offer balanced performance, maintaining high chemical validity while achieving moderate binding scores. Through detailed analysis across multiple protein targets, we identify key improvement areas for each model category, providing insights for researchers to combine strengths of different approaches while addressing their limitations. All the code that are used for benchmarking is available in https://github.com/zkysfls/2025-sbdd-benchmark"}
{"id": "2601.14689", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14689", "abs": "https://arxiv.org/abs/2601.14689", "authors": ["Hyeongon Park", "Daniel K. Molzahn", "Rahul K. Gupta"], "title": "Ramping-aware Enhanced Flexibility Aggregation of Distributed Generation with Energy Storage in Power Distribution Networks", "comment": "10 pages, 4 figures", "summary": "Power distribution networks are increasingly hosting controllable and flexible distributed energy resources (DERs) that, when aggregated, can provide ancillary support to transmission systems. However, existing aggregation schemes often ignore the ramping constraints of these DERs, which can render them impractical in real deployments. This work proposes a ramping-aware flexibility aggregation scheme, computed at the transmission-distribution boundary, that explicitly accounts for DER ramp limits and yields flexibility envelopes that are provably disaggregable. To further enhance the attainable flexibility region, we introduce a novel pre-ramping strategy, which proactively adjusts resource operating points to enlarge the aggregated flexibility envelope while preserving both network feasibility and disaggregation guarantees. The proposed method demonstrates a 5.2% to 19.2% improvement in flexibility relative to the baseline model, depending on system conditions. We validate the scheme on an IEEE-33 bus distribution system and provide formal proofs showing that both aggregation strategies are disaggregable for all feasible trajectories within the aggregate flexibility envelope."}
{"id": "2601.14323", "categories": ["cs.CR", "cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2601.14323", "abs": "https://arxiv.org/abs/2601.14323", "authors": ["Bingxin Xu", "Yuzhang Shang", "Binghui Wang", "Emilio Ferrara"], "title": "SilentDrift: Exploiting Action Chunking for Stealthy Backdoor Attacks on Vision-Language-Action Models", "comment": null, "summary": "Vision-Language-Action (VLA) models are increasingly deployed in safety-critical robotic applications, yet their security vulnerabilities remain underexplored. We identify a fundamental security flaw in modern VLA systems: the combination of action chunking and delta pose representations creates an intra-chunk visual open-loop. This mechanism forces the robot to execute K-step action sequences, allowing per-step perturbations to accumulate through integration. We propose SILENTDRIFT, a stealthy black-box backdoor attack exploiting this vulnerability. Our method employs the Smootherstep function to construct perturbations with guaranteed C2 continuity, ensuring zero velocity and acceleration at trajectory boundaries to satisfy strict kinematic consistency constraints. Furthermore, our keyframe attack strategy selectively poisons only the critical approach phase, maximizing impact while minimizing trigger exposure. The resulting poisoned trajectories are visually indistinguishable from successful demonstrations. Evaluated on the LIBERO, SILENTDRIFT achieves a 93.2% Attack Success Rate with a poisoning rate under 2%, while maintaining a 95.3% Clean Task Success Rate."}
{"id": "2601.15126", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.15126", "abs": "https://arxiv.org/abs/2601.15126", "authors": ["Robin Rajamäki", "Visa Koivunen"], "title": "Sparse Sensor Arrays for Active Sensing: Models, Configurations and Applications", "comment": null, "summary": "This chapter focuses on active sensing using sparse arrays. In active sensing applications, such as radar, sonar, wireless communications, and medical ultrasound, a collection of sensors probes the environment by emitting self-generated energy. A key benefit of such active multi-sensor arrays is their ability to focus and steer energy in desired directions by beamforming on transmit. Sparse sensor arrays offer several advantages over conventional uniform arrays, including improved resolution using fewer physical sensors and the capability to identify more scatterers than sensors. This is facilitated by the effective transmit-receive virtual array known as the sum co-array, which can have many more virtual sensors than the number of physical transmit or receive sensors. Herein, we focus on the design of low-redundancy sparse array configurations and on employing transmit-receive (Tx-Rx) beamforming using sparse arrays. We discuss the optimal, but computationally intractable Minimum-redundancy array, and a scalable symmetric array framework, which extends many well-known passive sparse array geometries to the active case. We also examine mitigating side lobes arising from spatial undersampling by a synthetic beamforming method known as image addition. We briefly present approaches for finding the physical beamforming weights synthesizing a desired Tx-Rx beampattern, and consider related spatio-temporal trade-offs. We conclude by discussing selected applications of sparse arrays in active sensing."}
{"id": "2601.15028", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.15028", "abs": "https://arxiv.org/abs/2601.15028", "authors": ["Takuya Isomura"], "title": "Information mechanics: conservation and exchange", "comment": null, "summary": "Inference and learning are commonly cast in terms of optimisation, yet the fundamental constraints governing uncertainty reduction remain unclear. This work presents a first-principles framework inherent to Bayesian updating, termed information mechanics (infomechanics). Any pointwise reduction in posterior surprisal is exactly balanced by information gained from data, independently of algorithms, dynamics, or implementation. Imposing additivity, symmetry, and robustness collapses the freedom of this identity to only two independent conservation relations. One governs the global redistribution of uncertainty and recovers Shannon entropy. The other captures a complementary local geometric component, formalised as Fisher information. Together, these conserved quantities motivate a non-additive state function, the information potential $Φ$, which isolates structural degrees of freedom beyond entropy while remaining invariant under reparametrisation. $Φ$ quantifies local sharpness and ruggedness in posterior beliefs and vanishes uniquely for isotropic Gaussian distributions. In a low-temperature regime, $Φ$ scales logarithmically with the effective number of local optima, linking information geometry to computational complexity. This formalises an information-computation exchange, whereby information acquisition reshapes the inference landscape and reduces computational demands. By separating invariant informational constraints from inference mechanisms, this framework provides a unified, algorithm-independent foundation for inference, learning, and computation across biological and artificial systems."}
{"id": "2601.14285", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14285", "abs": "https://arxiv.org/abs/2601.14285", "authors": ["Pengyu Liu", "Mariel Vázquez", "Nataša Jonoska"], "title": "A Comparison of Polynomial-Based Tree Clustering Methods", "comment": null, "summary": "Tree structures appear in many fields of the life sciences, including phylogenetics, developmental biology and nucleic acid structures. Trees can be used to represent RNA secondary structures, which directly relate to the function of non-coding RNAs. Recent developments in sequencing technology and artificial intelligence have yielded numerous biological data that can be represented with tree structures. This requires novel methods for tree structure data analytics. Tree polynomials provide a computationally efficient, interpretable and comprehensive way to encode tree structures as matrices, which are compatible with most data analytics tools. Machine learning methods based on the Canberra distance between tree polynomials have been introduced to analyze phylogenies and nucleic acid structures. In this paper, we compare the performance of different distances in tree clustering methods based on a tree distinguishing polynomial. We also implement two basic autoencoder models for clustering trees using the polynomial. We find that the distance based methods with entry-level normalized distances have the highest clustering accuracy among the compared methods."}
{"id": "2601.14704", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14704", "abs": "https://arxiv.org/abs/2601.14704", "authors": ["Ruixing Ren", "Minqi Tao", "Junhui Zhao", "Xiaoke Sun", "Qiuping Li"], "title": "Hierarchical Optimization Based Multi-objective Dynamic Regulation Scheme for VANET Topology", "comment": "10 pages, 6 figures. A topology optimization strategy is proposed in this paper to optimize the latency, average path length, and throughput in Vehicular Ad Hoc Networks (VANETs)", "summary": "As a core technology of intelligent transportation systems, vehicular ad-hoc networks support latency-sensitive services such as safety warning and cooperative perception via vehicle-to-everything communications. However, their highly dynamic topology increases average path length, raises latency, and reduces throughput, severely limiting communication performance. Existing topology optimization methods lack capabilities in multi-objective coordination, dynamic adaptation, and global-local synergy. To address this, this paper proposes a two-layer dynamic topology regulation scheme combining local feature aggregation and global adjustment. The scheme constructs a dynamic multi-objective optimization model integrating average path length, end-to-end latency, and network throughput, and achieves multi-index coordination via link adaptability metrics and a dynamic normalization mechanism. it quickly responds to local link changes via feature fusion of local node feature extraction and dynamic neighborhood sensing, and balances optimization accuracy and real-time performance using a dual-mode adaptive solving strategy for global topology adjustment. It reduces network oscillation risks by introducing a performance improvement threshold and a topology validity verification mechanism. Simulation results on real urban road networks via the SUMO platform show that the proposed scheme outperforms traditional methods in average path length (stabilizing at ~4 hops), end-to-end latency (remaining ~0.01 s), and network throughput."}
{"id": "2601.14340", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14340", "abs": "https://arxiv.org/abs/2601.14340", "authors": ["Yiyang Lu", "Jinwen He", "Yue Zhao", "Kai Chen", "Ruigang Liang"], "title": "Turn-Based Structural Triggers: Prompt-Free Backdoors in Multi-Turn LLMs", "comment": null, "summary": "Large Language Models (LLMs) are widely integrated into interactive systems such as dialogue agents and task-oriented assistants. This growing ecosystem also raises supply-chain risks, where adversaries can distribute poisoned models that degrade downstream reliability and user trust. Existing backdoor attacks and defenses are largely prompt-centric, focusing on user-visible triggers while overlooking structural signals in multi-turn conversations. We propose Turn-based Structural Trigger (TST), a backdoor attack that activates from dialogue structure, using the turn index as the trigger and remaining independent of user inputs. Across four widely used open-source LLM models, TST achieves an average attack success rate (ASR) of 99.52% with minimal utility degradation, and remains effective under five representative defenses with an average ASR of 98.04%. The attack also generalizes well across instruction datasets, maintaining an average ASR of 99.19%. Our results suggest that dialogue structure constitutes an important and under-studied attack surface for multi-turn LLM systems, motivating structure-aware auditing and mitigation in practice."}
{"id": "2601.15145", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.15145", "abs": "https://arxiv.org/abs/2601.15145", "authors": ["Victoria Palhares", "Artjom Grudnitsky", "Silvio Mandelli"], "title": "Weather Estimation for Integrated Sensing and Communication", "comment": "This work has been submitted to IEEE for possible publication", "summary": "One of the key features of sixth generation (6G) mobile communications will be integrated sensing and communication (ISAC). While the main goal of ISAC in standardization efforts is to detect objects, the byproducts of radar operations can be used to enable new services in 6G, such as weather sensing. Even though weather radars are the most prominent technology for weather detection and monitoring, they are expensive and usually neglect areas in close vicinity. To this end, we propose reusing the dense deployment of 6G base stations for weather sensing purposes by detecting and estimating weather conditions. We implement both a classifier and a regressor as a convolutional neural network trained across measurements with varying precipitation rates and wind speeds. We implement our approach in an ISAC proof-of-concept, and conduct a multi-week experiment campaign. Experimental results show that we are able to jointly and accurately classify weather conditions with accuracies of 99.38% and 98.99% for precipitation rate and wind speed, respectively. For estimation, we obtain errors of 1.2 mm/h and 1.5 km/h, for precipitation rate and wind speed, respectively. These findings indicate that weather sensing services can be reliably deployed in 6G ISAC networks, broadening their service portfolio and boosting their market value."}
{"id": "2601.15048", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.15048", "abs": "https://arxiv.org/abs/2601.15048", "authors": ["Mingcheng Nie", "Ruoxi Chong", "Shuangyang Li", "Arman Farhang", "Fabian Göttsch", "Derrick Wing Kwan Ng", "Michail Matthaiou", "Yonghui Li"], "title": "Towards Standardizing OTFS: A Candidate Waveform for Next-Generation Wireless Networks", "comment": null, "summary": "The standardization of the sixth-generation (6G) has recently commenced to address the rapidly growing demands for enhanced wireless network services. Nevertheless, existing wireless systems, particularly at the physical layer waveform level, remain inadequate for achieving the ambitious key performance indicators (KPIs) envisioned for 6G. Specifically, orthogonal frequency division multiplexing (OFDM), the widely adopted waveform in fifth-generation new radio (5G-NR) networks, suffers from inherent limitations in satisfying these stringent requirements. In practice, OFDM can experience severe inter-carrier interference (ICI), resulting in a pronounced data rate error floor caused by high Doppler shifts. Additionally, the repetitive usage of cyclic prefixes (CPs), intended to combat multipath delays, results in significant spectral inefficiency. These fundamental drawbacks pose critical obstacles to fulfilling 6G performance objectives. Orthogonal time frequency space (OTFS) modulation has recently emerged as a promising waveform candidate, addressing the aforementioned challenges by exploiting the unique characteristics of the delay-Doppler (DD) domain channel. Unlike OFDM, OTFS is inherently resilient to channel distortions induced by delay and Doppler effects, while remaining sensitive to time and frequency shifts. Such intrinsic properties are instrumental in enabling OTFS, with joint communication and sensing capabilities, to embrace, rather than combat, dynamic channel conditions. Motivated by these compelling advantages, this article investigates the feasibility and practical implementation of OTFS modulation leveraging the current OFDM-based wireless systems."}
{"id": "2601.14287", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14287", "abs": "https://arxiv.org/abs/2601.14287", "authors": ["Xiucheng Xu", "Bingbing Xu", "Xueyun Tian", "Zihe Huang", "Rongxin Chen", "Yunfan Li", "Huawei Shen"], "title": "Chain-of-Memory: Lightweight Memory Construction with Dynamic Evolution for LLM Agents", "comment": null, "summary": "External memory systems are pivotal for enabling Large Language Model (LLM) agents to maintain persistent knowledge and perform long-horizon decision-making. Existing paradigms typically follow a two-stage process: computationally expensive memory construction (e.g., structuring data into graphs) followed by naive retrieval-augmented generation. However, our empirical analysis reveals two fundamental limitations: complex construction incurs high costs with marginal performance gains, and simple context concatenation fails to bridge the gap between retrieval recall and reasoning accuracy. To address these challenges, we propose CoM (Chain-of-Memory), a novel framework that advocates for a paradigm shift toward lightweight construction paired with sophisticated utilization. CoM introduces a Chain-of-Memory mechanism that organizes retrieved fragments into coherent inference paths through dynamic evolution, utilizing adaptive truncation to prune irrelevant noise. Extensive experiments on the LongMemEval and LoCoMo benchmarks demonstrate that CoM outperforms strong baselines with accuracy gains of 7.5%-10.4%, while drastically reducing computational overhead to approximately 2.7% of token consumption and 6.0% of latency compared to complex memory architectures."}
{"id": "2601.14725", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14725", "abs": "https://arxiv.org/abs/2601.14725", "authors": ["Zihao Ren", "Lei Wang", "Deming Yuan", "Guodong Shi"], "title": "Differential Privacy on Affine Manifolds: Geometrically Confined Privacy in Linear Dynamical Systems", "comment": null, "summary": "In this paper, we present a comprehensive framework for differential privacy over affine manifolds and validate its usefulness in the contexts of differentially private cloud-based control and average consensus. We consider differential privacy mechanisms for linear queries when the input data are constrained to lie on affine manifolds, a structural property that is assumed to be available as prior knowledge to adversaries. In this setting, the definition of neighborhood adjacency must be formulated with respect to the intrinsic geometry of the manifolds. We demonstrate that such affine-manifold constraints can fundamentally alter the attainable privacy levels relative to the unconstrained case. In particular, we derive necessary and sufficient conditions under which differential privacy can be realized via structured noise injection mechanisms, wherein correlated Gaussian or Laplace noise distributions, rather than i.i.d. perturbations, are calibrated to the dataset. Based on these characterizations, we develop explicit noise calibration procedures that guarantee the tight realization of any prescribed privacy budget with a matching noise magnitude. Finally, we show that the proposed framework admits direct applications to linear dynamical systems ranging from differentially private cloud-based control to privacy-preserving average consensus, all of which naturally involve affine-manifold constraints. The established theoretical results are illustrated through numerical examples."}
{"id": "2601.14343", "categories": ["cs.CR", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14343", "abs": "https://arxiv.org/abs/2601.14343", "authors": ["William Pan", "Guiran Liu", "Binrong Zhu", "Qun Wang", "Yingzhou Lu", "Beiyu Lin", "Rose Qingyang Hu"], "title": "Rethinking On-Device LLM Reasoning: Why Analogical Mapping Outperforms Abstract Thinking for IoT DDoS Detection", "comment": null, "summary": "The rapid expansion of IoT deployments has intensified cybersecurity threats, notably Distributed Denial of Service (DDoS) attacks, characterized by increasingly sophisticated patterns. Leveraging Generative AI through On-Device Large Language Models (ODLLMs) provides a viable solution for real-time threat detection at the network edge, though limited computational resources present challenges for smaller ODLLMs. This paper introduces a novel detection framework that integrates Chain-of-Thought (CoT) reasoning with Retrieval-Augmented Generation (RAG), tailored specifically for IoT edge environments. We systematically evaluate compact ODLLMs, including LLaMA 3.2 (1B, 3B) and Gemma 3 (1B, 4B), using structured prompting and exemplar-driven reasoning strategies. Experimental results demonstrate substantial performance improvements with few-shot prompting, achieving macro-average F1 scores as high as 0.85. Our findings highlight the significant advantages of incorporating exemplar-based reasoning, underscoring that CoT and RAG approaches markedly enhance small ODLLMs' capabilities in accurately classifying complex network attacks under stringent resource constraints."}
{"id": "2209.07861", "categories": ["cs.NI", "cs.IT", "cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2209.07861", "abs": "https://arxiv.org/abs/2209.07861", "authors": ["Anil Kumar Yerrapragada", "Jeeva Keshav S", "Ankit Gautam", "Radha Krishna Ganti"], "title": "Machine Learning Decoder for 5G NR PUCCH Format 0", "comment": "Accepted at 2023 National Conference on Communications (NCC 2023), IIT Guwahati", "summary": "5G cellular systems depend on the timely exchange of feedback control information between the user equipment and the base station. Proper decoding of this control information is necessary to set up and sustain high throughput radio links. This paper makes the first attempt at using Machine Learning techniques to improve the decoding performance of the Physical Uplink Control Channel Format 0. We use fully connected neural networks to classify the received samples based on the uplink control information content embedded within them. The trained neural network, tested on real-time wireless captures, shows significant improvement in accuracy over conventional DFT-based decoders, even at low SNR. The obtained accuracy results also demonstrate conformance with 3GPP requirements."}
{"id": "2601.15067", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.15067", "abs": "https://arxiv.org/abs/2601.15067", "authors": ["Mingcheng Nie", "Ruoxi Chong", "Shuangyang Li", "Weijie Yuan", "Derrick Wing Kwan Ng", "Michail Matthaiou", "Giuseppe Caire", "Yonghui Li"], "title": "A Novel Cross-Domain Channel Estimation Scheme for OFDM", "comment": null, "summary": "In this paper, we propose a novel cross-domain channel estimation (CDCE) algorithm for orthogonal frequency division multiplexing (OFDM) systems, leveraging the unique characteristics of the delay-Doppler (DD) domain channel. Specifically, the proposed algorithm transforms the time-frequency (TF) domain pilot sequence of OFDM into the DD domain and applies a two-dimensional (2D) twisted-convolution for acquiring a coarse estimation of the underlying channel delay and Doppler. Then, the OFDM channel estimation is formulated as a sparse signal recovery problem in the TF domain according to the dictionary derived based on the obtained delay and Doppler estimates. Furthermore, a low-complexity $\\ell_1$-regularized least-square estimator is proposed to effectively solve this problem. Moreover, we further develop a performance analysis framework of the proposed scheme based on the ambiguity function (AF) of the adopted pilot sequence. Our numerical results demonstrate noticeable estimation performance improvement compared to conventional OFDM channel estimation methods, particularly in the presence of high channel mobility."}
{"id": "2601.14300", "categories": ["cs.LG", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14300", "abs": "https://arxiv.org/abs/2601.14300", "authors": ["Jun Liu", "Leo Yu Zhang", "Fengpeng Li", "Isao Echizen", "Jiantao Zhou"], "title": "Gradient Structure Estimation under Label-Only Oracles via Spectral Sensitivity", "comment": null, "summary": "Hard-label black-box settings, where only top-1 predicted labels are observable, pose a fundamentally constrained yet practically important feedback model for understanding model behavior. A central challenge in this regime is whether meaningful gradient information can be recovered from such discrete responses. In this work, we develop a unified theoretical perspective showing that a wide range of existing sign-flipping hard-label attacks can be interpreted as implicitly approximating the sign of the true loss gradient. This observation reframes hard-label attacks from heuristic search procedures into instances of gradient sign recovery under extremely limited feedback. Motivated by this first-principles understanding, we propose a new attack framework that combines a zero-query frequency-domain initialization with a Pattern-Driven Optimization (PDO) strategy. We establish theoretical guarantees demonstrating that, under mild assumptions, our initialization achieves higher expected cosine similarity to the true gradient sign compared to random baselines, while the proposed PDO procedure attains substantially lower query complexity than existing structured search approaches. We empirically validate our framework through extensive experiments on CIFAR-10, ImageNet, and ObjectNet, covering standard and adversarially trained models, commercial APIs, and CLIP-based models. The results show that our method consistently surpasses SOTA hard-label attacks in both attack success rate and query efficiency, particularly in low-query regimes. Beyond image classification, our approach generalizes effectively to corrupted data, biomedical datasets, and dense prediction tasks. Notably, it also successfully circumvents Blacklight, a SOTA stateful defense, resulting in a $0\\%$ detection rate. Our code will be released publicly soon at https://github.com/csjunjun/DPAttack.git."}
{"id": "2601.14880", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14880", "abs": "https://arxiv.org/abs/2601.14880", "authors": ["Lei Zheng", "Luyao Zhang", "Peiqi Yu", "Yifan Sun", "Sergio Grammatico", "Jun Ma", "Changliu Liu"], "title": "Contingency Planning for Safety-Critical Autonomous Vehicles: A Review and Perspectives", "comment": "23 pages, 6 figures", "summary": "Contingency planning is the architectural capability that enables autonomous vehicles (AVs) to anticipate and mitigate discrete, high-impact hazards, such as sensor outages and adversarial interactions. This paper presents a comprehensive survey of the field, synthesizing fragmented literature into a unified logic-conditioned hybrid control framework. Within this formalism, we categorize approaches into two distinct paradigms: Reactive Safety, which responds to realized hazards by enforcing safety constraints or executing fail-safe maneuvers; and Proactive Safety, which optimizes for future recourse by branching over potential modal transitions. In addition, we propose a fine-grained taxonomy that partitions the landscape into external contingencies (environmental and interactive hazards) and internal contingencies (system faults). Through a critical comparative analysis, we reveal a fundamental structural divergence: internal faults are predominantly addressed via reactive fail-safe mechanisms, whereas external interaction uncertainties increasingly require proactive branching strategies. Furthermore, we identify a critical methodological divergence: whereas physical hazards are typically managed with formal guarantees, semantic and out-of-distribution anomalies currently rely heavily on empirical validation. We conclude by identifying the open challenges in bridging the gap between theoretical guarantees and practical validation, advocating for hybrid architectures and standardized benchmarking to transition contingency planning from formulation to certifiable real-world deployment."}
{"id": "2601.14415", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14415", "abs": "https://arxiv.org/abs/2601.14415", "authors": ["Mahyar Ghazanfari", "Iman Sharifi", "Peng Wei", "Noah Dahle", "Abel Diaz Gonzalez", "Austin Coursey", "Bryce Bjorkman", "Cailani Lemieux-Mack", "Robert Canady", "Abenezer Taye", "Bryan C. Ward", "Xenofon Koutsoukos", "Gautam Biswas", "Maheed H. Ahmed", "Hyeong Tae Kim", "Mahsa Ghasemi", "Vijay Gupta", "Filippos Fotiadis", "Ufuk Topcu", "Junchi Lu", "Alfred Chen", "Abdul Kareem Ras", "Nischal Aryal", "Amer Ibrahim", "Amir Shirkhodaie", "Heber Herencia-Zapana", "Saqib Hasan", "Isaac Amundson"], "title": "A Survey of Security Challenges and Solutions for Advanced Air Mobility and eVTOL Aircraft", "comment": "28 pages, 4 figures, 11 tables", "summary": "This survey reviews the existing and envisioned security vulnerabilities and defense mechanisms relevant to Advanced Air Mobility (AAM) systems, with a focus on electric vertical takeoff and landing (eVTOL) aircraft. Drawing from vulnerabilities in the avionics in commercial aviation and the automated unmanned aerial systems (UAS), the paper presents a taxonomy of attacks, analyzes mitigation strategies, and proposes a secure system architecture tailored to the future AAM ecosystem. The paper also highlights key threat vectors, including Global Positioning System (GPS) jamming/spoofing, ATC radio frequency misuse, attacks on TCAS and ADS-B, possible backdoor via Electronic Flight Bag (EFB), new vulnerabilities introduced by aircraft automation and connectivity, and risks from flight management system (FMS) software, database and cloud services. Finally, this paper describes emerging defense techniques against these attacks, and open technical problems to address toward better defense mechanisms."}
{"id": "2601.14942", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14942", "abs": "https://arxiv.org/abs/2601.14942", "authors": ["Hang Zhao", "Hongru Li", "Dongfang Xu", "Shenghui Song", "Khaled B. Letaief"], "title": "Communication-Efficient Multi-Modal Edge Inference via Uncertainty-Aware Distributed Learning", "comment": null, "summary": "Semantic communication is emerging as a key enabler for distributed edge intelligence due to its capability to convey task-relevant meaning. However, achieving communication-efficient training and robust inference over wireless links remains challenging. This challenge is further exacerbated for multi-modal edge inference (MMEI) by two factors: 1) prohibitive communication overhead for distributed learning over bandwidth-limited wireless links, due to the \\emph{multi-modal} nature of the system; and 2) limited robustness under varying channels and noisy multi-modal inputs. In this paper, we propose a three-stage communication-aware distributed learning framework to improve training and inference efficiency while maintaining robustness over wireless channels. In Stage~I, devices perform local multi-modal self-supervised learning to obtain shared and modality-specific encoders without device--server exchange, thereby reducing the communication cost. In Stage~II, distributed fine-tuning with centralized evidential fusion calibrates per-modality uncertainty and reliably aggregates features distorted by noise or channel fading. In Stage~III, an uncertainty-guided feedback mechanism selectively requests additional features for uncertain samples, optimizing the communication--accuracy tradeoff in the distributed setting. Experiments on RGB--depth indoor scene classification show that the proposed framework attains higher accuracy with far fewer training communication rounds and remains robust to modality degradation or channel variation, outperforming existing self-supervised and fully supervised baselines."}
{"id": "2601.15113", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.15113", "abs": "https://arxiv.org/abs/2601.15113", "authors": ["Yixuan Huang", "Jie Yang", "Chao-Kai Wen", "Xiao Li", "Shi Jin"], "title": "Physics-Informed Wireless Imaging with Implicit Neural Representation in RIS-Aided ISAC System", "comment": "accepted by ICC 2026", "summary": "Wireless imaging is emerging as a key capability in next-generation integrated sensing and communication (ISAC) systems, supporting diverse context-aware applications. However, conventional imaging approaches, whether based on physical models or data-driven learning, face challenges such as accurate multipath separation and representative dataset acquisition. To address these issues, this study explores the use of implicit neural representation (INR), a paradigm that has achieved notable advancements in computer vision, for wireless imaging in reconfigurable intelligent surface-aided ISAC systems. The neural network of INR is specifically designed with positional encoding and sine activation functions. Leveraging physics-informed loss functions, INR is optimized through deep learning to represent continuous target shapes and scattering profiles, enabling resolution-agnostic imaging with strong generalization capability. Extensive simulations demonstrate that the proposed INR-based method achieves significant improvements over state-of-the-art techniques and further reveals the focal length characteristics of the imaging system."}
{"id": "2601.14327", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.14327", "abs": "https://arxiv.org/abs/2601.14327", "authors": ["YuanLab. ai", "Shawn Wu", "Jiangang Luo", "Tong Yu", "Darcy Chen", "Sean Wang", "Xudong Zhao", "Louie Li", "Claire Wang", "Hunter He", "Carol Wang", "Allen Wang"], "title": "Layer-adaptive Expert Pruning for Pre-Training of Mixture-of-Experts Large Language Models", "comment": null, "summary": "Although Mixture-of-Experts (MoE) Large Language Models (LLMs) deliver superior accuracy with a reduced number of active parameters, their pre-training represents a significant computationally bottleneck due to underutilized experts and limited training efficiency. This work introduces a Layer-Adaptive Expert Pruning (LAEP) algorithm designed for the pre-training stage of MoE LLMs. In contrast to previous expert pruning approaches that operate primarily in the post-training phase, the proposed algorithm enhances training efficiency by selectively pruning underutilized experts and reorganizing experts across computing devices according to token distribution statistics. Comprehensive experiments demonstrate that LAEP effectively reduces model size and substantially improves pre-training efficiency. In particular, when pre-training the 1010B Base model from scratch, LAEP achieves a 48.3\\% improvement in training efficiency alongside a 33.3% parameter reduction, while still delivering excellent performance across multiple domains."}
{"id": "2601.14984", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14984", "abs": "https://arxiv.org/abs/2601.14984", "authors": ["Jingwei Dong", "André M. H. Teixeira"], "title": "Stealthy bias injection attack detection based on Kullback-Leibler divergence in stochastic linear systems", "comment": "26 pages, 10 figures", "summary": "This paper studies the design of detection observers against stealthy bias injection attacks in stochastic linear systems under Gaussian noise, considering adversaries that exploit noise and inject crafted bias signals into a subset of sensors in a slow and coordinated manner, thereby achieving malicious objectives while remaining stealthy. To address such attacks, we formulate the observer design as a max-min optimization problem to enhance the detectability of worst-case BIAs, which attain a prescribed attack impact with the least detectability evaluated via Kullback-Leibler divergence. To reduce the computational complexity of the derived non-convex design problem, we consider the detectability of worst-case BIAs at three specific time instants: attack onset, one step after attack occurrence, and the steady state. We prove that the Kalman filter is optimal for maximizing the BIA detectability at the attack onset, regardless of the subset of attacked sensors. For the one-step and steady-state cases, the observer design problems are approximated by bi-convex optimization problems, which can be efficiently solved using alternating optimization and alternating direction method of multipliers. Moreover, more tractable linear matrix inequality relaxations are developed. Finally, the effectiveness of the proposed stealth-aware detection framework is demonstrated through an application to a thermal system."}
{"id": "2601.14427", "categories": ["cs.CR", "cs.LO", "cs.SE"], "pdf": "https://arxiv.org/pdf/2601.14427", "abs": "https://arxiv.org/abs/2601.14427", "authors": ["Murilo de Souza Neves", "Adilson Luiz Bonifacio"], "title": "Uma Prova de Conceito para a Verificação Formal de Contratos Inteligentes", "comment": "19 pages, 2 figures, 1 table, 2 code listings. Paper in Portuguese", "summary": "Smart contracts are tools with self-execution capabilities that provide enhanced security compared to traditional contracts; however, their immutability makes post-deployment fault correction extremely complex, highlighting the need for a verification layer prior to this stage. Although formalisms such as Contract Language (CL) enable logical analyses, they prove limited in attributing responsibilities within complex multilateral scenarios. This work presents a proof of concept using the Relativized Contract Language (RCL) and the RECALL tool for the specification and verification of a purchase and sale contract involving multiple agents. The study demonstrates the tool's capability to detect normative conflicts during the modeling phase. After correcting logical inconsistencies, the contract was translated into Solidity and functionally validated within the Remix IDE environment, confirming that prior formal verification is fundamental to ensuring the reliability and security of the final code."}
{"id": "2601.15099", "categories": ["eess.SY", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.15099", "abs": "https://arxiv.org/abs/2601.15099", "authors": ["A. Vaca", "J. Gutierrez Florensa", "F. Milano"], "title": "Instantaneous Frequency in Power Systems using the Teager-Kaiser Energy Operator", "comment": null, "summary": "This paper develops an instantaneous-frequency (IF) local estimator calculated with the complex Teager-Kaiser energy operator (CTKEO) and the dynamic-signal identity. The contribution is a novel IF expression that makes the envelope-curvature terms explicit, thus correcting the bias that affects conventional estimators used in power systems. The estimator aligns with complex-frequency (CF) kinematics and admits a geometric interpretation (curvature/torsion) without phase unwrapping. Simulations and data-driven examples demonstrate the accuracy of the proposed approach."}
{"id": "2601.15166", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.15166", "abs": "https://arxiv.org/abs/2601.15166", "authors": ["Ashok S Kumar", "Shashank Shekhar", "Gokularam Muthukrishnan", "Muralikrishnan Srinivasan", "Sheetal Kalyani"], "title": "Integrating OTFS in Airplane-Aided Next-Generation Networking", "comment": null, "summary": "Next-generation networks explore the opportunistic assistance of airliner/high-altitude platforms (HAPs) in delivering high data rates for terrestrial networks to ensure consistent and reliable communication. When an airliner/HAP moves at very high speeds, its mobility has a substantial impact on ensuring seamless connectivity, stable signal strength, and reliable data transmission. Orthogonal time frequency space (OTFS) modulation has been shown to provide notable improvement in performance when handling Doppler effects during high-mobility situations. This paper presents an OTFS-based airplane-aided next-generation networking system. In the proposed system, the airliner/HAPs are equipped with a planar antenna array that applies null steering beamforming (NSB) at the transmitter for communication with terrestrial users. A comprehensive performance comparison between OTFS and orthogonal frequency division multiplexing (OFDM) is performed under varying airliner altitude, velocity, array dimension, and Rician factor conditions. The simulation results show that OTFS consistently outperforms OFDM, achieving a lower bit error rate (BER) and more stable performance across different airliner altitudes, velocities, array dimensions, and propagation environments."}
{"id": "2601.14333", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14333", "abs": "https://arxiv.org/abs/2601.14333", "authors": ["Anupam Agrawal", "Rajesh Mohanty", "Shamik Bhattacharjee", "Abhimanyu Mittal"], "title": "Hierarchical Contextual Uplift Bandits for Catalog Personalization", "comment": null, "summary": "Contextual Bandit (CB) algorithms are widely adopted for personalized recommendations but often struggle in dynamic environments typical of fantasy sports, where rapid changes in user behavior and dramatic shifts in reward distributions due to external influences necessitate frequent retraining. To address these challenges, we propose a Hierarchical Contextual Uplift Bandit framework. Our framework dynamically adjusts contextual granularity from broad, system-wide insights to detailed, user-specific contexts, using contextual similarity to facilitate effective policy transfer and mitigate cold-start issues. Additionally, we integrate uplift modeling principles into our approach. Results from large-scale A/B testing on the Dream11 fantasy sports platform show that our method significantly enhances recommendation quality, achieving a 0.4% revenue improvement while also improving user satisfaction metrics compared to the current production system. We subsequently deployed this system to production as the default catalog personalization system in May 2025 and observed a further 0.5% revenue improvement."}
{"id": "2601.15040", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.15040", "abs": "https://arxiv.org/abs/2601.15040", "authors": ["Maiken Borud Omtveit", "Qian Long", "Valentin Chabaud", "Marte Ruud-Olsen", "Steinar Halsne", "Tor-Christian Ystgaard"], "title": "Electrical Design of a Clean Offshore Heat and Power (CleanOFF) Hub", "comment": null, "summary": "This paper presents an innovative offshore solution where oil & gas platform clusters are powered by a wind farm and a hydrogen hub. The results show a feasible off-grid design as an alternative to conventional electrification solutions. To address the challenges of design and operation of such a system, a power system model of the equipment and control was developed in a power system simulator called Process Power Simulator (PPSim). Power fluctuations in the wind farm are modelled using a state-of-the-art method encompassing turbulence and wakes. Various operation scenarios were used to evaluate the system design and find the right equipment size. An expensive component to over dimension is the battery energy storage system (BESS). The BESS power rating and energy capacity were found by running a combination of scenarios with extreme and natural wind variations, and contingencies. The control strategy and ramp rates of electrolyzers have significant impact on both system performance and design. A ramp rate in the order of seconds as opposed to minutes will decrease the required BESS size by 60-70%. Choosing synchronized control of the electrolyzers can further reduce the BESS size by 15-20%. The simulations also revealed challenges to achieve self-sufficiency of hydrogen and potential design improvements are suggested."}
{"id": "2601.14503", "categories": ["cs.CR", "cs.CY", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.14503", "abs": "https://arxiv.org/abs/2601.14503", "authors": ["Wouter Termont", "Beatriz Esteves"], "title": "European digital identity: A missed opportunity?", "comment": "41 pages, 0 figures, uses orcidlink.sty", "summary": "Recent European efforts around digital identity -- the EUDI regulation and its OpenID architecture -- aim high, but start from a narrow and ill-defined conceptualization of authentication. Based on a broader, more grounded understanding of the term, in we identify several issues in the design of OpenID4VCI and OpenID4VP: insecure practices, static, and subject-bound credential types, and a limited query language restrict their application to classic scenarios of credential exchange -- already supported by existing solutions like OpenID Connect, SIOPv2, OIDC4IDA, and OIDC Claims Aggregation -- barring dynamic, asynchronous, or automated use cases. We also debunk OpenID's 'paradigm-shifting' trust-model, which -- when compared to existing decentralized alternatives -- does not deliver any significant increase in control, privacy, and portability of personal information. Not only the technical choices limit the capabilities of the EUDI framework; also the legislation itself cannot accommodate the promise of self-sovereign identity. In particular, we criticize the introduction of institutionalized trusted lists, and discuss their economical and political risks. Their potential to decline into an exclusory, re-centralized ecosystem endangers the vision of a user-oriented identity management in which individuals are in charge. Instead, the consequences might severely restrict people in what they can do with their personal information, and risk increased linkability and monitoring. In anticipation of revisions to the EUDI regulations, we suggest several technical alternatives that overcome some of the issues with the architecture of OpenID. In particular, OAuth's UMA extension and its A4DS profile, as well as their integration in GNAP, are worth looking into. Future research into uniform query (meta-)languages is needed to address the heterogeneity of attestations and providers."}
{"id": "2506.22796", "categories": ["eess.SP", "cs.IT"], "pdf": "https://arxiv.org/pdf/2506.22796", "abs": "https://arxiv.org/abs/2506.22796", "authors": ["Ruolin Du", "Zhiqiang Wei", "Zai Yang", "Lei Yang", "Yong Zeng", "Derrick Wing Kwan Ng", "Jinhong Yuan"], "title": "Channel Knowledge Map-assisted Dual-domain Tracking and Predictive Beamforming for High-Mobility Wireless Networks", "comment": null, "summary": "This paper introduces a novel channel knowledge map (CKM)-assisted dual-domain tracking and predictive beamforming scheme for high-mobility wireless networks. The central premise is that the CKM integrates both the coordinate and beam domains, thereby enabling tracking in one domain via treating the other domain's input as priors or measurements. In the coordinate domain (C-Domain), an extended Kalman filter (EKF) is employed to predict and track the state (i.e., location and velocity) of a moving communication receiver across time slots under both line-of-sight (LoS)-present and LoS-absent conditions, where the CKM provides a prior mapping from multipath channel parameters to potential target locations. In the beam domain (B-Domain), the updated location of the receiver is fed back to CKM to offer a priori information of angle of arrival (AoA) variations, which are incorporated to establish beam transition models for effective beam tracking, depending on the angular variation situation of each path. Then, we analyze the Cramér-Rao Bound (CRB) for AoA estimation for each path in the considered system and propose a jointly predictive beamforming and power allocation design to minimize AoA estimation errors, directly enhancing multipath beam tracking accuracy and indirectly improving target tracking performance. Simulation results demonstrate that the proposed scheme achieves significant improvements in both target and beam tracking performance compared to the state-of-the-art approaches, particularly in AoA tracking of non-line-of-sight (NLoS) paths, highlighting the potential gain of CKM in facilitating both target and beam tracking in high-mobility communications."}
{"id": "2601.14336", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14336", "abs": "https://arxiv.org/abs/2601.14336", "authors": ["Krishna Sharma", "Vivek Yelleti"], "title": "Log anomaly detection via Meta Learning and Prototypical Networks for Cross domain generalization", "comment": null, "summary": "Log anomaly detection is essential for system reliability, but it is extremely challenging to do considering it involves class imbalance. Additionally, the models trained in one domain are not applicable to other domains, necessitating the need for cross-domain adaptation (such as HDFS and Linux). Traditional detection models often fail to generalize due to significant data drift and the inherent absence of labeled anomalies in new target domains. To handle the above challenges, we proposed a new end-to-end framework based on a meta-learning approach. Our methodology first gets the data ready by combining a Drain3 log parsing mechanism with a dynamic drift-based labeling technique that uses semantic and fuzzy matching to move existing anomaly knowledge from one source to another. BERT-based semantic embeddings are obtained, and the feature selection is invoked to reduce the dimensionality. Later, Model Agnostic Meta-Learning (MAML) and Prototypical Networks models are trained to adapt quickly and effectively. The SMOTE oversampling method is employed to handle imbalances in the data. All the results are obtained by employing the leave-one-out source method, and the corresponding mean F1 scores are reported. Our empirical findings validate that the proposed meta-learning-driven approach yielded the highest mean F1 score and proved to be effective for cross-domain settings."}
{"id": "2601.15099", "categories": ["eess.SY", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.15099", "abs": "https://arxiv.org/abs/2601.15099", "authors": ["A. Vaca", "J. Gutierrez Florensa", "F. Milano"], "title": "Instantaneous Frequency in Power Systems using the Teager-Kaiser Energy Operator", "comment": null, "summary": "This paper develops an instantaneous-frequency (IF) local estimator calculated with the complex Teager-Kaiser energy operator (CTKEO) and the dynamic-signal identity. The contribution is a novel IF expression that makes the envelope-curvature terms explicit, thus correcting the bias that affects conventional estimators used in power systems. The estimator aligns with complex-frequency (CF) kinematics and admits a geometric interpretation (curvature/torsion) without phase unwrapping. Simulations and data-driven examples demonstrate the accuracy of the proposed approach."}
{"id": "2601.14505", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14505", "abs": "https://arxiv.org/abs/2601.14505", "authors": ["Mohammad Shamim Ahsan", "Peng Liu"], "title": "Uncovering and Understanding FPR Manipulation Attack in Industrial IoT Networks", "comment": null, "summary": "In the network security domain, due to practical issues -- including imbalanced data and heterogeneous legitimate network traffic -- adversarial attacks in machine learning-based NIDSs have been viewed as attack packets misclassified as benign. Due to this prevailing belief, the possibility of (maliciously) perturbed benign packets being misclassified as attack has been largely ignored. In this paper, we demonstrate that this is not only theoretically possible, but also a particular threat to NIDS. In particular, we uncover a practical cyberattack, FPR manipulation attack (FPA), especially targeting industrial IoT networks, where domain-specific knowledge of the widely used MQTT protocol is exploited and a systematic simple packet-level perturbation is performed to alter the labels of benign traffic samples without employing traditional gradient-based or non-gradient-based methods. The experimental evaluations demonstrate that this novel attack results in a success rate of 80.19% to 100%. In addition, while estimating impacts in the Security Operations Center, we observe that even a small fraction of false positive alerts, irrespective of different budget constraints and alert traffic intensities, can increase the delay of genuine alerts investigations up to 2 hr in a single day under normal operating conditions. Furthermore, a series of relevant statistical and XAI analyses is conducted to understand the key factors behind this remarkable success. Finally, we explore the effectiveness of the FPA packets to enhance models' robustness through adversarial training and investigate the changes in decision boundaries accordingly."}
{"id": "2601.14346", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14346", "abs": "https://arxiv.org/abs/2601.14346", "authors": ["Yewon Han", "Sunghyun Kim", "Eunyi Jeong", "Sungkyung Lee", "Seokwoo Yun", "Sangsoo Lim"], "title": "DiSPA: Differential Substructure-Pathway Attention for Drug Response Prediction", "comment": null, "summary": "Accurate prediction of drug response in precision medicine requires models that capture how specific chemical substructures interact with cellular pathway states. However, most existing deep learning approaches treat chemical and transcriptomic modalities independently or combine them only at late stages, limiting their ability to model fine-grained, context-dependent mechanisms of drug action. In addition, standard attention mechanisms are often sensitive to noise and sparsity in high-dimensional biological networks, hindering both generalization and interpretability. We present DiSPA, a representation learning framework that explicitly disentangles structure-driven and context-driven mechanisms of drug response through bidirectional conditioning between chemical substructures and pathway-level gene expression. DiSPA introduces a differential cross-attention module that suppresses spurious pathway-substructure associations while amplifying contextually relevant interactions. Across multiple evaluation settings on the GDSC benchmark, DiSPA achieves state-of-the-art performance, with particularly strong improvements in the disjoint-set setting, which assesses generalization to unseen drug-cell combinations. Beyond predictive accuracy, DiSPA yields mechanistically informative representations: learned attention patterns recover known pharmacophores, distinguish structure-driven from context-dependent compounds, and exhibit coherent organization across biological pathways. Furthermore, we demonstrate that DiSPA trained solely on bulk RNA-seq data enables zero-shot transfer to spatial transcriptomics, revealing region-specific drug sensitivity patterns without retraining. Together, these results establish DiSPA as a robust and interpretable framework for integrative pharmacogenomic modeling, enabling principled analysis of drug response mechanisms beyond post hoc interpretation."}
{"id": "2601.15135", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.15135", "abs": "https://arxiv.org/abs/2601.15135", "authors": ["Natanon Tongamrak", "Kannapha Amaruchkul", "Wijarn Wangdee", "Jitkomut Songsiri"], "title": "Stochastic EMS for Optimal 24/7 Carbon-Free Energy Operations", "comment": "23 pages", "summary": "This paper proposes a two-stage stochastic optimization formulation to determine optimal operation and procurement plans for achieving a 24/7 carbon-free energy (CFE) compliance at minimized cost. The system in consideration follows primary energy technologies in Thailand including solar power, battery storage, and a diverse portfolio of renewable and carbon-based energy procurement sources. Unlike existing literature focused on long-term planning, this study addresses near real-time operations using a 15-minute resolution. A novel feature of the formulation is the explicit treatment of CFE compliance as a model parameter, enabling flexible targets such as a minimum percentage of hourly matching or a required number of carbon-free days within a multi-day horizon. The mixed-integer linear programming formulation accounts for uncertainties in load and solar generation by integrating deep learning-based forecasting within a receding horizon framework. By optimizing battery profiles and multi-source procurement simultaneously, the proposed system provides a feasible pathway for transitioning to carbon-free operations in emerging energy markets."}
{"id": "2601.14511", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14511", "abs": "https://arxiv.org/abs/2601.14511", "authors": ["Griffin Higgins", "Roozbeh Razavi-Far", "Hossein Shokouhinejad", "Ali A. Ghorbani"], "title": "Towards Transparent Malware Detection With Granular Explainability: Backtracking Meta-Coarsened Explanations Onto Assembly Flow Graphs With Graph Neural Networks", "comment": null, "summary": "As malware continues to become increasingly sophisticated, threatening, and evasive, malware detection systems must keep pace and become equally intelligent, powerful, and transparent. In this paper, we propose Assembly Flow Graph (AFG) to comprehensively represent the assembly flow of a binary executable as graph data. Importantly, AFG can be used to extract granular explanations needed to increase transparency for malware detection using Graph Neural Networks (GNNs). However, since AFGs may be large in practice, we also propose a Meta-Coarsening approach to improve computational tractability via graph reduction. To evaluate our proposed approach we consider several novel and existing metrics to quantify the granularity and quality of explanations. Lastly, we also consider several hyperparameters in our proposed Meta-Coarsening approach that can be used to control the final explanation size. We evaluate our proposed approach using the CIC-DGG-2025 dataset. Our results indicate that our proposed AFG and Meta-Coarsening approach can provide both increased explainability and inference performance at certain coarsening levels. However, most importantly, to the best of our knowledge, we are the first to consider granular explainability in malware detection using GNNs."}
{"id": "2601.14354", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14354", "abs": "https://arxiv.org/abs/2601.14354", "authors": ["Yongchao Huang"], "title": "VJEPA: Variational Joint Embedding Predictive Architectures as Probabilistic World Models", "comment": "77 pages", "summary": "Joint Embedding Predictive Architectures (JEPA) offer a scalable paradigm for self-supervised learning by predicting latent representations rather than reconstructing high-entropy observations. However, existing formulations rely on \\textit{deterministic} regression objectives, which mask probabilistic semantics and limit its applicability in stochastic control. In this work, we introduce \\emph{Variational JEPA (VJEPA)}, a \\textit{probabilistic} generalization that learns a predictive distribution over future latent states via a variational objective. We show that VJEPA unifies representation learning with Predictive State Representations (PSRs) and Bayesian filtering, establishing that sequential modeling does not require autoregressive observation likelihoods. Theoretically, we prove that VJEPA representations can serve as sufficient information states for optimal control without pixel reconstruction, while providing formal guarantees for collapse avoidance. We further propose \\emph{Bayesian JEPA (BJEPA)}, an extension that factorizes the predictive belief into a learned dynamics expert and a modular prior expert, enabling zero-shot task transfer and constraint (e.g. goal, physics) satisfaction via a Product of Experts. Empirically, through a noisy environment experiment, we demonstrate that VJEPA and BJEPA successfully filter out high-variance nuisance distractors that cause representation collapse in generative baselines. By enabling principled uncertainty estimation (e.g. constructing credible intervals via sampling) while remaining likelihood-free regarding observations, VJEPA provides a foundational framework for scalable, robust, uncertainty-aware planning in high-dimensional, noisy environments."}
{"id": "2601.15196", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.15196", "abs": "https://arxiv.org/abs/2601.15196", "authors": ["Jianye Xu", "Bassam Alrifaee"], "title": "TTCBF: A Truncated Taylor Control Barrier Function for High-Order Safety Constraints", "comment": null, "summary": "Control Barrier Functions (CBFs) enforce safety by rendering a prescribed safe set forward invariant. However, standard CBFs are limited to safety constraints with relative degree one, while High-Order CBF (HOCBF) methods address higher relative degree at the cost of introducing a chain of auxiliary functions and multiple class K functions whose tuning scales with the relative degree. In this paper, we introduce a Truncated Taylor Control Barrier Function (TTCBF), which generalizes standard discrete-time CBFs to consider high-order safety constraints and requires only one class K function, independent of the relative degree. We also propose an adaptive variant, adaptive TTCBF (aTTCBF), that optimizes an online gain on the class K function to improve adaptability, while requiring fewer control design parameters than existing adaptive HOCBF variants. Numerical experiments in a relative-degree-six spring-mass system and a cluttered corridor navigation validate the above theoretical findings."}
{"id": "2601.14528", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14528", "abs": "https://arxiv.org/abs/2601.14528", "authors": ["Luis Lazo", "Hamed Jelodar", "Roozbeh Razavi-Far"], "title": "LLM Security and Safety: Insights from Homotopy-Inspired Prompt Obfuscation", "comment": null, "summary": "In this study, we propose a homotopy-inspired prompt obfuscation framework to enhance understanding of security and safety vulnerabilities in Large Language Models (LLMs). By systematically applying carefully engineered prompts, we demonstrate how latent model behaviors can be influenced in unexpected ways. Our experiments encompassed 15,732 prompts, including 10,000 high-priority cases, across LLama, Deepseek, KIMI for code generation, and Claude to verify. The results reveal critical insights into current LLM safeguards, highlighting the need for more robust defense mechanisms, reliable detection strategies, and improved resilience. Importantly, this work provides a principled framework for analyzing and mitigating potential weaknesses, with the goal of advancing safe, responsible, and trustworthy AI technologies."}
{"id": "2601.14473", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14473", "abs": "https://arxiv.org/abs/2601.14473", "authors": ["Danny Butvinik", "Nana Boateng", "Achi Hackmon"], "title": "Adaptive KDE for Real-Time Thresholding: Prioritized Queues for Financial Crime Investigation", "comment": null, "summary": "We study the problem of converting a stream of risk scores into one or more review queues under explicit intake constraints[cite: 6]. Instead of top-$K$ or manually tuned cutoffs, we fit an online adaptive kernel density to the score stream, transform the density into a tail-mass curve to meet capacity, and ``snap'' the resulting cut to a persistent density valley detected across bandwidths[cite: 7]. The procedure is label-free, supports multi-queue routing, and operates in real time with sliding windows or exponential forgetting[cite: 8]. On synthetic, drifting, multimodal streams, the method achieves competitive capacity adherence while reducing threshold jitter[cite: 9]. Updates cost $O(G)$ per event with constant memory per activity"}
{"id": "2601.14343", "categories": ["cs.CR", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.14343", "abs": "https://arxiv.org/abs/2601.14343", "authors": ["William Pan", "Guiran Liu", "Binrong Zhu", "Qun Wang", "Yingzhou Lu", "Beiyu Lin", "Rose Qingyang Hu"], "title": "Rethinking On-Device LLM Reasoning: Why Analogical Mapping Outperforms Abstract Thinking for IoT DDoS Detection", "comment": null, "summary": "The rapid expansion of IoT deployments has intensified cybersecurity threats, notably Distributed Denial of Service (DDoS) attacks, characterized by increasingly sophisticated patterns. Leveraging Generative AI through On-Device Large Language Models (ODLLMs) provides a viable solution for real-time threat detection at the network edge, though limited computational resources present challenges for smaller ODLLMs. This paper introduces a novel detection framework that integrates Chain-of-Thought (CoT) reasoning with Retrieval-Augmented Generation (RAG), tailored specifically for IoT edge environments. We systematically evaluate compact ODLLMs, including LLaMA 3.2 (1B, 3B) and Gemma 3 (1B, 4B), using structured prompting and exemplar-driven reasoning strategies. Experimental results demonstrate substantial performance improvements with few-shot prompting, achieving macro-average F1 scores as high as 0.85. Our findings highlight the significant advantages of incorporating exemplar-based reasoning, underscoring that CoT and RAG approaches markedly enhance small ODLLMs' capabilities in accurately classifying complex network attacks under stringent resource constraints."}
{"id": "2601.14544", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14544", "abs": "https://arxiv.org/abs/2601.14544", "authors": ["Sneha Sudhakaran", "Naresh Kshetri"], "title": "AI Agents vs. Human Investigators: Balancing Automation, Security, and Expertise in Cyber Forensic Analysis", "comment": "10 pages, 1 figure", "summary": "In an era where cyber threats are rapidly evolving, the reliability of cyber forensic analysis has become increasingly critical for effective digital investigations and cybersecurity responses. AI agents are being adopted across digital forensic practices due to their ability to automate processes such as anomaly detection, evidence classification, and behavioral pattern recognition, significantly enhancing scalability and reducing investigation timelines. However, the characteristics that make AI indispensable also introduce notable risks. AI systems, often trained on biased or incomplete datasets, can produce misleading results, including false positives and false negatives, thereby jeopardizing the integrity of forensic investigations. This study presents a meticulous comparative analysis of the effectiveness of the most used AI agent, ChatGPT, and human forensic investigators in the realm of cyber forensic analysis. Our research reveals critical limitations within AI-driven approaches, demonstrating scenarios in which sophisticated or novel cyber threats remain undetected due to the rigid pattern-based nature of AI systems. Conversely, our analysis highlights the crucial role that human forensic investigators play in mitigating these risks. Through adaptive decision-making, ethical reasoning, and contextual understanding, human investigators effectively identify subtle anomalies and threats that may evade automated detection systems. To reinforce our findings, we conducted comprehensive reliability testing of forensic techniques using multiple cyber threat scenarios. These tests confirmed that while AI agents significantly improve the efficiency of routine analyses, human oversight remains crucial in ensuring accuracy and comprehensiveness of the results."}
{"id": "2601.14476", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14476", "abs": "https://arxiv.org/abs/2601.14476", "authors": ["Naoya Onizawa", "Takahiro Hanyu"], "title": "GPU-accelerated simulated annealing based on p-bits with real-world device-variability modeling", "comment": "14 pages", "summary": "Probabilistic computing using probabilistic bits (p-bits) presents an efficient alternative to traditional CMOS logic for complex problem-solving, including simulated annealing and machine learning. Realizing p-bits with emerging devices such as magnetic tunnel junctions (MTJs) introduces device variability, which was expected to negatively impact computational performance. However, this study reveals an unexpected finding: device variability can not only degrade but also enhance algorithm performance, particularly by leveraging timing variability. This paper introduces a GPU-accelerated, open-source simulated annealing framework based on p-bits that models key device variability factors -timing, intensity, and offset- to reflect real-world device behavior. Through CUDA-based simulations, our approach achieves a two-order magnitude speedup over CPU implementations on the MAX-CUT benchmark with problem sizes ranging from 800 to 20,000 nodes. By providing a scalable and accessible tool, this framework aims to advance research in probabilistic computing, enabling optimization applications in diverse fields."}
{"id": "2601.14555", "categories": ["cs.CR", "cs.OS"], "pdf": "https://arxiv.org/pdf/2601.14555", "abs": "https://arxiv.org/abs/2601.14555", "authors": ["Botong Ou", "Baijian Yang"], "title": "WebAssembly Based Portable and Secure Sensor Interface for Internet of Things", "comment": null, "summary": "As the expansion of IoT connectivity continues to provide quality- of-life improvements around the world, they simultaneously intro- duce increasing privacy and security concerns. The lack of a clear definition in managing shared and protected access to IoT sensors offer channels by which devices can be compromised and sensitive data can be leaked. In recent years, WebAssembly has received con- siderable attention for its efficient application sandboxing suitable for embedded systems, making it a prime candidate for exploring a secure and portable sensor interface. This paper introduces the first WebAssembly System Interface (WASI) extension offering a secure, portable, and low-footprint sandbox enabling multi-tenant access to sensor data across het- erogeneous embedded devices. The runtime extensions provide application memory isolation, ensure appropriate resource privi- leges by intercepting sensor access, and offer an MQTT-SN interface enabling in-network access control. When targeting the WebAssem- bly byte-code with the associated runtime extensions implemented atop the Zephyr RTOS, our evaluation of sensor access indicates a latency overhead of 6% with an additional memory footprint of 5% when compared to native execution. As MQTT-SN requests are dominated by network delays, the WASI-SN implementation of MQTT-SN introduces less than 1% additional latency with similar memory footprint."}
{"id": "2601.14487", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14487", "abs": "https://arxiv.org/abs/2601.14487", "authors": ["Mrigank Dhingra", "Omer San"], "title": "Stabilizing autoregressive forecasts in chaotic systems via multi-rate latent recurrence", "comment": null, "summary": "Long-horizon autoregressive forecasting of chaotic dynamical systems remains challenging due to rapid error amplification and distribution shift: small one-step inaccuracies compound into physically inconsistent rollouts and collapse of large-scale statistics. We introduce MSR-HINE, a hierarchical implicit forecaster that augments multiscale latent priors with multi-rate recurrent modules operating at distinct temporal scales. At each step, coarse-to-fine recurrent states generate latent priors, an implicit one-step predictor refines the state with multiscale latent injections, and a gated fusion with posterior latents enforces scale-consistent updates; a lightweight hidden-state correction further aligns recurrent memories with fused latents. The resulting architecture maintains long-term context on slow manifolds while preserving fast-scale variability, mitigating error accumulation in chaotic rollouts. Across two canonical benchmarks, MSR-HINE yields substantial gains over a U-Net autoregressive baseline: on Kuramoto-Sivashinsky it reduces end-horizon RMSE by 62.8% at H=400 and improves end-horizon ACC by +0.983 (from -0.155 to 0.828), extending the ACC >= 0.5 predictability horizon from 241 to 400 steps; on Lorenz-96 it reduces RMSE by 27.0% at H=100 and improves end horizon ACC by +0.402 (from 0.144 to 0.545), extending the ACC >= 0.5 horizon from 58 to 100 steps."}
{"id": "2601.14582", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14582", "abs": "https://arxiv.org/abs/2601.14582", "authors": ["Ka Lok Wu", "Christa Jenkins", "Scott D. Stolle", "Omar Chowdhury"], "title": "Automatically Tightening Access Control Policies with Restricter", "comment": "19 pages, 5 figures, accepted at the 32nd International Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS'26)", "summary": "Robust access control is a cornerstone of secure software, systems, and networks. An access control mechanism is as effective as the policy it enforces. However, authoring effective policies that satisfy desired properties such as the principle of least privilege is a challenging task even for experienced administrators, as evidenced by many real instances of policy misconfiguration. In this paper, we set out to address this pain point by proposing Restricter, which automatically tightens each (permit) policy rule of a policy with respect to an access log, which captures some already exercised access requests and their corresponding access decisions (i.e., allow or deny). Restricter achieves policy tightening by reducing the number of access requests permitted by a policy rule without sacrificing the functionality of the underlying system it is regulating. We implement Restricter for Amazon's Cedar policy language and demonstrate its effectiveness through two realistic case studies."}
{"id": "2601.14517", "categories": ["cs.LG", "math.AP"], "pdf": "https://arxiv.org/pdf/2601.14517", "abs": "https://arxiv.org/abs/2601.14517", "authors": ["Yilong Dai", "Shengyu Chen", "Ziyi Wang", "Xiaowei Jia", "Yiqun Xie", "Vipin Kumar", "Runlong Yu"], "title": "Learning PDE Solvers with Physics and Data: A Unifying View of Physics-Informed Neural Networks and Neural Operators", "comment": null, "summary": "Partial differential equations (PDEs) are central to scientific modeling. Modern workflows increasingly rely on learning-based components to support model reuse, inference, and integration across large computational processes. Despite the emergence of various physics-aware data-driven approaches, the field still lacks a unified perspective to uncover their relationships, limitations, and appropriate roles in scientific workflows. To this end, we propose a unifying perspective to place two dominant paradigms: Physics-Informed Neural Networks (PINNs) and Neural Operators (NOs), within a shared design space. We organize existing methods from three fundamental dimensions: what is learned, how physical structures are integrated into the learning process, and how the computational load is amortized across problem instances. In this way, many challenges can be best understood as consequences of these structural properties of learning PDEs. By analyzing advances through this unifying view, our survey aims to facilitate the development of reliable learning-based PDE solvers and catalyze a synthesis of physics and data."}
{"id": "2601.14595", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14595", "abs": "https://arxiv.org/abs/2601.14595", "authors": ["Qiyue Mei", "Michael Fu"], "title": "IntelliSA: An Intelligent Static Analyzer for IaC Security Smell Detection Using Symbolic Rules and Neural Inference", "comment": "Accepted at MSR 2026", "summary": "Infrastructure as Code (IaC) enables automated provisioning of large-scale cloud and on-premise environments, reducing the need for repetitive manual setup. However, this automation is a double-edged sword: a single misconfiguration in IaC scripts can propagate widely, leading to severe system downtime and security risks. Prior studies have shown that IaC scripts often contain security smells--bad coding patterns that may introduce vulnerabilities--and have proposed static analyzers based on symbolic rules to detect them. Yet, our preliminary analysis reveals that rule-based detection alone tends to over-approximate, producing excessive false positives and increasing the burden of manual inspection. In this paper, we present IntelliSA, an intelligent static analyzer for IaC security smell detection that integrates symbolic rules with neural inference. IntelliSA applies symbolic rules to over-approximate potential smells for broad coverage, then employs neural inference to filter false positives. While an LLM can effectively perform this filtering, reliance on LLM APIs introduces high cost and latency, raises data governance concerns, and limits reproducibility and offline deployment. To address the challenges, we adopt a knowledge distillation approach: an LLM teacher generates pseudo-labels to train a compact student model--over 500x smaller--that learns from the teacher's knowledge and efficiently classifies false positives. We evaluate IntelliSA against two static analyzers and three LLM baselines (Claude-4, Grok-4, and GPT-5) using a human-labeled dataset including 241 security smells across 11,814 lines of real-world IaC code. Experimental results show that IntelliSA achieves the highest F1 score (83%), outperforming baselines by 7-42%. Moreover, IntelliSA demonstrates the best cost-effectiveness, detecting 60% of security smells while inspecting less than 2% of the codebase."}
{"id": "2601.14519", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14519", "abs": "https://arxiv.org/abs/2601.14519", "authors": ["Giulio Rossolini"], "title": "How Worst-Case Are Adversarial Attacks? Linking Adversarial and Statistical Robustness", "comment": null, "summary": "Adversarial attacks are widely used to evaluate model robustness, yet their validity as proxies for robustness to random perturbations remains debated. We ask whether an adversarial perturbation provides a representative estimate of robustness under random noise of the same magnitude, or instead reflects an atypical worst-case event. To this end, we introduce a probabilistic metric that quantifies noisy risk with respect to directionally biased perturbation distributions, parameterized by a concentration factor $κ$ that interpolates between isotropic noise and adversarial direction. Using this framework, we study the limits of adversarial perturbations as estimators of noisy risk by proposing an attack strategy designed to operate in regimes statistically closer to uniform noise. Experiments on ImageNet and CIFAR-10 systematically benchmark widely used attacks, highlighting when adversarial success meaningfully reflects noisy risk and when it fails, thereby informing their use in safety-oriented evaluation."}
{"id": "2601.14601", "categories": ["cs.CR", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.14601", "abs": "https://arxiv.org/abs/2601.14601", "authors": ["Haodong Chen", "Ziheng Zhang", "Jinghui Jiang", "Qiang Su", "Qiao Xiang"], "title": "Holmes: An Evidence-Grounded LLM Agent for Auditable DDoS Investigation in Cloud Networks", "comment": null, "summary": "Cloud environments face frequent DDoS threats due to centralized resources and broad attack surfaces. Modern cloud-native DDoS attacks further evolve rapidly and often blend multi-vector strategies, creating an operational dilemma: defenders need wire-speed monitoring while also requiring explainable, auditable attribution for response. Existing rule-based and supervised-learning approaches typically output black-box scores or labels, provide limited evidence chains, and generalize poorly to unseen attack variants; meanwhile, high-quality labeled data is often difficult to obtain in cloud settings.\n  We present Holmes (DDoS Detective), an LLM-based DDoS detection agent that reframes the model as a virtual SRE investigator rather than an end-to-end classifier. Holmes couples a funnel-like hierarchical workflow (counters/sFlow for continuous sensing and triage; PCAP evidence collection triggered only on anomaly windows) with an Evidence Pack abstraction that converts binary packets into compact, reproducible, high-signal structured evidence. On top of this evidence interface, Holmes enforces a structure-first investigation protocol and strict JSON/quotation constraints to produce machine-consumable reports with auditable evidence anchors.\n  We evaluate Holmes on CICDDoS2019 reflection/amplification attacks and script-triggered flooding scenarios. Results show that Holmes produces attribution decisions grounded in salient evidence anchors across diverse attack families, and when errors occur, its audit logs make the failure source easy to localize, demonstrating the practicality of an LLM agent for cost-controlled and traceable DDoS investigation in cloud operations."}
{"id": "2601.14522", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14522", "abs": "https://arxiv.org/abs/2601.14522", "authors": ["Hunjae Lee", "Corey Clark"], "title": "On the Runway Cascade of Transformers for Language Modeling", "comment": null, "summary": "In decoder-only (causal) transformers, the computation graph created by causal masking routes information through both direct-path attention and indirect paths formed by intermediate tokens. We denote these indirect paths between token pairs as their runways. We argue that certain failure modes of causal transformers as observed by a growing body of recent works are likely exacerbated by a misalignment between these two information propagation modes. We formalize runway cascade as a phenomenon whereby this misalignment results in redundancies and irrelevant information cascading to token representations despite adequately learned attention patterns. As a solution, we propose runway-aware rewiring as a more explicit way of incorporating runway context directly into each token's direct-path attention. This mechanism re-wires the attention pattern for each token based on a summary of its runway landscape, enabling awareness of accumulating representational influences and allowing for more balanced information propagation. Our proposed methodology introduces no additional parameters and can seamlessly be integrated into standard attention mechanism. Empirically, our rewired transformer results in steady improvements in general language modeling as well as noticeably stronger information retrieval and extrapolation abilities compared to standard transformers."}
{"id": "2601.14606", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14606", "abs": "https://arxiv.org/abs/2601.14606", "authors": ["Daisuke Miyamoto", "Takuji Iimura", "Narushige Michishita"], "title": "An LLM Agent-based Framework for Whaling Countermeasures", "comment": null, "summary": "With the spread of generative AI in recent years, attacks known as Whaling have become a serious threat. Whaling is a form of social engineering that targets important high-authority individuals within organizations and uses sophisticated fraudulent emails. In the context of Japanese universities, faculty members frequently hold positions that combine research leadership with authority within institutional workflows. This structural characteristic leads to the wide public disclosure of high-value information such as publications, grants, and detailed researcher profiles. Such extensive information exposure enables the construction of highly precise target profiles using generative AI. This raises concerns that Whaling attacks based on high-precision profiling by generative AI will become prevalent. In this study, we propose a Whaling countermeasure framework for university faculty members that constructs personalized defense profiles and uses large language model (LLM)-based agents. We design agents that (i) build vulnerability profiles for each target from publicly available information on faculty members, (ii) identify potential risk scenarios relevant to Whaling defense based on those profiles, (iii) construct defense profiles corresponding to the vulnerabilities and anticipated risks, and (iv) analyze Whaling emails using the defense profiles. Furthermore, we conduct a preliminary risk-assessment experiment. The results indicate that the proposed method can produce judgments accompanied by explanations of response policies that are consistent with the work context of faculty members who are Whaling targets. The findings also highlight practical challenges and considerations for future operational deployment and systematic evaluation."}
{"id": "2601.14532", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14532", "abs": "https://arxiv.org/abs/2601.14532", "authors": ["Alistair Cheong", "Haolin Cong", "Tyler Yang", "Dustin Miao"], "title": "Search over Self-Edit Strategies for LLM Adaptation", "comment": null, "summary": "Many LLM-based open-ended search systems freeze the foundation model that proposes improvements to existing solutions, which may bottleneck long-run progress. Recent work has explored updating the proposal model at test time [arXiv:2511.23473], but the update strategy is still typically hand-specified. Therefore, this study investigated whether an LLM can use task feedback to decide how it should update its weights. For tractability, we focused on the simpler case where there is only one round of self-improvement, and restricted the update operator to self-supervised next token prediction (NTP), leaving the model freedom in choosing its training data and key NTP hyperparameters. Using the Self-Adapting Language Models (SEAL) [arXiv:2506.10943] framework as a testbed, we relaxed its fixed human template constraint and allowed the model to generate its own self-edit templates, thereby giving it more control over its training data and hyperparameters. Two variants were studied, differing in whether template generation was conditioned on a lightweight archive of past templates. In SEAL's Single-Passage Knowledge Incorporation setting with Qwen3-8B on SQuAD [arXiv:1606.05250], the no-archive variant performed comparably to the weaker \"Implications\" baseline, while the archive variant outperformed \"Implications\" and approached the strongest human-designed \"Rewrite\" baseline without surpassing it. Further analysis of collapse in the model's exploration revealed that a naive archive can confer some short-term robustness but can also accelerate homogenization, suggesting that explicit novelty pressure may be required to consistently advance beyond carefully optimized human strategies. Our code is available at https://github.com/cheongalc/search-self-edit-strategies ."}
{"id": "2601.14614", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14614", "abs": "https://arxiv.org/abs/2601.14614", "authors": ["Víctor Mayoral-Vilches", "Stefan Rass", "Martin Pinzger", "Endika Gil-Uriarte", "Unai Ayucar-Carbajo", "Jon Ander Ruiz-Alcalde", "Maite del Mundo de Torres", "Luis Javier Navarrete-Lozano", "María Sanz-Gómez", "Francesco Balassone", "Cristóbal R. J. Veas-Chavez", "Vanesa Turiel", "Alfonso Glera-Picón", "Daniel Sánchez-Prieto", "Yuri Salvatierra", "Paul Zabalegui-Landa", "Ruffino Reydel Cabrera-Álvarez", "Patxi Mayoral-Pizarroso"], "title": "Towards Cybersecurity Superintelligence: from AI-guided humans to human-guided AI", "comment": null, "summary": "Cybersecurity superintelligence -- artificial intelligence exceeding the best human capability in both speed and strategic reasoning -- represents the next frontier in security. This paper documents the emergence of such capability through three major contributions that have pioneered the field of AI Security. First, PentestGPT (2023) established LLM-guided penetration testing, achieving 228.6% improvement over baseline models through an architecture that externalizes security expertise into natural language guidance. Second, Cybersecurity AI (CAI, 2025) demonstrated automated expert-level performance, operating 3,600x faster than humans while reducing costs 156-fold, validated through #1 rankings at international competitions including the $50,000 Neurogrid CTF prize. Third, Generative Cut-the-Rope (G-CTR, 2026) introduces a neurosymbolic architecture embedding game-theoretic reasoning into LLM-based agents: symbolic equilibrium computation augments neural inference, doubling success rates while reducing behavioral variance 5.2x and achieving 2:1 advantage over non-strategic AI in Attack & Defense scenarios.\n  Together, these advances establish a clear progression from AI-guided humans to human-guided game-theoretic cybersecurity superintelligence."}
{"id": "2601.14536", "categories": ["cs.LG", "q-bio.GN", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.14536", "abs": "https://arxiv.org/abs/2601.14536", "authors": ["Tiantian Yang", "Yuxuan Wang", "Zhenwei Zhou", "Ching-Ti Liu"], "title": "engGNN: A Dual-Graph Neural Network for Omics-Based Disease Classification and Feature Selection", "comment": "21 pages, 14 figures, 5 tables", "summary": "Omics data, such as transcriptomics, proteomics, and metabolomics, provide critical insights into disease mechanisms and clinical outcomes. However, their high dimensionality, small sample sizes, and intricate biological networks pose major challenges for reliable prediction and meaningful interpretation. Graph Neural Networks (GNNs) offer a promising way to integrate prior knowledge by encoding feature relationships as graphs. Yet, existing methods typically rely solely on either an externally curated feature graph or a data-driven generated one, which limits their ability to capture complementary information. To address this, we propose the external and generated Graph Neural Network (engGNN), a dual-graph framework that jointly leverages both external known biological networks and data-driven generated graphs. Specifically, engGNN constructs a biologically informed undirected feature graph from established network databases and complements it with a directed feature graph derived from tree-ensemble models. This dual-graph design produces more comprehensive embeddings, thereby improving predictive performance and interpretability. Through extensive simulations and real-world applications to gene expression data, engGNN consistently outperforms state-of-the-art baselines. Beyond classification, engGNN provides interpretable feature importance scores that facilitate biologically meaningful discoveries, such as pathway enrichment analysis. Taken together, these results highlight engGNN as a robust, flexible, and interpretable framework for disease classification and biomarker discovery in high-dimensional omics contexts."}
{"id": "2601.14660", "categories": ["cs.CR", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.14660", "abs": "https://arxiv.org/abs/2601.14660", "authors": ["Saswat Das", "Ferdinando Fioretto"], "title": "NeuroFilter: Privacy Guardrails for Conversational LLM Agents", "comment": null, "summary": "This work addresses the computational challenge of enforcing privacy for agentic Large Language Models (LLMs), where privacy is governed by the contextual integrity framework. Indeed, existing defenses rely on LLM-mediated checking stages that add substantial latency and cost, and that can be undermined in multi-turn interactions through manipulation or benign-looking conversational scaffolding. Contrasting this background, this paper makes a key observation: internal representations associated with privacy-violating intent can be separated from benign requests using linear structure. Using this insight, the paper proposes NeuroFilter, a guardrail framework that operationalizes contextual integrity by mapping norm violations to simple directions in the model's activation space, enabling detection even when semantic filters are bypassed. The proposed filter is also extended to capture threats arising during long conversations using the concept of activation velocity, which measures cumulative drift in internal representations across turns. A comprehensive evaluation across over 150,000 interactions and covering models from 7B to 70B parameters, illustrates the strong performance of NeuroFilter in detecting privacy attacks while maintaining zero false positives on benign prompts, all while reducing the computational inference cost by several orders of magnitude when compared to LLM-based agentic privacy defenses."}
{"id": "2601.14541", "categories": ["cs.LG", "cs.AI", "cs.AR"], "pdf": "https://arxiv.org/pdf/2601.14541", "abs": "https://arxiv.org/abs/2601.14541", "authors": ["Deming Chen", "Vijay Ganesh", "Weikai Li", "Yingyan", "Lin", "Yong Liu", "Subhasish Mitra", "David Z. Pan", "Ruchir Puri", "Jason Cong", "Yizhou Sun"], "title": "Report for NSF Workshop on AI for Electronic Design Automation", "comment": null, "summary": "This report distills the discussions and recommendations from the NSF Workshop on AI for Electronic Design Automation (EDA), held on December 10, 2024 in Vancouver alongside NeurIPS 2024. Bringing together experts across machine learning and EDA, the workshop examined how AI-spanning large language models (LLMs), graph neural networks (GNNs), reinforcement learning (RL), neurosymbolic methods, etc.-can facilitate EDA and shorten design turnaround. The workshop includes four themes: (1) AI for physical synthesis and design for manufacturing (DFM), discussing challenges in physical manufacturing process and potential AI applications; (2) AI for high-level and logic-level synthesis (HLS/LLS), covering pragma insertion, program transformation, RTL code generation, etc.; (3) AI toolbox for optimization and design, discussing frontier AI developments that could potentially be applied to EDA tasks; and (4) AI for test and verification, including LLM-assisted verification tools, ML-augmented SAT solving, security/reliability challenges, etc. The report recommends NSF to foster AI/EDA collaboration, invest in foundational AI for EDA, develop robust data infrastructures, promote scalable compute infrastructure, and invest in workforce development to democratize hardware design and enable next-generation hardware systems. The workshop information can be found on the website https://ai4eda-workshop.github.io/."}
{"id": "2601.14778", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14778", "abs": "https://arxiv.org/abs/2601.14778", "authors": ["Yuang Qi", "Na Zhao", "Qiyi Yao", "Benlong Wu", "Weiming Zhang", "Nenghai Yu", "Kejiang Chen"], "title": "STEAD: Robust Provably Secure Linguistic Steganography with Diffusion Language Model", "comment": "NeurIPS 2025 poster", "summary": "Recent provably secure linguistic steganography (PSLS) methods rely on mainstream autoregressive language models (ARMs) to address historically challenging tasks, that is, to disguise covert communication as ``innocuous'' natural language communication. However, due to the characteristic of sequential generation of ARMs, the stegotext generated by ARM-based PSLS methods will produce serious error propagation once it changes, making existing methods unavailable under an active tampering attack. To address this, we propose a robust, provably secure linguistic steganography with diffusion language models (DLMs). Unlike ARMs, DLMs can generate text in a partially parallel manner, allowing us to find robust positions for steganographic embedding that can be combined with error-correcting codes. Furthermore, we introduce error correction strategies, including pseudo-random error correction and neighborhood search correction, during steganographic extraction. Theoretical proof and experimental results demonstrate that our method is secure and robust. It can resist token ambiguity in stegotext segmentation and, to some extent, withstand token-level attacks of insertion, deletion, and substitution."}
{"id": "2601.14549", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14549", "abs": "https://arxiv.org/abs/2601.14549", "authors": ["Nilesh Prasad Pandey", "Jangseon Park", "Onat Gungor", "Flavio Ponzina", "Tajana Rosing"], "title": "QMC: Efficient SLM Edge Inference via Outlier-Aware Quantization and Emergent Memories Co-Design", "comment": null, "summary": "Deploying Small Language Models (SLMs) on edge platforms is critical for real-time, privacy-sensitive generative AI, yet constrained by memory, latency, and energy budgets. Quantization reduces model size and cost but suffers from device noise in emerging non-volatile memories, while conventional memory hierarchies further limit efficiency. SRAM provides fast access but has low density, DRAM must simultaneously accommodate static weights and dynamic KV caches, which creates bandwidth contention, and Flash, although dense, is primarily used for initialization and remains inactive during inference. These limitations highlight the need for hybrid memory organizations tailored to LLM inference. We propose Outlier-aware Quantization with Memory Co-design (QMC), a retraining-free quantization with a novel heterogeneous memory architecture. QMC identifies inlier and outlier weights in SLMs, storing inlier weights in compact multi-level Resistive-RAM (ReRAM) while preserving critical outliers in high-precision on-chip Magnetoresistive-RAM (MRAM), mitigating noise-induced degradation. On language modeling and reasoning benchmarks, QMC outperforms and matches state-of-the-art quantization methods using advanced algorithms and hybrid data formats, while achieving greater compression under both algorithm-only evaluation and realistic deployment settings. Specifically, compared against SoTA quantization methods on the latest edge AI platform, QMC reduces memory usage by 6.3x-7.3x, external data transfers by 7.6x, energy by 11.7x, and latency by 12.5x when compared to FP16, establishing QMC as a scalable, deployment-ready co-design for efficient on-device inference."}
{"id": "2601.14926", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14926", "abs": "https://arxiv.org/abs/2601.14926", "authors": ["Aditi Gandhi", "Aakankshya Das", "Aswani Kumar Cherukuri"], "title": "On Implementing Hybrid Post-Quantum End-to-End Encryption", "comment": null, "summary": "The emergence of quantum computing poses a fundamental threat to current public key cryptographic systems. This threat is necessitating a transition to quantum resistant cryptographic alternatives in all the applications. In this work, we present the implementation of a practical hybrid end-to-end encryption system that combines classical and post-quantum cryptographic primitives to achieve both security and efficiency. Our system employs CRYSTALS-Kyber, a NIST-standardized lattice-based key encapsulation mechanism, for quantum-safe key exchange, coupled with AES-256-GCM for efficient authenticated symmetric encryption and SHA-256 for deterministic key derivation. The architecture follows a zero-trust model where a relay server facilitates communication without accessing plaintext messages or cryptographic keys. All encryption and decryption operations occur exclusively at client endpoints. The system demonstrates that NIST standardized post-quantum cryptography can be effectively integrated into practical messaging systems with acceptable performance characteristics, offering protection against both classical and quantum adversaries. As our focus is on implementation rather than on novelty, we also provide an open-source implementation to facilitate reproducibility and further research in post quantum secure communication systems."}
{"id": "2601.14556", "categories": ["cs.LG", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14556", "abs": "https://arxiv.org/abs/2601.14556", "authors": ["Andrew Crossman", "Jonah Dodd", "Viralam Ramamurthy Chaithanya Kumar", "Riyaz Mohammed", "Andrew R. Plummer", "Chandra Sekharudu", "Deepak Warrier", "Mohammad Yekrangian"], "title": "Constructing Multi-label Hierarchical Classification Models for MITRE ATT&CK Text Tagging", "comment": null, "summary": "MITRE ATT&CK is a cybersecurity knowledge base that organizes threat actor and cyber-attack information into a set of tactics describing the reasons and goals threat actors have for carrying out attacks, with each tactic having a set of techniques that describe the potential methods used in these attacks. One major application of ATT&CK is the use of its tactic and technique hierarchy by security specialists as a framework for annotating cyber-threat intelligence reports, vulnerability descriptions, threat scenarios, inter alia, to facilitate downstream analyses. To date, the tagging process is still largely done manually. In this technical note, we provide a stratified \"task space\" characterization of the MITRE ATT&CK text tagging task for organizing previous efforts toward automation using AIML methods, while also clarifying pathways for constructing new methods. To illustrate one of the pathways, we use the task space strata to stage-wise construct our own multi-label hierarchical classification models for the text tagging task via experimentation over general cyber-threat intelligence text -- using shareable computational tools and publicly releasing the models to the security community (via https://github.com/jpmorganchase/MITRE_models). Our multi-label hierarchical approach yields accuracy scores of roughly 94% at the tactic level, as well as accuracy scores of roughly 82% at the technique level. The models also meet or surpass state-of-the-art performance while relying only on classical machine learning methods -- removing any dependence on LLMs, RAG, agents, or more complex hierarchical approaches. Moreover, we show that GPT-4o model performance at the tactic level is significantly lower (roughly 60% accuracy) than our own approach. We also extend our baseline model to a corpus of threat scenarios for financial applications produced by subject matter experts."}
{"id": "2601.14982", "categories": ["cs.CR", "cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2601.14982", "abs": "https://arxiv.org/abs/2601.14982", "authors": ["David Ricardo Saavedra"], "title": "Interoperable Architecture for Digital Identity Delegation for AI Agents with Blockchain Integration", "comment": "19 pages, 4 figures, 4 tables", "summary": "Verifiable delegation in digital identity systems remains unresolved across centralized, federated, and self-sovereign identity (SSI) environments, particularly where both human users and autonomous AI agents must exercise and transfer authority without exposing primary credentials or private keys. We introduce a unified framework that enables bounded, auditable, and least-privilege delegation across heterogeneous identity ecosystems. The framework includes four key elements: Delegation Grants (DGs), first-class authorization artefacts that encode revocable transfers of authority with enforced scope reduction; a Canonical Verification Context (CVC) that normalizes verification requests into a single structured representation independent of protocols or credential formats; a layered reference architecture that separates trust anchoring, credential and proof validation, policy evaluation, and protocol mediation via a Trust Gateway; and an explicit treatment of blockchain anchoring as an optional integrity layer rather than a structural dependency. Together, these elements advance interoperable delegation and auditability and provide a foundation for future standardization, implementation, and integration of autonomous agents into trusted digital identity infrastructures."}
{"id": "2601.14570", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14570", "abs": "https://arxiv.org/abs/2601.14570", "authors": ["Xiaojie Yang", "Dizhi Huang", "Hangli Ge", "Masahiro Sano", "Takeaki Ohdake", "Kazuma Hatano", "Noboru Koshizuka"], "title": "Place with Intention: An Empirical Attendance Predictive Study of Expo 2025 Osaka, Kansai, Japan", "comment": "Accepted by Special Session 10 of SMD II: Synergizing Mobility Data for Human Life Evolution in Real Spaces at IEEE Big Data 2025", "summary": "Accurate forecasting of daily attendance is vital for managing transportation, crowd flows, and services at large-scale international events such as Expo 2025 Osaka, Kansai, Japan. However, existing approaches often rely on multi-source external data (such as weather, traffic, and social media) to improve accuracy, which can lead to unreliable results when historical data are insufficient. To address these challenges, we propose a Transformer-based framework that leverages reservation dynamics, i.e., ticket bookings and subsequent updates within a time window, as a proxy for visitors' attendance intentions, under the assumption that such intentions are eventually reflected in reservation patterns. This design avoids the complexity of multi-source integration while still capturing external influences like weather and promotions implicitly embedded in reservation dynamics. We construct a dataset combining entrance records and reservation dynamics and evaluate the model under both single-channel (total attendance) and two-channel (separated by East and West gates) settings. Results show that separately modeling East and West gates consistently improves accuracy, particularly for short- and medium-term horizons. Ablation studies further confirm the importance of the encoder-decoder structure, inverse-style embedding, and adaptive fusion module. Overall, our findings indicate that reservation dynamics offer a practical and informative foundation for attendance forecasting in large-scale international events."}
{"id": "2601.14996", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14996", "abs": "https://arxiv.org/abs/2601.14996", "authors": ["Jannik Albrecht", "Ghassan Karame"], "title": "On the Effectiveness of Mempool-based Transaction Auditing", "comment": "Accepted at TheWebConf'26 (WWW'26)", "summary": "While the literature features a number of proposals to defend against transaction manipulation attacks, existing proposals are still not integrated within large blockchains, such as Bitcoin, Ethereum, and Cardano. Instead, the user community opted to rely on more practical but ad-hoc solutions (such as Mempool.space) that aim at detecting censorship and transaction displacement attacks by auditing discrepancies in the mempools of so-called observers.\n  In this paper, we precisely analyze, for the first time, the interplay between mempool auditing and the ability to detect censorship and transaction displacement attacks by malicious miners in Bitcoin and Ethereum. Our analysis shows that mempool auditing can result in mis-accusations against miners with a probability larger than 25% in some settings. On a positive note, however, we show that mempool auditing schemes can successfully audit the execution of any two transactions (with an overwhelming probability of 99.9%) if they are consistently received by all observers and sent at least 30 seconds apart from each other. As a direct consequence, our findings show, for the first time, that batch-order fair-ordering schemes can offer only strong fairness guarantees for a limited subset of transactions in real-world deployments."}
{"id": "2601.14590", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14590", "abs": "https://arxiv.org/abs/2601.14590", "authors": ["Shovito Barua Soumma", "Asiful Arefeen", "Stephanie M. Carpenter", "Melanie Hingle", "Hassan Ghasemzadeh"], "title": "Counterfactual Modeling with Fine-Tuned LLMs for Health Intervention Design and Sensor Data Augmentation", "comment": null, "summary": "Counterfactual explanations (CFEs) provide human-centric interpretability by identifying the minimal, actionable changes required to alter a machine learning model's prediction. Therefore, CFs can be used as (i) interventions for abnormality prevention and (ii) augmented data for training robust models. We conduct a comprehensive evaluation of CF generation using large language models (LLMs), including GPT-4 (zero-shot and few-shot) and two open-source models-BioMistral-7B and LLaMA-3.1-8B, in both pretrained and fine-tuned configurations. Using the multimodal AI-READI clinical dataset, we assess CFs across three dimensions: intervention quality, feature diversity, and augmentation effectiveness. Fine-tuned LLMs, particularly LLaMA-3.1-8B, produce CFs with high plausibility (up to 99%), strong validity (up to 0.99), and realistic, behaviorally modifiable feature adjustments. When used for data augmentation under controlled label-scarcity settings, LLM-generated CFs substantially restore classifier performance, yielding an average 20% F1 recovery across three scarcity scenarios. Compared with optimization-based baselines such as DiCE, CFNOW, and NICE, LLMs offer a flexible, model-agnostic approach that generates more clinically actionable and semantically coherent counterfactuals. Overall, this work demonstrates the promise of LLM-driven counterfactuals for both interpretable intervention design and data-efficient model training in sensor-based digital health.\n  Impact: SenseCF fine-tunes an LLM to generate valid, representative counterfactual explanations and supplement minority class in an imbalanced dataset for improving model training and boosting model robustness and predictive performance"}
{"id": "2601.15055", "categories": ["cs.CR", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.15055", "abs": "https://arxiv.org/abs/2601.15055", "authors": ["Isaac Baglin", "Xiatian Zhu", "Simon Hadfield"], "title": "SpooFL: Spoofing Federated Learning", "comment": null, "summary": "Traditional defenses against Deep Leakage (DL) attacks in Federated Learning (FL) primarily focus on obfuscation, introducing noise, transformations or encryption to degrade an attacker's ability to reconstruct private data. While effective to some extent, these methods often still leak high-level information such as class distributions or feature representations, and are frequently broken by increasingly powerful denoising attacks. We propose a fundamentally different perspective on FL defense: framing it as a spoofing problem.We introduce SpooFL (Figure 1), a spoofing-based defense that deceives attackers into believing they have recovered the true training data, while actually providing convincing but entirely synthetic samples from an unrelated task. Unlike prior synthetic-data defenses that share classes or distributions with the private data and thus still leak semantic information, SpooFL uses a state-of-the-art generative model trained on an external dataset with no class overlap. As a result, attackers are misled into recovering plausible yet completely irrelevant samples, preventing meaningful data leakage while preserving FL training integrity. We implement the first example of such a spoofing defense, and evaluate our method against state-of-the-art DL defenses and demonstrate that it successfully misdirects attackers without compromising model performance significantly."}
{"id": "2601.14599", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14599", "abs": "https://arxiv.org/abs/2601.14599", "authors": ["Xiao Hu", "Hong Xie", "Tao Tan", "Defu Lian", "Jianyu Han"], "title": "Rethinking Reinforcement fine-tuning of LLMs: A Multi-armed Bandit Learning Perspective", "comment": null, "summary": "A large number of heuristics have been proposed to optimize the reinforcement fine-tuning of LLMs. However, inconsistent claims are made from time to time, making this area elusive. Reflecting on this situation, two fundamental questions still lack a clear understanding: 1) what is the role of each optimizing choice? 2) which ones are the bottlenecks? This paper aims to shed light on them, and it faces the challenge of several entangled confounding factors in the fine-tuning process. To tackle this challenge, we propose a bottom-up experiment pipeline. The bottom layer is composed of a minimalist configuration: one training data, one rollout per round and the reward directly serve as the learning signal without advantage function design. This minimalist configuration connects to multi-armed bandit learning with extremely large discrete action space, which offers theories to corroborate the experiment findings. The up procedure of the experiment pipeline expanding the minimalist configuration layer by layer, examining the role of each design choice. Experimental results on three LLMs and two reasoning datasets not only reveal new understanding of the design choice but also yield essential insights to shape the area."}
{"id": "2601.15177", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.15177", "abs": "https://arxiv.org/abs/2601.15177", "authors": ["Lorenzo Fernández Maimó", "Alberto Huertas Celdrán", "Manuel Gil Pérez", "Félix J. García Clemente", "Gregorio Martínez Pérez"], "title": "Dynamic Management of a Deep Learning-Based Anomaly Detection System for 5G Networks", "comment": null, "summary": "Fog and mobile edge computing (MEC) will play a key role in the upcoming fifth generation (5G) mobile networks to support decentralized applications, data analytics and management into the network itself by using a highly distributed compute model. Furthermore, increasing attention is paid to providing user-centric cybersecurity solutions, which particularly require collecting, processing and analyzing significantly large amount of data traffic and huge number of network connections in 5G networks. In this regard, this paper proposes a MEC-oriented solution in 5G mobile networks to detect network anomalies in real-time and in autonomic way. Our proposal uses deep learning techniques to analyze network flows and to detect network anomalies. Moreover, it uses policies in order to provide an efficient and dynamic management system of the computing resources used in the anomaly detection process. The paper presents relevant aspects of the deployment of the proposal and experimental results to show its performance."}
{"id": "2601.14603", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14603", "abs": "https://arxiv.org/abs/2601.14603", "authors": ["Jingru Li", "Yibo Fan", "Huan Li"], "title": "Variance-Adaptive Muon: Accelerating LLM Pretraining with NSR-Modulated and Variance-Scaled Momentum", "comment": null, "summary": "Large Language Models (LLMs) achieve competitive performance across diverse natural language processing (NLP) tasks, yet pretraining is computationally demanding, making optimizer efficiency an important practical consideration. Muon accelerates LLM pretraining via orthogonal momentum updates that serve as a matrix analogue of the element-wise sign operator. Motivated by the recent perspective that Adam is a variance-adaptive sign update algorithm, we propose two variants of Muon, Muon-NSR and Muon-VS, which apply variance-adaptive normalization to momentum before orthogonalization. Muon-NSR applies noise-to-signal ratio (NSR) modulation, while Muon-VS performs variance-based scaling without introducing additional hyperparameters. Experiments on GPT-2 and LLaMA pretraining demonstrate that our proposed methods accelerate convergence and consistently achieve lower validation loss than both competitive, well-tuned AdamW and Muon baselines. For example, on the LLaMA-1.2B model, Muon-NSR and Muon-VS reduce the iterations required to reach the target validation loss by $1.36\\times$ relative to the well-tuned Muon following the recent benchmark."}
{"id": "2601.15269", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.15269", "abs": "https://arxiv.org/abs/2601.15269", "authors": ["Piyumi Bhagya Sudasinghe", "Kushan Sudheera Kalupahana Liyanage", "Harsha S. Gardiyawasam Pussewalage"], "title": "Lightweight LLMs for Network Attack Detection in IoT Networks", "comment": "6 pages with 2 figures, This paper was accepted and presented at the 7th Computing, Communications and IoT Applications Conference (ComComAp 2025), held in Madrid, Spain, during 14th to 17th December 2025", "summary": "The rapid growth of Internet of Things (IoT) devices has increased the scale and diversity of cyberattacks, exposing limitations in traditional intrusion detection systems. Classical machine learning (ML) models such as Random Forest and Support Vector Machine perform well on known attacks but require retraining to detect unseen or zero-day threats. This study investigates lightweight decoder-only Large Language Models (LLMs) for IoT attack detection by integrating structured-to-text conversion, Quantized Low-Rank Adaptation (QLoRA) fine-tuning, and Retrieval-Augmented Generation (RAG). Network traffic features are transformed into compact natural-language prompts, enabling efficient adaptation under constrained hardware. Experiments on the CICIoT2023 dataset show that a QLoRA-tuned LLaMA-1B model achieves an F1-score of 0.7124, comparable to the Random Forest (RF) baseline (0.7159) for known attacks. With RAG, the system attains 42.63% accuracy on unseen attack types without additional training, demonstrating practical zero-shot capability. These results highlight the potential of retrieval-enhanced lightweight LLMs as adaptable and resource-efficient solutions for next-generation IoT intrusion detection."}
{"id": "2601.14633", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14633", "abs": "https://arxiv.org/abs/2601.14633", "authors": ["Yvonne Yang", "Eranki Vasistha"], "title": "Relational Graph Modeling for Credit Default Prediction: Heterogeneous GNNs and Hybrid Ensemble Learning", "comment": null, "summary": "Credit default risk arises from complex interactions among borrowers, financial institutions, and transaction-level behaviors. While strong tabular models remain highly competitive in credit scoring, they may fail to explicitly capture cross-entity dependencies embedded in multi-table financial histories. In this work, we construct a massive-scale heterogeneous graph containing over 31 million nodes and more than 50 million edges, integrating borrower attributes with granular transaction-level entities such as installment payments, POS cash balances, and credit card histories.\n  We evaluate heterogeneous graph neural networks (GNNs), including heterogeneous GraphSAGE and a relation-aware attentive heterogeneous GNN, against strong tabular baselines. We find that standalone GNNs provide limited lift over a competitive gradient-boosted tree baseline, while a hybrid ensemble that augments tabular features with GNN-derived customer embeddings achieves the best overall performance, improving both ROC-AUC and PR-AUC. We further observe that contrastive pretraining can improve optimization stability but yields limited downstream gains under generic graph augmentations. Finally, we conduct structured explainability and fairness analyses to characterize how relational signals affect subgroup behavior and screening-oriented outcomes."}
{"id": "2601.14266", "categories": ["cs.LG", "cs.CL", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14266", "abs": "https://arxiv.org/abs/2601.14266", "authors": ["Ruben Neyroud", "Sam Corley"], "title": "GCG Attack On A Diffusion LLM", "comment": null, "summary": "While most LLMs are autoregressive, diffusion-based LLMs have recently emerged as an alternative method for generation. Greedy Coordinate Gradient (GCG) attacks have proven effective against autoregressive models, but their applicability to diffusion language models remains largely unexplored. In this work, we present an exploratory study of GCG-style adversarial prompt attacks on LLaDA (Large Language Diffusion with mAsking), an open-source diffusion LLM. We evaluate multiple attack variants, including prefix perturbations and suffix-based adversarial generation, on harmful prompts drawn from the AdvBench dataset. Our study provides initial insights into the robustness and attack surface of diffusion language models and motivates the development of alternative optimization and evaluation strategies for adversarial analysis in this setting."}
{"id": "2601.14653", "categories": ["cs.LG", "q-bio.GN"], "pdf": "https://arxiv.org/pdf/2601.14653", "abs": "https://arxiv.org/abs/2601.14653", "authors": ["Yuyu Liu", "Jiannan Yang", "Ziyang Yu", "Weishen Pan", "Fei Wang", "Tengfei Ma"], "title": "Efficient Imputation for Patch-based Missing Single-cell Data via Cluster-regularized Optimal Transport", "comment": null, "summary": "Missing data in single-cell sequencing datasets poses significant challenges for extracting meaningful biological insights. However, existing imputation approaches, which often assume uniformity and data completeness, struggle to address cases with large patches of missing data. In this paper, we present CROT, an optimal transport-based imputation algorithm designed to handle patch-based missing data in tabular formats. Our approach effectively captures the underlying data structure in the presence of significant missingness. Notably, it achieves superior imputation accuracy while significantly reducing runtime, demonstrating its scalability and efficiency for large-scale datasets. This work introduces a robust solution for imputation in heterogeneous, high-dimensional datasets with structured data absence, addressing critical challenges in both biological and clinical data analysis. Our code is available at Anomalous Github."}
{"id": "2601.14300", "categories": ["cs.LG", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14300", "abs": "https://arxiv.org/abs/2601.14300", "authors": ["Jun Liu", "Leo Yu Zhang", "Fengpeng Li", "Isao Echizen", "Jiantao Zhou"], "title": "Gradient Structure Estimation under Label-Only Oracles via Spectral Sensitivity", "comment": null, "summary": "Hard-label black-box settings, where only top-1 predicted labels are observable, pose a fundamentally constrained yet practically important feedback model for understanding model behavior. A central challenge in this regime is whether meaningful gradient information can be recovered from such discrete responses. In this work, we develop a unified theoretical perspective showing that a wide range of existing sign-flipping hard-label attacks can be interpreted as implicitly approximating the sign of the true loss gradient. This observation reframes hard-label attacks from heuristic search procedures into instances of gradient sign recovery under extremely limited feedback. Motivated by this first-principles understanding, we propose a new attack framework that combines a zero-query frequency-domain initialization with a Pattern-Driven Optimization (PDO) strategy. We establish theoretical guarantees demonstrating that, under mild assumptions, our initialization achieves higher expected cosine similarity to the true gradient sign compared to random baselines, while the proposed PDO procedure attains substantially lower query complexity than existing structured search approaches. We empirically validate our framework through extensive experiments on CIFAR-10, ImageNet, and ObjectNet, covering standard and adversarially trained models, commercial APIs, and CLIP-based models. The results show that our method consistently surpasses SOTA hard-label attacks in both attack success rate and query efficiency, particularly in low-query regimes. Beyond image classification, our approach generalizes effectively to corrupted data, biomedical datasets, and dense prediction tasks. Notably, it also successfully circumvents Blacklight, a SOTA stateful defense, resulting in a $0\\%$ detection rate. Our code will be released publicly soon at https://github.com/csjunjun/DPAttack.git."}
{"id": "2601.14687", "categories": ["cs.LG", "cs.CR", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.14687", "abs": "https://arxiv.org/abs/2601.14687", "authors": ["Zhihao Chen", "Zirui Gong", "Jianting Ning", "Yanjun Zhang", "Leo Yu Zhang"], "title": "Beyond Denial-of-Service: The Puppeteer's Attack for Fine-Grained Control in Ranking-Based Federated Learning", "comment": "12 pages. To appear in The Web Conference 2026", "summary": "Federated Rank Learning (FRL) is a promising Federated Learning (FL) paradigm designed to be resilient against model poisoning attacks due to its discrete, ranking-based update mechanism. Unlike traditional FL methods that rely on model updates, FRL leverages discrete rankings as a communication parameter between clients and the server. This approach significantly reduces communication costs and limits an adversary's ability to scale or optimize malicious updates in the continuous space, thereby enhancing its robustness. This makes FRL particularly appealing for applications where system security and data privacy are crucial, such as web-based auction and bidding platforms. While FRL substantially reduces the attack surface, we demonstrate that it remains vulnerable to a new class of local model poisoning attack, i.e., fine-grained control attacks. We introduce the Edge Control Attack (ECA), the first fine-grained control attack tailored to ranking-based FL frameworks. Unlike conventional denial-of-service (DoS) attacks that cause conspicuous disruptions, ECA enables an adversary to precisely degrade a competitor's accuracy to any target level while maintaining a normal-looking convergence trajectory, thereby avoiding detection. ECA operates in two stages: (i) identifying and manipulating Ascending and Descending Edges to align the global model with the target model, and (ii) widening the selection boundary gap to stabilize the global model at the target accuracy. Extensive experiments across seven benchmark datasets and nine Byzantine-robust aggregation rules (AGRs) show that ECA achieves fine-grained accuracy control with an average error of only 0.224%, outperforming the baseline by up to 17x. Our findings highlight the need for stronger defenses against advanced poisoning attacks. Our code is available at: https://github.com/Chenzh0205/ECA"}
{"id": "2601.14556", "categories": ["cs.LG", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.14556", "abs": "https://arxiv.org/abs/2601.14556", "authors": ["Andrew Crossman", "Jonah Dodd", "Viralam Ramamurthy Chaithanya Kumar", "Riyaz Mohammed", "Andrew R. Plummer", "Chandra Sekharudu", "Deepak Warrier", "Mohammad Yekrangian"], "title": "Constructing Multi-label Hierarchical Classification Models for MITRE ATT&CK Text Tagging", "comment": null, "summary": "MITRE ATT&CK is a cybersecurity knowledge base that organizes threat actor and cyber-attack information into a set of tactics describing the reasons and goals threat actors have for carrying out attacks, with each tactic having a set of techniques that describe the potential methods used in these attacks. One major application of ATT&CK is the use of its tactic and technique hierarchy by security specialists as a framework for annotating cyber-threat intelligence reports, vulnerability descriptions, threat scenarios, inter alia, to facilitate downstream analyses. To date, the tagging process is still largely done manually. In this technical note, we provide a stratified \"task space\" characterization of the MITRE ATT&CK text tagging task for organizing previous efforts toward automation using AIML methods, while also clarifying pathways for constructing new methods. To illustrate one of the pathways, we use the task space strata to stage-wise construct our own multi-label hierarchical classification models for the text tagging task via experimentation over general cyber-threat intelligence text -- using shareable computational tools and publicly releasing the models to the security community (via https://github.com/jpmorganchase/MITRE_models). Our multi-label hierarchical approach yields accuracy scores of roughly 94% at the tactic level, as well as accuracy scores of roughly 82% at the technique level. The models also meet or surpass state-of-the-art performance while relying only on classical machine learning methods -- removing any dependence on LLMs, RAG, agents, or more complex hierarchical approaches. Moreover, we show that GPT-4o model performance at the tactic level is significantly lower (roughly 60% accuracy) than our own approach. We also extend our baseline model to a corpus of threat scenarios for financial applications produced by subject matter experts."}
{"id": "2601.14693", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14693", "abs": "https://arxiv.org/abs/2601.14693", "authors": ["Jianwen Sun", "Xinrui Li", "Fuqing Li", "Xiaoxuan Shen"], "title": "Beyond Error-Based Optimization: Experience-Driven Symbolic Regression with Goal-Conditioned Reinforcement Learning", "comment": null, "summary": "Symbolic Regression aims to automatically identify compact and interpretable mathematical expressions that model the functional relationship between input and output variables. Most existing search-based symbolic regression methods typically rely on the fitting error to inform the search process. However, in the vast expression space, numerous candidate expressions may exhibit similar error values while differing substantially in structure, leading to ambiguous search directions and hindering convergence to the underlying true function. To address this challenge, we propose a novel framework named EGRL-SR (Experience-driven Goal-conditioned Reinforcement Learning for Symbolic Regression). In contrast to traditional error-driven approaches, EGRL-SR introduces a new perspective: leveraging precise historical trajectories and optimizing the action-value network to proactively guide the search process, thereby achieving a more robust expression search. Specifically, we formulate symbolic regression as a goal-conditioned reinforcement learning problem and incorporate hindsight experience replay, allowing the action-value network to generalize common mapping patterns from diverse input-output pairs. Moreover, we design an all-point satisfaction binary reward function that encourages the action-value network to focus on structural patterns rather than low-error expressions, and concurrently propose a structure-guided heuristic exploration strategy to enhance search diversity and space coverage. Experiments on public benchmarks show that EGRL-SR consistently outperforms state-of-the-art methods in recovery rate and robustness, and can recover more complex expressions under the same search budget. Ablation results validate that the action-value network effectively guides the search, with both the reward function and the exploration strategy playing critical roles."}
{"id": "2601.14597", "categories": ["cs.IT", "cs.AI", "cs.CR", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.14597", "abs": "https://arxiv.org/abs/2601.14597", "authors": ["James Melbourne", "Mario Diaz", "Shahab Asoodeh"], "title": "Optimality of Staircase Mechanisms for Vector Queries under Differential Privacy", "comment": "Submitted for possible publication", "summary": "We study the optimal design of additive mechanisms for vector-valued queries under $ε$-differential privacy (DP). Given only the sensitivity of a query and a norm-monotone cost function measuring utility loss, we ask which noise distribution minimizes expected cost among all additive $ε$-DP mechanisms. Using convex rearrangement theory, we show that this infinite-dimensional optimization problem admits a reduction to a one-dimensional compact and convex family of radially symmetric distributions whose extreme points are the staircase distributions. As a consequence, we prove that for any dimension, any norm, and any norm-monotone cost function, there exists an $ε$-DP staircase mechanism that is optimal among all additive mechanisms. This result resolves a conjecture of Geng, Kairouz, Oh, and Viswanath, and provides a geometric explanation for the emergence of staircase mechanisms as extremal solutions in differential privacy."}
{"id": "2601.14694", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14694", "abs": "https://arxiv.org/abs/2601.14694", "authors": ["Pengfei Ding", "Yan Wang", "Guanfeng Liu"], "title": "Re-understanding Graph Unlearning through Memorization", "comment": "This paper has been accepted by WWW-2026", "summary": "Graph unlearning (GU), which removes nodes, edges, or features from trained graph neural networks (GNNs), is crucial in Web applications where graph data may contain sensitive, mislabeled, or malicious information. However, existing GU methods lack a clear understanding of the key factors that determine unlearning effectiveness, leading to three fundamental limitations: (1) impractical and inaccurate GU difficulty assessment due to test-access requirements and invalid assumptions, (2) ineffectiveness on hard-to-unlearn tasks, and (3) misaligned evaluation protocols that overemphasize easy tasks and fail to capture true forgetting capability. To address these issues, we establish GNN memorization as a new perspective for understanding graph unlearning and propose MGU, a Memorization-guided Graph Unlearning framework. MGU achieves three key advances: it provides accurate and practical difficulty assessment across different GU tasks, develops an adaptive strategy that dynamically adjusts unlearning objectives based on difficulty levels, and establishes a comprehensive evaluation protocol that aligns with practical requirements. Extensive experiments on ten real-world graphs demonstrate that MGU consistently outperforms state-of-the-art baselines in forgetting quality, computational efficiency, and utility preservation."}
{"id": "2601.14687", "categories": ["cs.LG", "cs.CR", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.14687", "abs": "https://arxiv.org/abs/2601.14687", "authors": ["Zhihao Chen", "Zirui Gong", "Jianting Ning", "Yanjun Zhang", "Leo Yu Zhang"], "title": "Beyond Denial-of-Service: The Puppeteer's Attack for Fine-Grained Control in Ranking-Based Federated Learning", "comment": "12 pages. To appear in The Web Conference 2026", "summary": "Federated Rank Learning (FRL) is a promising Federated Learning (FL) paradigm designed to be resilient against model poisoning attacks due to its discrete, ranking-based update mechanism. Unlike traditional FL methods that rely on model updates, FRL leverages discrete rankings as a communication parameter between clients and the server. This approach significantly reduces communication costs and limits an adversary's ability to scale or optimize malicious updates in the continuous space, thereby enhancing its robustness. This makes FRL particularly appealing for applications where system security and data privacy are crucial, such as web-based auction and bidding platforms. While FRL substantially reduces the attack surface, we demonstrate that it remains vulnerable to a new class of local model poisoning attack, i.e., fine-grained control attacks. We introduce the Edge Control Attack (ECA), the first fine-grained control attack tailored to ranking-based FL frameworks. Unlike conventional denial-of-service (DoS) attacks that cause conspicuous disruptions, ECA enables an adversary to precisely degrade a competitor's accuracy to any target level while maintaining a normal-looking convergence trajectory, thereby avoiding detection. ECA operates in two stages: (i) identifying and manipulating Ascending and Descending Edges to align the global model with the target model, and (ii) widening the selection boundary gap to stabilize the global model at the target accuracy. Extensive experiments across seven benchmark datasets and nine Byzantine-robust aggregation rules (AGRs) show that ECA achieves fine-grained accuracy control with an average error of only 0.224%, outperforming the baseline by up to 17x. Our findings highlight the need for stronger defenses against advanced poisoning attacks. Our code is available at: https://github.com/Chenzh0205/ECA"}
{"id": "2601.14695", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14695", "abs": "https://arxiv.org/abs/2601.14695", "authors": ["Yutong Chen", "Jiandong Gao", "Ji Wu"], "title": "CoScale-RL: Efficient Post-Training by Co-Scaling Data and Computation", "comment": "preprint", "summary": "Training Large Reasoning Model (LRM) is usually unstable and unpredictable, especially on hard problems or weak foundation models. We found that the current post-training scaling strategy can still improve on these cases. We propose CoScale-RL, a novel scaling strategy with better data and computational efficiency. We first scale up solutions to make problems solvable. The core idea is to collect multiple solutions for each problem, rather than simply enlarging the dataset. Then, we scale up rollout computation to stabilize Reinforcement Learning. We further leverage a model merge technique called Re-distillation to sustain or even improve computational efficiency when scaling up. Our method significantly improves data and computational efficiency, with an average 3.76$\\times$ accuracy improvement on four benchmarks. CoScale-RL is able to improve an LRM's ability boundary without an extensive SFT dataset. Our method provides a new scaling direction to further improve LRM's reasoning ability."}
{"id": "2601.14710", "categories": ["cs.LG", "cs.AI", "cs.CE"], "pdf": "https://arxiv.org/pdf/2601.14710", "abs": "https://arxiv.org/abs/2601.14710", "authors": ["Tianchi Chen", "Jan Bima", "Sean L. Wu", "Otto Ritter", "Bingjia Yang", "Xiang Yu"], "title": "Case-Guided Sequential Assay Planning in Drug Discovery", "comment": null, "summary": "Optimally sequencing experimental assays in drug discovery is a high-stakes planning problem under severe uncertainty and resource constraints. A primary obstacle for standard reinforcement learning (RL) is the absence of an explicit environment simulator or transition data $(s, a, s')$; planning must rely solely on a static database of historical outcomes. We introduce the Implicit Bayesian Markov Decision Process (IBMDP), a model-based RL framework designed for such simulator-free settings. IBMDP constructs a case-guided implicit model of transition dynamics by forming a nonparametric belief distribution using similar historical outcomes. This mechanism enables Bayesian belief updating as evidence accumulates and employs ensemble MCTS planning to generate stable policies that balance information gain toward desired outcomes with resource efficiency. We validate IBMDP through comprehensive experiments. On a real-world central nervous system (CNS) drug discovery task, IBMDP reduced resource consumption by up to 92\\% compared to established heuristics while maintaining decision confidence. To rigorously assess decision quality, we also benchmarked IBMDP in a synthetic environment with a computable optimal policy. Our framework achieves significantly higher alignment with this optimal policy than a deterministic value iteration alternative that uses the same similarity-based model, demonstrating the superiority of our ensemble planner. IBMDP offers a practical solution for sequential experimental design in data-rich but simulator-poor domains."}
{"id": "2601.14716", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.14716", "abs": "https://arxiv.org/abs/2601.14716", "authors": ["Yao Lu", "Dengdong Fan", "Jianzheng Nie", "Fan Xu", "Jie Chen", "Bin Zhou", "Yonghong Tian"], "title": "PCL-Reasoner-V1.5: Advancing Math Reasoning with Offline Reinforcement Learning", "comment": null, "summary": "We present PCL-Reasoner-V1.5, a 32-billion-parameter large language model (LLM) for mathematical reasoning. The model is built upon Qwen2.5-32B and refined via supervised fine-tuning (SFT) followed by reinforcement learning (RL). A central innovation is our proposed offline RL method, which provides superior training stability and efficiency over standard online RL methods such as GRPO. Our model achieves state-of-the-art performance among models post-trained on Qwen2.5-32B, attaining average accuracies of 90.9% on AIME 2024 and 85.6% on AIME 2025. Our work demonstrates offline RL as a stable and efficient paradigm for advancing reasoning in LLMs. All experiments were conducted on Huawei Ascend 910C NPUs."}
{"id": "2601.14730", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14730", "abs": "https://arxiv.org/abs/2601.14730", "authors": ["Bizu Feng", "Zhimu Yang", "Shaode Yu", "Zixin Hu"], "title": "FSX: Message Flow Sensitivity Enhanced Structural Explainer for Graph Neural Networks", "comment": "8 pages, 4 figures, Preprint", "summary": "Despite the widespread success of Graph Neural Networks (GNNs), understanding the reasons behind their specific predictions remains challenging. Existing explainability methods face a trade-off that gradient-based approaches are computationally efficient but often ignore structural interactions, while game-theoretic techniques capture interactions at the cost of high computational overhead and potential deviation from the model's true reasoning path. To address this gap, we propose FSX (Message Flow Sensitivity Enhanced Structural Explainer), a novel hybrid framework that synergistically combines the internal message flows of the model with a cooperative game approach applied to the external graph data. FSX first identifies critical message flows via a novel flow-sensitivity analysis: during a single forward pass, it simulates localized node perturbations and measures the resulting changes in message flow intensities. These sensitivity-ranked flows are then projected onto the input graph to define compact, semantically meaningful subgraphs. Within each subgraph, a flow-aware cooperative game is conducted, where node contributions are evaluated fairly through a Shapley-like value that incorporates both node-feature importance and their roles in sustaining or destabilizing the identified critical flows. Extensive evaluation across multiple datasets and GNN architectures demonstrates that FSX achieves superior explanation fidelity with significantly reduced runtime, while providing unprecedented insights into the structural logic underlying model predictions--specifically, how important sub-structures exert influence by governing the stability of key internal computational pathways."}
{"id": "2601.14746", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14746", "abs": "https://arxiv.org/abs/2601.14746", "authors": ["Hongyue Wu", "Hangyu Li", "Guodong Fan", "Haoran Zhu", "Shizhan Chen", "Zhiyong Feng"], "title": "RefProtoFL: Communication-Efficient Federated Learning via External-Referenced Prototype Alignment", "comment": null, "summary": "Federated learning (FL) enables collaborative model training without sharing raw data in edge environments, but is constrained by limited communication bandwidth and heterogeneous client data distributions. Prototype-based FL mitigates this issue by exchanging class-wise feature prototypes instead of full model parameters; however, existing methods still suffer from suboptimal generalization under severe communication constraints. In this paper, we propose RefProtoFL, a communication-efficient FL framework that integrates External-Referenced Prototype Alignment (ERPA) for representation consistency with Adaptive Probabilistic Update Dropping (APUD) for communication efficiency. Specifically, we decompose the model into a private backbone and a lightweight shared adapter, and restrict federated communication to the adapter parameters only. To further reduce uplink cost, APUD performs magnitude-aware Top-K sparsification, transmitting only the most significant adapter updates for server-side aggregation. To address representation inconsistency across heterogeneous clients, ERPA leverages a small server-held public dataset to construct external reference prototypes that serve as shared semantic anchors. For classes covered by public data, clients directly align local representations to public-induced prototypes, whereas for uncovered classes, alignment relies on server-aggregated global reference prototypes via weighted averaging. Extensive experiments on standard benchmarks demonstrate that RefProtoFL attains higher classification accuracy than state-of-the-art prototype-based FL baselines."}
{"id": "2601.14758", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.14758", "abs": "https://arxiv.org/abs/2601.14758", "authors": ["Injin Kong", "Hyoungjoon Lee", "Yohan Jo"], "title": "Mechanism Shift During Post-training from Autoregressive to Masked Diffusion Language Models", "comment": null, "summary": "Post-training pretrained Autoregressive models (ARMs) into Masked Diffusion models (MDMs) has emerged as a cost-effective strategy to overcome the limitations of sequential generation. However, the internal algorithmic transformations induced by this paradigm shift remain unexplored, leaving it unclear whether post-trained MDMs acquire genuine bidirectional reasoning capabilities or merely repackage autoregressive heuristics. In this work, we address this question by conducting a comparative circuit analysis of ARMs and their MDM counterparts. Our analysis reveals a systematic \"mechanism shift\" dependent on the structural nature of the task. Structurally, we observe a distinct divergence: while MDMs largely retain autoregressive circuitry for tasks dominated by local causal dependencies, they abandon initialized pathways for global planning tasks, exhibiting distinct rewiring characterized by increased early-layer processing. Semantically, we identify a transition from sharp, localized specialization in ARMs to distributed integration in MDMs. Through these findings, we conclude that diffusion post-training does not merely adapt model parameters but fundamentally reorganizes internal computation to support non-sequential global planning."}
{"id": "2601.14765", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14765", "abs": "https://arxiv.org/abs/2601.14765", "authors": ["Harold Kiossou", "Pierre Schaus", "Siegfried Nijssen"], "title": "Anytime Optimal Decision Tree Learning with Continuous Features", "comment": null, "summary": "In recent years, significant progress has been made on algorithms for learning optimal decision trees, primarily in the context of binary features. Extending these methods to continuous features remains substantially more challenging due to the large number of potential splits for each feature. Recently, an elegant exact algorithm was proposed for learning optimal decision trees with continuous features; however, the rapidly increasing computational time limits its practical applicability to shallow depths (typically 3 or 4). It relies on a depth-first search optimization strategy that fully optimizes the left subtree of each split before exploring the corresponding right subtree. While effective in finding optimal solutions given sufficient time, this strategy can lead to poor anytime behavior: when interrupted early, the best-found tree is often highly unbalanced and suboptimal. In such cases, purely greedy methods such as C4.5 may, paradoxically, yield better solutions. To address this limitation, we propose an anytime, yet complete approach leveraging limited discrepancy search, distributing the computational effort more evenly across the entire tree structure, and thus ensuring that a high-quality decision tree is available at any interruption point. Experimental results show that our approach outperforms the existing one in terms of anytime performance."}
{"id": "2601.14792", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14792", "abs": "https://arxiv.org/abs/2601.14792", "authors": ["Dong Sun", "Rahul Nittala", "Rebekka Burkholz"], "title": "Robustness of Mixtures of Experts to Feature Noise", "comment": null, "summary": "Despite their practical success, it remains unclear why Mixture of Experts (MoE) models can outperform dense networks beyond sheer parameter scaling. We study an iso-parameter regime where inputs exhibit latent modular structure but are corrupted by feature noise, a proxy for noisy internal activations. We show that sparse expert activation acts as a noise filter: compared to a dense estimator, MoEs achieve lower generalization error under feature noise, improved robustness to perturbations, and faster convergence speed. Empirical results on synthetic data and real-world language tasks corroborate the theoretical insights, demonstrating consistent robustness and efficiency gains from sparse modular computation."}
{"id": "2601.14798", "categories": ["cs.LG", "cs.CL", "cs.CY"], "pdf": "https://arxiv.org/pdf/2601.14798", "abs": "https://arxiv.org/abs/2601.14798", "authors": ["Ondřej Holub", "Essi Ryymin", "Rodrigo Alves"], "title": "Reflecting in the Reflection: Integrating a Socratic Questioning Framework into Automated AI-Based Question Generation", "comment": null, "summary": "Designing good reflection questions is pedagogically important but time-consuming and unevenly supported across teachers. This paper introduces a reflection-in-reflection framework for automated generation of reflection questions with large language models (LLMs). Our approach coordinates two role-specialized agents, a Student-Teacher and a Teacher-Educator, that engage in a Socratic multi-turn dialogue to iteratively refine a single question given a teacher-specified topic, key concepts, student level, and optional instructional materials. The Student-Teacher proposes candidate questions with brief rationales, while the Teacher-Educator evaluates them along clarity, depth, relevance, engagement, and conceptual interconnections, responding only with targeted coaching questions or a fixed signal to stop the dialogue. We evaluate the framework in an authentic lower-secondary ICT setting on the topic, using GPT-4o-mini as the backbone model and a stronger GPT- 4-class LLM as an external evaluator in pairwise comparisons of clarity, relevance, depth, and overall quality. First, we study how interaction design and context (dynamic vs.fixed iteration counts; presence or absence of student level and materials) affect question quality. Dynamic stopping combined with contextual information consistently outperforms fixed 5- or 10-step refinement, with very long dialogues prone to drift or over-complication. Second, we show that our two-agent protocol produces questions that are judged substantially more relevant and deeper, and better overall, than a one-shot baseline using the same backbone model."}
{"id": "2601.14818", "categories": ["cs.LG", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.14818", "abs": "https://arxiv.org/abs/2601.14818", "authors": ["Christian Fiedler"], "title": "Statistical Learning Theory for Distributional Classification", "comment": "Contains supplementary material", "summary": "In supervised learning with distributional inputs in the two-stage sampling setup, relevant to applications like learning-based medical screening or causal learning, the inputs (which are probability distributions) are not accessible in the learning phase, but only samples thereof. This problem is particularly amenable to kernel-based learning methods, where the distributions or samples are first embedded into a Hilbert space, often using kernel mean embeddings (KMEs), and then a standard kernel method like Support Vector Machines (SVMs) is applied, using a kernel defined on the embedding Hilbert space. In this work, we contribute to the theoretical analysis of this latter approach, with a particular focus on classification with distributional inputs using SVMs. We establish a new oracle inequality and derive consistency and learning rate results. Furthermore, for SVMs using the hinge loss and Gaussian kernels, we formulate a novel variant of an established noise assumption from the binary classification literature, under which we can establish learning rates. Finally, some of our technical tools like a new feature space for Gaussian kernels on Hilbert spaces are of independent interest."}
{"id": "2601.14848", "categories": ["cs.LG", "cs.AI", "cs.NE", "cs.RO"], "pdf": "https://arxiv.org/pdf/2601.14848", "abs": "https://arxiv.org/abs/2601.14848", "authors": ["Mohamed Abouras", "Catherine M. Elias"], "title": "From Observation to Prediction: LSTM for Vehicle Lane Change Forecasting on Highway On/Off-Ramps", "comment": null, "summary": "On and off-ramps are understudied road sections even though they introduce a higher level of variation in highway interactions. Predicting vehicles' behavior in these areas can decrease the impact of uncertainty and increase road safety. In this paper, the difference between this Area of Interest (AoI) and a straight highway section is studied. Multi-layered LSTM architecture to train the AoI model with ExiD drone dataset is utilized. In the process, different prediction horizons and different models' workflow are tested. The results show great promise on horizons up to 4 seconds with prediction accuracy starting from about 76% for the AoI and 94% for the general highway scenarios on the maximum horizon."}
{"id": "2601.14855", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14855", "abs": "https://arxiv.org/abs/2601.14855", "authors": ["Baojun Che", "Yifan Chen", "Daniel Zhengyu Huang", "Xinying Mao", "Weijie Wang"], "title": "Adaptive Exponential Integration for Stable Gaussian Mixture Black-Box Variational Inference", "comment": "26 pages, 7 figures", "summary": "Black-box variational inference (BBVI) with Gaussian mixture families offers a flexible approach for approximating complex posterior distributions without requiring gradients of the target density. However, standard numerical optimization methods often suffer from instability and inefficiency. We develop a stable and efficient framework that combines three key components: (1) affine-invariant preconditioning via natural gradient formulations, (2) an exponential integrator that unconditionally preserves the positive definiteness of covariance matrices, and (3) adaptive time stepping to ensure stability and to accommodate distinct warm-up and convergence phases. The proposed approach has natural connections to manifold optimization and mirror descent. For Gaussian posteriors, we prove exponential convergence in the noise-free setting and almost-sure convergence under Monte Carlo estimation, rigorously justifying the necessity of adaptive time stepping. Numerical experiments on multimodal distributions, Neal's multiscale funnel, and a PDE-based Bayesian inverse problem for Darcy flow demonstrate the effectiveness of the proposed method."}
{"id": "2601.14862", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.14862", "abs": "https://arxiv.org/abs/2601.14862", "authors": ["Olaf Yunus Laitinen Imanov", "Taner Yilmaz", "Derya Umut Kulali"], "title": "Strategic Doctrine Language Models (sdLM): A Learning-System Framework for Doctrinal Consistency and Geopolitical Forecasting", "comment": "13 pages, 10 figures, 10 tables", "summary": "We introduce Strategic Doctrine Language Models (sdLM), a learning-system framework for multi-document strategic reasoning with doctrinal consistency constraints and calibrated uncertainty. The approach combines multi-document attention, temporal encoding, and a doctrine-consistency layer to improve long-horizon forecasting and plan plausibility while reducing severe doctrinal violations. We evaluate sdLM using (i) expert-panel scoring of strategic scenarios (N=47), (ii) doctrine consistency on 336 doctrine publications (12,847 statements), and (iii) geopolitical forecasting on 127 historical counterfactuals (1945-2020) across 12-60 month horizons. Across these benchmarks, sdLM achieves higher strategic quality and better calibration than strong general-purpose LLM baselines, and remains competitive with human experts on long-horizon judgments. We further report ablations, scaling trends, and deployment-oriented performance/latency characteristics to clarify which components drive improvements and how they translate to operational settings."}
{"id": "2601.14888", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.14888", "abs": "https://arxiv.org/abs/2601.14888", "authors": ["Keyu Lv", "Manyi Zhang", "Xiaobo Xia", "Jingchen Ni", "Shannan Yan", "Xianzhi Yu", "Lu Hou", "Chun Yuan", "Haoli Bai"], "title": "What Makes Low-Bit Quantization-Aware Training Work for Reasoning LLMs? A Systematic Study", "comment": null, "summary": "Reasoning models excel at complex tasks such as coding and mathematics, yet their inference is often slow and token-inefficient. To improve the inference efficiency, post-training quantization (PTQ) usually comes with the cost of large accuracy drops, especially for reasoning tasks under low-bit settings. In this study, we present a systematic empirical study of quantization-aware training (QAT) for reasoning models. Our key findings include: (1) Knowledge distillation is a robust objective for reasoning models trained via either supervised fine-tuning or reinforcement learning; (2) PTQ provides a strong initialization for QAT, improving accuracy while reducing training cost; (3) Reinforcement learning remains feasible for quantized models given a viable cold start and yields additional gains; and (4) Aligning the PTQ calibration domain with the QAT training domain accelerates convergence and often improves the final accuracy. Finally, we consolidate these findings into an optimized workflow (Reasoning-QAT), and show that it consistently outperforms state-of-the-art PTQ methods across multiple LLM backbones and reasoning datasets. For instance, on Qwen3-0.6B, it surpasses GPTQ by 44.53% on MATH-500 and consistently recovers performance in the 2-bit regime."}
{"id": "2601.14917", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14917", "abs": "https://arxiv.org/abs/2601.14917", "authors": ["Giorgia Rigamonti", "Mirko Paolo Barbato", "Davide Marelli", "Paolo Napoletano"], "title": "Tailoring Adverse Event Prediction in Type 1 Diabetes with Patient-Specific Deep Learning Models", "comment": null, "summary": "Effective management of Type 1 Diabetes requires continuous glucose monitoring and precise insulin adjustments to prevent hyperglycemia and hypoglycemia. With the growing adoption of wearable glucose monitors and mobile health applications, accurate blood glucose prediction is essential for enhancing automated insulin delivery and decision-support systems. This paper presents a deep learning-based approach for personalized blood glucose prediction, leveraging patient-specific data to improve prediction accuracy and responsiveness in real-world scenarios. Unlike traditional generalized models, our method accounts for individual variability, enabling more effective subject-specific predictions. We compare Leave-One-Subject-Out Cross-Validation with a fine-tuning strategy to evaluate their ability to model patient-specific dynamics. Results show that personalized models significantly improve the prediction of adverse events, enabling more precise and timely interventions in real-world scenarios. To assess the impact of patient-specific data, we conduct experiments comparing a multimodal, patient-specific approach against traditional CGM-only methods. Additionally, we perform an ablation study to investigate model performance with progressively smaller training sets, identifying the minimum data required for effective personalization-an essential consideration for real-world applications where extensive data collection is often challenging. Our findings underscore the potential of adaptive, personalized glucose prediction models for advancing next-generation diabetes management, particularly in wearable and mobile health platforms, enhancing consumer-oriented diabetes care solutions."}
{"id": "2601.14942", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.14942", "abs": "https://arxiv.org/abs/2601.14942", "authors": ["Hang Zhao", "Hongru Li", "Dongfang Xu", "Shenghui Song", "Khaled B. Letaief"], "title": "Communication-Efficient Multi-Modal Edge Inference via Uncertainty-Aware Distributed Learning", "comment": null, "summary": "Semantic communication is emerging as a key enabler for distributed edge intelligence due to its capability to convey task-relevant meaning. However, achieving communication-efficient training and robust inference over wireless links remains challenging. This challenge is further exacerbated for multi-modal edge inference (MMEI) by two factors: 1) prohibitive communication overhead for distributed learning over bandwidth-limited wireless links, due to the \\emph{multi-modal} nature of the system; and 2) limited robustness under varying channels and noisy multi-modal inputs. In this paper, we propose a three-stage communication-aware distributed learning framework to improve training and inference efficiency while maintaining robustness over wireless channels. In Stage~I, devices perform local multi-modal self-supervised learning to obtain shared and modality-specific encoders without device--server exchange, thereby reducing the communication cost. In Stage~II, distributed fine-tuning with centralized evidential fusion calibrates per-modality uncertainty and reliably aggregates features distorted by noise or channel fading. In Stage~III, an uncertainty-guided feedback mechanism selectively requests additional features for uncertain samples, optimizing the communication--accuracy tradeoff in the distributed setting. Experiments on RGB--depth indoor scene classification show that the proposed framework attains higher accuracy with far fewer training communication rounds and remains robust to modality degradation or channel variation, outperforming existing self-supervised and fully supervised baselines."}
{"id": "2601.14954", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14954", "abs": "https://arxiv.org/abs/2601.14954", "authors": ["Han Li", "Hua Sun"], "title": "Multimodal Rumor Detection Enhanced by External Evidence and Forgery Features", "comment": "19 pages,10 figures", "summary": "Social media increasingly disseminates information through mixed image text posts, but rumors often exploit subtle inconsistencies and forged content, making detection based solely on post content difficult. Deep semantic mismatch rumors, which superficially align images and texts, pose particular challenges and threaten online public opinion. Existing multimodal rumor detection methods improve cross modal modeling but suffer from limited feature extraction, noisy alignment, and inflexible fusion strategies, while ignoring external factual evidence necessary for verifying complex rumors. To address these limitations, we propose a multimodal rumor detection model enhanced with external evidence and forgery features. The model uses a ResNet34 visual encoder, a BERT text encoder, and a forgery feature module extracting frequency-domain traces and compression artifacts via Fourier transformation. BLIP-generated image descriptions bridge image and text semantic spaces. A dual contrastive learning module computes contrastive losses between text image and text description pairs, improving detection of semantic inconsistencies. A gated adaptive feature-scaling fusion mechanism dynamically adjusts multimodal fusion and reduces redundancy. Experiments on Weibo and Twitter datasets demonstrate that our model outperforms mainstream baselines in macro accuracy, recall, and F1 score."}
{"id": "2601.14957", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14957", "abs": "https://arxiv.org/abs/2601.14957", "authors": ["Harry Mead", "Bruno Lacerda", "Jakob Foerster", "Nick Hawes"], "title": "Improving Regret Approximation for Unsupervised Dynamic Environment Generation", "comment": null, "summary": "Unsupervised Environment Design (UED) seeks to automatically generate training curricula for reinforcement learning (RL) agents, with the goal of improving generalisation and zero-shot performance. However, designing effective curricula remains a difficult problem, particularly in settings where small subsets of environment parameterisations result in significant increases in the complexity of the required policy. Current methods struggle with a difficult credit assignment problem and rely on regret approximations that fail to identify challenging levels, both of which are compounded as the size of the environment grows. We propose Dynamic Environment Generation for UED (DEGen) to enable a denser level generator reward signal, reducing the difficulty of credit assignment and allowing for UED to scale to larger environment sizes. We also introduce a new regret approximation, Maximised Negative Advantage (MNA), as a significantly improved metric to optimise for, that better identifies more challenging levels. We show empirically that MNA outperforms current regret approximations and when combined with DEGen, consistently outperforms existing methods, especially as the size of the environment grows. We have made all our code available here: https://github.com/HarryMJMead/Dynamic-Environment-Generation-for-UED."}
{"id": "2601.14968", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.14968", "abs": "https://arxiv.org/abs/2601.14968", "authors": ["Mingyue Cheng", "Xiaoyu Tao", "Huajian Zhang", "Qi Liu", "Enhong Chen"], "title": "InstructTime++: Time Series Classification with Multimodal Language Modeling via Implicit Feature Enhancement", "comment": null, "summary": "Most existing time series classification methods adopt a discriminative paradigm that maps input sequences directly to one-hot encoded class labels. While effective, this paradigm struggles to incorporate contextual features and fails to capture semantic relationships among classes. To address these limitations, we propose InstructTime, a novel framework that reformulates time series classification as a multimodal generative task. Specifically, continuous numerical sequences, contextual textual features, and task instructions are treated as multimodal inputs, while class labels are generated as textual outputs by tuned language models. To bridge the modality gap, InstructTime introduces a time series discretization module that converts continuous sequences into discrete temporal tokens, together with an alignment projection layer and a generative self-supervised pre-training strategy to enhance cross-modal representation alignment. Building upon this framework, we further propose InstructTime++, which extends InstructTime by incorporating implicit feature modeling to compensate for the limited inductive bias of language models. InstructTime++ leverages specialized toolkits to mine informative implicit patterns from raw time series and contextual inputs, including statistical feature extraction and vision-language-based image captioning, and translates them into textual descriptions for seamless integration. Extensive experiments on multiple benchmark datasets demonstrate the superior performance of InstructTime++."}
{"id": "2601.14971", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14971", "abs": "https://arxiv.org/abs/2601.14971", "authors": ["Liping Chen", "Mujie Liu", "Haytham Fayek"], "title": "Fine-Grained Traceability for Transparent ML Pipelines", "comment": "Accepted at The Web Conference (WWW) 2026", "summary": "Modern machine learning systems are increasingly realised as multistage pipelines, yet existing transparency mechanisms typically operate at a model level: they describe what a system is and why it behaves as it does, but not how individual data samples are operationally recorded, tracked, and verified as they traverse the pipeline. This absence of verifiable, sample-level traceability leaves practitioners and users unable to determine whether a specific sample was used, when it was processed, or whether the corresponding records remain intact over time. We introduce FG-Trac, a model-agnostic framework that establishes verifiable, fine-grained sample-level traceability throughout machine learning pipelines. FG-Trac defines an explicit mechanism for capturing and verifying sample lifecycle events across preprocessing and training, computes contribution scores explicitly grounded in training checkpoints, and anchors these traces to tamper-evident cryptographic commitments. The framework integrates without modifying model architectures or training objectives, reconstructing complete and auditable data-usage histories with practical computational overhead. Experiments on a canonical convolutional neural network and a multimodal graph learning pipeline demonstrate that FG-Trac preserves predictive performance while enabling machine learning systems to furnish verifiable evidence of how individual samples were used and propagated during model execution."}
{"id": "2601.15000", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.15000", "abs": "https://arxiv.org/abs/2601.15000", "authors": ["Christos Petridis", "Konstantinos Pelechrinis"], "title": "Lineup Regularized Adjusted Plus-Minus (L-RAPM): Basketball Lineup Ratings with Informed Priors", "comment": "7 pages, 4 figures", "summary": "Identifying combinations of players (that is, lineups) in basketball - and other sports - that perform well when they play together is one of the most important tasks in sports analytics. One of the main challenges associated with this task is the frequent substitutions that occur during a game, which results in highly sparse data. In particular, a National Basketball Association (NBA) team will use more than 600 lineups during a season, which translates to an average lineup having seen the court in approximately 25-30 possessions. Inevitably, any statistics that one collects for these lineups are going to be noisy, with low predictive value. Yet, there is no existing work (in the public at least) that addresses this problem. In this work, we propose a regression-based approach that controls for the opposition faced by each lineup, while it also utilizes information about the players making up the lineups. Our experiments show that L-RAPM provides improved predictive power than the currently used baseline, and this improvement increases as the sample size for the lineups gets smaller."}
{"id": "2601.15013", "categories": ["cs.LG", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.15013", "abs": "https://arxiv.org/abs/2601.15013", "authors": ["Michael Feil", "Julius Lipp"], "title": "RadixMLP - Intra-batch Deduplication for Causal Transformers", "comment": null, "summary": "Batch inference workloads for causal transformer models frequently process sequences that share common prefixes, such as system prompts, few-shot examples, or shared queries. Standard inference engines treat each sequence independently, redundantly recomputing identical MLP activations for every copy of the shared prefix. We introduce RadixMLP, a technique that exploits the position-wise nature of MLPs, LayerNorms, linear projections, and embeddings to eliminate this redundancy. RadixMLP dynamically maps batches to a prefix trie, gathering shared segments into a compressed representation for position-wise computation and scattering results back only at attention boundaries. RadixMLP is stateless and operates within a single forward pass. In end-to-end serving benchmarks on MS~MARCO v1.1 with Qwen3 models (0.6B to 8B parameters), RadixMLP achieves 1.44-1.59$\\times$ speedups in realistic reranking workloads, with up to $5\\times$ speedups on synthetic benchmarks with longer shared prefixes. Our code is available at https://github.com/michaelfeil/radix-mlp."}
{"id": "2601.15015", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.15015", "abs": "https://arxiv.org/abs/2601.15015", "authors": ["Jannis Becktepe", "Aleksandra Franz", "Nils Thuerey", "Sebastian Peitz"], "title": "Plug-and-Play Benchmarking of Reinforcement Learning Algorithms for Large-Scale Flow Control", "comment": "Code available at https://github.com/safe-autonomous-systems/fluidgym", "summary": "Reinforcement learning (RL) has shown promising results in active flow control (AFC), yet progress in the field remains difficult to assess as existing studies rely on heterogeneous observation and actuation schemes, numerical setups, and evaluation protocols. Current AFC benchmarks attempt to address these issues but heavily rely on external computational fluid dynamics (CFD) solvers, are not fully differentiable, and provide limited 3D and multi-agent support. To overcome these limitations, we introduce FluidGym, the first standalone, fully differentiable benchmark suite for RL in AFC. Built entirely in PyTorch on top of the GPU-accelerated PICT solver, FluidGym runs in a single Python stack, requires no external CFD software, and provides standardized evaluation protocols. We present baseline results with PPO and SAC and release all environments, datasets, and trained models as public resources. FluidGym enables systematic comparison of control methods, establishes a scalable foundation for future research in learning-based flow control, and is available at https://github.com/safe-autonomous-systems/fluidgym."}
{"id": "2601.15021", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.15021", "abs": "https://arxiv.org/abs/2601.15021", "authors": ["Adam Rokah", "Daniel Veress", "Caleb Caulk", "Sourav Sharan"], "title": "Mixture-of-Experts Models in Vision: Routing, Optimization, and Generalization", "comment": "7 pages, 8 figures. Code available at: https://github.com/moe-project-uu/mixture-of-experts-project", "summary": "Mixture-of-Experts (MoE) architectures enable conditional computation by routing inputs to multiple expert subnetworks and are often motivated as a mechanism for scaling large language models. In this project, we instead study MoE behavior in an image classification setting, focusing on predictive performance, expert utilization, and generalization. We compare dense, SoftMoE, and SparseMoE classifier heads on the CIFAR10 dataset under comparable model capacity. Both MoE variants achieve slightly higher validation accuracy than the dense baseline while maintaining balanced expert utilization through regularization, avoiding expert collapse. To analyze generalization, we compute Hessian-based sharpness metrics at convergence, including the largest eigenvalue and trace of the loss Hessian, evaluated on both training and test data. We find that SoftMoE exhibits higher sharpness by these metrics, while Dense and SparseMoE lie in a similar curvature regime, despite all models achieving comparable generalization performance. Complementary loss surface perturbation analyses reveal qualitative differences in non-local behavior under finite parameter perturbations between dense and MoE models, which help contextualize curvature-based measurements without directly explaining validation accuracy. We further evaluate empirical inference efficiency and show that naively implemented conditional routing does not yield inference speedups on modern hardware at this scale, highlighting the gap between theoretical and realized efficiency in sparse MoE models."}
{"id": "2601.15036", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.15036", "abs": "https://arxiv.org/abs/2601.15036", "authors": ["Dirk Tasche"], "title": "Factorizable joint shift revisited", "comment": "23 pages", "summary": "Factorizable joint shift (FJS) was proposed as a type of distribution shift (or dataset shift) that comprises both covariate and label shift. Recently, it has been observed that FJS actually arises from consecutive label and covariate (or vice versa) shifts. Research into FJS so far has been confined to the case of categorical label spaces. We propose a framework for analysing distribution shift in the case of general label spaces, thus covering both classification and regression models. Based on the framework, we generalise existing results on FJS to general label spaces and propose a related extension of the expectation maximisation (EM) algorithm for class prior probabilities. We also take a fresh look at generalized label shift (GLS) in the case of general label spaces."}
{"id": "2601.15038", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.15038", "abs": "https://arxiv.org/abs/2601.15038", "authors": ["Mertcan Daysalilar", "Fuat Uyguroglu", "Gabriel Nicolosi", "Adam Meyers"], "title": "A Curriculum-Based Deep Reinforcement Learning Framework for the Electric Vehicle Routing Problem", "comment": null, "summary": "The electric vehicle routing problem with time windows (EVRPTW) is a complex optimization problem in sustainable logistics, where routing decisions must minimize total travel distance, fleet size, and battery usage while satisfying strict customer time constraints. Although deep reinforcement learning (DRL) has shown great potential as an alternative to classical heuristics and exact solvers, existing DRL models often struggle to maintain training stability-failing to converge or generalize when constraints are dense. In this study, we propose a curriculum-based deep reinforcement learning (CB-DRL) framework designed to resolve this instability. The framework utilizes a structured three-phase curriculum that gradually increases problem complexity: the agent first learns distance and fleet optimization (Phase A), then battery management (Phase B), and finally the full EVRPTW (Phase C). To ensure stable learning across phases, the framework employs a modified proximal policy optimization algorithm with phase-specific hyperparameters, value and advantage clipping, and adaptive learning-rate scheduling. The policy network is built upon a heterogeneous graph attention encoder enhanced by global-local attention and feature-wise linear modulation. This specialized architecture explicitly captures the distinct properties of depots, customers, and charging stations. Trained exclusively on small instances with N=10 customers, the model demonstrates robust generalization to unseen instances ranging from N=5 to N=100, significantly outperforming standard baselines on medium-scale problems. Experimental results confirm that this curriculum-guided approach achieves high feasibility rates and competitive solution quality on out-of-distribution instances where standard DRL baselines fail, effectively bridging the gap between neural speed and operational reliability."}
{"id": "2601.15041", "categories": ["cs.LG", "cs.SE"], "pdf": "https://arxiv.org/pdf/2601.15041", "abs": "https://arxiv.org/abs/2601.15041", "authors": ["Oliver Weißl", "Vincenzo Riccio", "Severin Kacianka", "Andrea Stocco"], "title": "HyperNet-Adaptation for Diffusion-Based Test Case Generation", "comment": null, "summary": "The increasing deployment of deep learning systems requires systematic evaluation of their reliability in real-world scenarios. Traditional gradient-based adversarial attacks introduce small perturbations that rarely correspond to realistic failures and mainly assess robustness rather than functional behavior. Generative test generation methods offer an alternative but are often limited to simple datasets or constrained input domains. Although diffusion models enable high-fidelity image synthesis, their computational cost and limited controllability restrict their applicability to large-scale testing. We present HyNeA, a generative testing method that enables direct and efficient control over diffusion-based generation. HyNeA provides dataset-free controllability through hypernetworks, allowing targeted manipulation of the generative process without relying on architecture-specific conditioning mechanisms or dataset-driven adaptations such as fine-tuning. HyNeA employs a distinct training strategy that supports instance-level tuning to identify failure-inducing test cases without requiring datasets that explicitly contain examples of similar failures. This approach enables the targeted generation of realistic failure cases at substantially lower computational cost than search-based methods. Experimental results show that HyNeA improves controllability and test diversity compared to existing generative test generators and generalizes to domains where failure-labeled training data is unavailable."}
{"id": "2601.15079", "categories": ["cs.LG", "cs.SI"], "pdf": "https://arxiv.org/pdf/2601.15079", "abs": "https://arxiv.org/abs/2601.15079", "authors": ["Chenyu Liu", "Haige Li", "Luca Rossi"], "title": "LoRAP: Low-Rank Aggregation Prompting for Quantized Graph Neural Networks Training", "comment": null, "summary": "Graph Neural Networks (GNNs) are neural networks that aim to process graph data, capturing the relationships and interactions between nodes using the message-passing mechanism. GNN quantization has emerged as a promising approach for reducing model size and accelerating inference in resource-constrained environments. Compared to quantization in LLMs, quantizing graph features is more emphasized in GNNs. Inspired by the above, we propose to leverage prompt learning, which manipulates the input data, to improve the performance of quantization-aware training (QAT) for GNNs. To mitigate the issue that prompting the node features alone can only make part of the quantized aggregation result optimal, we introduce Low-Rank Aggregation Prompting (LoRAP), which injects lightweight, input-dependent prompts into each aggregated feature to optimize the results of quantized aggregations. Extensive evaluations on 4 leading QAT frameworks over 9 graph datasets demonstrate that LoRAP consistently enhances the performance of low-bit quantized GNNs while introducing a minimal computational overhead."}
{"id": "2601.15086", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.15086", "abs": "https://arxiv.org/abs/2601.15086", "authors": ["Oleg Shchendrigin", "Egor Cherepanov", "Alexey K. Kovalev", "Aleksandr I. Panov"], "title": "Memory Retention Is Not Enough to Master Memory Tasks in Reinforcement Learning", "comment": "11 pages, 6 figures, 7 tables", "summary": "Effective decision-making in the real world depends on memory that is both stable and adaptive: environments change over time, and agents must retain relevant information over long horizons while also updating or overwriting outdated content when circumstances shift. Existing Reinforcement Learning (RL) benchmarks and memory-augmented agents focus primarily on retention, leaving the equally critical ability of memory rewriting largely unexplored. To address this gap, we introduce a benchmark that explicitly tests continual memory updating under partial observability, i.e. the natural setting where an agent must rely on memory rather than current observations, and use it to compare recurrent, transformer-based, and structured memory architectures. Our experiments reveal that classic recurrent models, despite their simplicity, demonstrate greater flexibility and robustness in memory rewriting tasks than modern structured memories, which succeed only under narrow conditions, and transformer-based agents, which often fail beyond trivial retention cases. These findings expose a fundamental limitation of current approaches and emphasize the necessity of memory mechanisms that balance stable retention with adaptive updating. Our work highlights this overlooked challenge, introduces benchmarks to evaluate it, and offers insights for designing future RL agents with explicit and trainable forgetting mechanisms. Code: https://quartz-admirer.github.io/Memory-Rewriting/"}
{"id": "2601.15102", "categories": ["cs.LG", "eess.IV"], "pdf": "https://arxiv.org/pdf/2601.15102", "abs": "https://arxiv.org/abs/2601.15102", "authors": ["Johannes Meuer", "Maximilian Witte", "Étiénne Plésiat", "Thomas Ludwig", "Christopher Kadow"], "title": "Field-Space Autoencoder for Scalable Climate Emulators", "comment": null, "summary": "Kilometer-scale Earth system models are essential for capturing local climate change. However, these models are computationally expensive and produce petabyte-scale outputs, which limits their utility for applications such as probabilistic risk assessment. Here, we present the Field-Space Autoencoder, a scalable climate emulation framework based on a spherical compression model that overcomes these challenges. By utilizing Field-Space Attention, the model efficiently operates on native climate model output and therefore avoids geometric distortions caused by forcing spherical data onto Euclidean grids. This approach preserves physical structures significantly better than convolutional baselines. By producing a structured compressed field, it serves as a good baseline for downstream generative emulation. In addition, the model can perform zero-shot super-resolution that maps low-resolution large ensembles and scarce high-resolution data into a shared representation. We train a generative diffusion model on these compressed fields. The model can simultaneously learn internal variability from abundant low-resolution data and fine-scale physics from sparse high-resolution data. Our work bridges the gap between the high volume of low-resolution ensemble statistics and the scarcity of high-resolution physical detail."}
{"id": "2601.15111", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.15111", "abs": "https://arxiv.org/abs/2601.15111", "authors": ["Anmol Goel", "Alan Ritter", "Iryna Gurevych"], "title": "Auditing Language Model Unlearning via Information Decomposition", "comment": "EACL 2026 Main", "summary": "We expose a critical limitation in current approaches to machine unlearning in language models: despite the apparent success of unlearning algorithms, information about the forgotten data remains linearly decodable from internal representations. To systematically assess this discrepancy, we introduce an interpretable, information-theoretic framework for auditing unlearning using Partial Information Decomposition (PID). By comparing model representations before and after unlearning, we decompose the mutual information with the forgotten data into distinct components, formalizing the notions of unlearned and residual knowledge. Our analysis reveals that redundant information, shared across both models, constitutes residual knowledge that persists post-unlearning and correlates with susceptibility to known adversarial reconstruction attacks. Leveraging these insights, we propose a representation-based risk score that can guide abstention on sensitive inputs at inference time, providing a practical mechanism to mitigate privacy leakage. Our work introduces a principled, representation-level audit for unlearning, offering theoretical insight and actionable tools for safer deployment of language models."}
{"id": "2601.15124", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.15124", "abs": "https://arxiv.org/abs/2601.15124", "authors": ["Haonan Yuan", "Qingyun Sun", "Jiacheng Tao", "Xingcheng Fu", "Jianxin Li"], "title": "Overcoming In-Memory Bottlenecks in Graph Foundation Models via Retrieval-Augmented Generation", "comment": "Accepted by the Web Conference 2026 (Research Track)", "summary": "Graph Foundation Models (GFMs) have emerged as a frontier in graph learning, which are expected to deliver transferable representations across diverse tasks. However, GFMs remain constrained by in-memory bottlenecks: they attempt to encode knowledge into model parameters, which limits semantic capacity, introduces heavy lossy compression with conflicts, and entangles graph representation with the knowledge in ways that hinder efficient adaptation, undermining scalability and interpretability. In this work,we propose RAG-GFM, a Retrieval-Augmented Generation aided Graph Foundation Model that offloads knowledge from parameters and complements parameterized learning. To externalize graph knowledge, we build a dual-modal unified retrieval module, where a semantic store from prefix-structured text and a structural store from centrality-based motif. To preserve heterogeneous information, we design a dual-view alignment objective that contrasts both modalities to capture both content and relational patterns. To enable efficient downstream adaptation, we perform in-context augmentation to enrich supporting instances with retrieved texts and motifs as contextual evidence. Extensive experiments on five benchmark graph datasets demonstrate that RAG-GFM consistently outperforms 13 state-of-the-art baselines in both cross-domain node and graph classification, achieving superior effectiveness and efficiency."}
{"id": "2601.15127", "categories": ["cs.LG", "cs.CV", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.15127", "abs": "https://arxiv.org/abs/2601.15127", "authors": ["Bostan Khan", "Masoud Daneshtalab"], "title": "DeepFedNAS: A Unified Framework for Principled, Hardware-Aware, and Predictor-Free Federated Neural Architecture Search", "comment": "This paper significantly extends the preliminary work accepted at ESANN 2026. Source Code: https://github.com/bostankhan6/DeepFedNAS", "summary": "Federated Neural Architecture Search (FedNAS) aims to automate model design for privacy-preserving Federated Learning (FL) but currently faces two critical bottlenecks: unguided supernet training that yields suboptimal models, and costly multi-hour pipelines for post-training subnet discovery. We introduce DeepFedNAS, a novel, two-phase framework underpinned by a principled, multi-objective fitness function that synthesizes mathematical network design with architectural heuristics. Enabled by a re-engineered supernet, DeepFedNAS introduces Federated Pareto Optimal Supernet Training, which leverages a pre-computed Pareto-optimal cache of high-fitness architectures as an intelligent curriculum to optimize shared supernet weights. Subsequently, its Predictor-Free Search Method eliminates the need for costly accuracy surrogates by utilizing this fitness function as a direct, zero-cost proxy for accuracy, enabling on-demand subnet discovery in mere seconds. DeepFedNAS achieves state-of-the-art accuracy (e.g., up to 1.21% absolute improvement on CIFAR-100), superior parameter and communication efficiency, and a substantial ~61x speedup in total post-training search pipeline time. By reducing the pipeline from over 20 hours to approximately 20 minutes (including initial cache generation) and enabling 20-second individual subnet searches, DeepFedNAS makes hardware-aware FL deployments instantaneous and practical. The complete source code and experimental scripts are available at: https://github.com/bostankhan6/DeepFedNAS"}
{"id": "2601.15141", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.15141", "abs": "https://arxiv.org/abs/2601.15141", "authors": ["Tianshi Xu", "Yuteng Chen", "Meng Li"], "title": "CLEANER: Self-Purified Trajectories Boost Agentic Reinforcement Learning", "comment": null, "summary": "Agentic Reinforcement Learning (RL) has empowered Large Language Models (LLMs) to utilize tools like Python interpreters for complex problem-solving. However, for parameter-constrained models (e.g., 4B--7B), the exploration phase is often plagued by frequent execution failures, creating noisy trajectories that hinder policy optimization. Under standard outcome-based reward settings, this noise leads to a critical credit assignment issue, where erroneous actions are inadvertently reinforced alongside successful outcomes. Existing mitigations face a dilemma: dense rewards often trigger reward hacking, while supersampling incurs prohibitive computational costs. To address these challenges, we propose CLEANER. Distinct from external filtering methods, CLEANER exploits the model's intrinsic self-correction capabilities to eliminate error-contaminated context directly during data collection. At its core, the Similarity-Aware Adaptive Rollback (SAAR) mechanism autonomously constructs clean, purified trajectories by retrospectively replacing failures with successful self-corrections. Based on semantic similarity, SAAR adaptively regulates replacement granularity from shallow execution repairs to deep reasoning substitutions. By training on these self-purified paths, the model internalizes correct reasoning patterns rather than error-recovery loops. Empirical results on AIME24/25, GPQA, and LiveCodeBench show average accuracy gains of 6%, 3%, and 5% over baselines. Notably, CLEANER matches state-of-the-art performance using only one-third of the training steps, highlighting trajectory purification as a scalable solution for efficient agentic RL. Our models and code are available at GitHub"}
{"id": "2601.15158", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.15158", "abs": "https://arxiv.org/abs/2601.15158", "authors": ["Yuval Ran-Milo", "Yotam Alexander", "Shahar Mendel", "Nadav Cohen"], "title": "Outcome-Based RL Provably Leads Transformers to Reason, but Only With the Right Data", "comment": "80 pages, 4 figures", "summary": "Transformers trained via Reinforcement Learning (RL) with outcome-based supervision can spontaneously develop the ability to generate intermediate reasoning steps (Chain-of-Thought). Yet the mechanism by which sparse rewards drive gradient descent to discover such systematic reasoning remains poorly understood. We address this by analyzing the gradient flow dynamics of single-layer Transformers on a synthetic graph traversal task that cannot be solved without Chain-of-Thought (CoT) but admits a simple iterative solution. We prove that despite training solely on final-answer correctness, gradient flow drives the model to converge to a structured, interpretable algorithm that iteratively traverses the graph vertex-by-vertex. We characterize the distributional properties required for this emergence, identifying the critical role of \"simple examples\": instances requiring fewer reasoning steps. When the training distribution places sufficient mass on these simpler instances, the model learns a generalizable traversal strategy that extrapolates to longer chains; when this mass vanishes, gradient-based learning becomes infeasible. We corroborate our theoretical results through experiments on synthetic data and with real-world language models on mathematical reasoning tasks, validating that our theoretical findings carry over to practical settings."}
{"id": "2601.15212", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.15212", "abs": "https://arxiv.org/abs/2601.15212", "authors": ["Dhrubo Saha"], "title": "ZENITH: Automated Gradient Norm Informed Stochastic Optimization", "comment": null, "summary": "Training deep computer vision models requires manual oversight or hyperparameter tuning of the learning rate (LR) schedule. While existing adaptive optimizers schedule the LR automatically, they suffer from computational and memory overhead, incompatibility with regularization, and suboptimal LR choices. In this work, we introduce the ZENITH (Zero-overhead Evolution using Norm-Informed Training History) optimizer, which adapts the LR using the temporal evolution of the gradient norm. Image classification experiments spanning 6 CNN architectures and 6 benchmarks demonstrate that ZENITH achieves higher test accuracy in lower wall-clock time than baselines. It also yielded superior mAP in object detection, keypoint detection, and instance segmentation on MS COCO using the R-CNN family of models. Furthermore, its compatibility with regularization enables even better generalization."}
{"id": "2601.15249", "categories": ["cs.LG", "cs.AI", "cs.GT", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.15249", "abs": "https://arxiv.org/abs/2601.15249", "authors": ["Garrett G. Wen", "Buxin Su", "Natalie Collina", "Zhun Deng", "Weijie Su"], "title": "Recommending Best Paper Awards for ML/AI Conferences via the Isotonic Mechanism", "comment": null, "summary": "Machine learning and artificial intelligence conferences such as NeurIPS and ICML now regularly receive tens of thousands of submissions, posing significant challenges to maintaining the quality and consistency of the peer review process. This challenge is particularly acute for best paper awards, which are an important part of the peer review process, yet whose selection has increasingly become a subject of debate in recent years. In this paper, we introduce an author-assisted mechanism to facilitate the selection of best paper awards. Our method employs the Isotonic Mechanism for eliciting authors' assessments of their own submissions in the form of a ranking, which is subsequently utilized to adjust the raw review scores for optimal estimation of the submissions' ground-truth quality. We demonstrate that authors are incentivized to report truthfully when their utility is a convex additive function of the adjusted scores, and we validate this convexity assumption for best paper awards using publicly accessible review data of ICLR from 2019 to 2023 and NeurIPS from 2021 to 2023. Crucially, in the special case where an author has a single quota -- that is, may nominate only one paper -- we prove that truthfulness holds even when the utility function is merely nondecreasing and additive. This finding represents a substantial relaxation of the assumptions required in prior work. For practical implementation, we extend our mechanism to accommodate the common scenario of overlapping authorship. Finally, simulation results demonstrate that our mechanism significantly improves the quality of papers selected for awards."}
{"id": "2601.15279", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.15279", "abs": "https://arxiv.org/abs/2601.15279", "authors": ["Christoph Bartmann", "Johannes Schimunek", "Mykyta Ielanskyi", "Philipp Seidl", "Günter Klambauer", "Sohvi Luukkonen"], "title": "MolecularIQ: Characterizing Chemical Reasoning Capabilities Through Symbolic Verification on Molecular Graphs", "comment": null, "summary": "A molecule's properties are fundamentally determined by its composition and structure encoded in its molecular graph. Thus, reasoning about molecular properties requires the ability to parse and understand the molecular graph. Large Language Models (LLMs) are increasingly applied to chemistry, tackling tasks such as molecular name conversion, captioning, text-guided generation, and property or reaction prediction. Most existing benchmarks emphasize general chemical knowledge, rely on literature or surrogate labels that risk leakage or bias, or reduce evaluation to multiple-choice questions. We introduce MolecularIQ, a molecular structure reasoning benchmark focused exclusively on symbolically verifiable tasks. MolecularIQ enables fine-grained evaluation of reasoning over molecular graphs and reveals capability patterns that localize model failures to specific tasks and molecular structures. This provides actionable insights into the strengths and limitations of current chemistry LLMs and guides the development of models that reason faithfully over molecular structure."}
{"id": "2601.14311", "categories": ["cs.CR", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14311", "abs": "https://arxiv.org/abs/2601.14311", "authors": ["Richard Hohensinner", "Belgin Mutlu", "Inti Gabriel Mendoza Estrada", "Matej Vukovic", "Simone Kopeinik", "Roman Kern"], "title": "Tracing the Data Trail: A Survey of Data Provenance, Transparency and Traceability in LLMs", "comment": "35 pages, 6 figures. Manuscript submitted to ACM Computing Surveys (CSUR) on the 12th of December 2025", "summary": "Large language models (LLMs) are deployed at scale, yet their training data life cycle remains opaque. This survey synthesizes research from the past ten years on three tightly coupled axes: (1) data provenance, (2) transparency, and (3) traceability, and three supporting pillars: (4) bias \\& uncertainty, (5) data privacy, and (6) tools and techniques that operationalize them. A central contribution is a proposed taxonomy defining the field's domains and listing corresponding artifacts. Through analysis of 95 publications, this work identifies key methodologies concerning data generation, watermarking, bias measurement, data curation, data privacy, and the inherent trade-off between transparency and opacity."}
{"id": "2601.14340", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14340", "abs": "https://arxiv.org/abs/2601.14340", "authors": ["Yiyang Lu", "Jinwen He", "Yue Zhao", "Kai Chen", "Ruigang Liang"], "title": "Turn-Based Structural Triggers: Prompt-Free Backdoors in Multi-Turn LLMs", "comment": null, "summary": "Large Language Models (LLMs) are widely integrated into interactive systems such as dialogue agents and task-oriented assistants. This growing ecosystem also raises supply-chain risks, where adversaries can distribute poisoned models that degrade downstream reliability and user trust. Existing backdoor attacks and defenses are largely prompt-centric, focusing on user-visible triggers while overlooking structural signals in multi-turn conversations. We propose Turn-based Structural Trigger (TST), a backdoor attack that activates from dialogue structure, using the turn index as the trigger and remaining independent of user inputs. Across four widely used open-source LLM models, TST achieves an average attack success rate (ASR) of 99.52% with minimal utility degradation, and remains effective under five representative defenses with an average ASR of 98.04%. The attack also generalizes well across instruction datasets, maintaining an average ASR of 99.19%. Our results suggest that dialogue structure constitutes an important and under-studied attack surface for multi-turn LLM systems, motivating structure-aware auditing and mitigation in practice."}
{"id": "2601.14505", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14505", "abs": "https://arxiv.org/abs/2601.14505", "authors": ["Mohammad Shamim Ahsan", "Peng Liu"], "title": "Uncovering and Understanding FPR Manipulation Attack in Industrial IoT Networks", "comment": null, "summary": "In the network security domain, due to practical issues -- including imbalanced data and heterogeneous legitimate network traffic -- adversarial attacks in machine learning-based NIDSs have been viewed as attack packets misclassified as benign. Due to this prevailing belief, the possibility of (maliciously) perturbed benign packets being misclassified as attack has been largely ignored. In this paper, we demonstrate that this is not only theoretically possible, but also a particular threat to NIDS. In particular, we uncover a practical cyberattack, FPR manipulation attack (FPA), especially targeting industrial IoT networks, where domain-specific knowledge of the widely used MQTT protocol is exploited and a systematic simple packet-level perturbation is performed to alter the labels of benign traffic samples without employing traditional gradient-based or non-gradient-based methods. The experimental evaluations demonstrate that this novel attack results in a success rate of 80.19% to 100%. In addition, while estimating impacts in the Security Operations Center, we observe that even a small fraction of false positive alerts, irrespective of different budget constraints and alert traffic intensities, can increase the delay of genuine alerts investigations up to 2 hr in a single day under normal operating conditions. Furthermore, a series of relevant statistical and XAI analyses is conducted to understand the key factors behind this remarkable success. Finally, we explore the effectiveness of the FPA packets to enhance models' robustness through adversarial training and investigate the changes in decision boundaries accordingly."}
{"id": "2601.14528", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.14528", "abs": "https://arxiv.org/abs/2601.14528", "authors": ["Luis Lazo", "Hamed Jelodar", "Roozbeh Razavi-Far"], "title": "LLM Security and Safety: Insights from Homotopy-Inspired Prompt Obfuscation", "comment": null, "summary": "In this study, we propose a homotopy-inspired prompt obfuscation framework to enhance understanding of security and safety vulnerabilities in Large Language Models (LLMs). By systematically applying carefully engineered prompts, we demonstrate how latent model behaviors can be influenced in unexpected ways. Our experiments encompassed 15,732 prompts, including 10,000 high-priority cases, across LLama, Deepseek, KIMI for code generation, and Claude to verify. The results reveal critical insights into current LLM safeguards, highlighting the need for more robust defense mechanisms, reliable detection strategies, and improved resilience. Importantly, this work provides a principled framework for analyzing and mitigating potential weaknesses, with the goal of advancing safe, responsible, and trustworthy AI technologies."}
{"id": "2601.15055", "categories": ["cs.CR", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.15055", "abs": "https://arxiv.org/abs/2601.15055", "authors": ["Isaac Baglin", "Xiatian Zhu", "Simon Hadfield"], "title": "SpooFL: Spoofing Federated Learning", "comment": null, "summary": "Traditional defenses against Deep Leakage (DL) attacks in Federated Learning (FL) primarily focus on obfuscation, introducing noise, transformations or encryption to degrade an attacker's ability to reconstruct private data. While effective to some extent, these methods often still leak high-level information such as class distributions or feature representations, and are frequently broken by increasingly powerful denoising attacks. We propose a fundamentally different perspective on FL defense: framing it as a spoofing problem.We introduce SpooFL (Figure 1), a spoofing-based defense that deceives attackers into believing they have recovered the true training data, while actually providing convincing but entirely synthetic samples from an unrelated task. Unlike prior synthetic-data defenses that share classes or distributions with the private data and thus still leak semantic information, SpooFL uses a state-of-the-art generative model trained on an external dataset with no class overlap. As a result, attackers are misled into recovering plausible yet completely irrelevant samples, preventing meaningful data leakage while preserving FL training integrity. We implement the first example of such a spoofing defense, and evaluate our method against state-of-the-art DL defenses and demonstrate that it successfully misdirects attackers without compromising model performance significantly."}
