{"id": "2601.05280", "categories": ["cs.IT", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05280", "abs": "https://arxiv.org/abs/2601.05280", "authors": ["Hector Zenil"], "title": "On the Limits of Self-Improving in LLMs and Why AGI, ASI and the Singularity Are Not Near Without Symbolic Model Synthesis", "comment": "26 pages", "summary": "We formalise recursive self-training in Large Language Models (LLMs) and Generative AI as a discrete-time dynamical system and prove that, as training data become increasingly self-generated ($α_t \\to 0$), the system undergoes inevitably degenerative dynamics. We derive two fundamental failure modes: (1) Entropy Decay, where finite sampling effects cause a monotonic loss of distributional diversity (mode collapse), and (2) Variance Amplification, where the loss of external grounding causes the model's representation of truth to drift as a random walk, bounded only by the support diameter. We show these behaviours are not contingent on architecture but are consequences of distributional learning on finite samples. We further argue that Reinforcement Learning with imperfect verifiers suffers similar semantic collapse. To overcome these limits, we propose a path involving symbolic regression and program synthesis guided by Algorithmic Probability. The Coding Theorem Method (CTM) allows for identifying generative mechanisms rather than mere correlations, escaping the data-processing inequality that binds standard statistical learning. We conclude that while purely distributional learning leads to model collapse, hybrid neurosymbolic approaches offer a coherent framework for sustained self-improvement."}
{"id": "2601.05281", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05281", "abs": "https://arxiv.org/abs/2601.05281", "authors": ["Yujie Ling", "Zan Li", "Lei Guan", "Zheng Zhang", "Dusit Niyato"], "title": "Multi-User Covert Communications via Intelligent Spectrum Control", "comment": "5 pages, 5 figures, journal article", "summary": "This paper investigates the performance of multi-user covert communications over a fixed bandwidth in a multi-cell scenario with both eavesdroppers and malicious jammers. We propose an intelligent spectrum control (ISC) scheme that combines high-accuracy spectrum sensing with AI-assisted real-time decision-making to generate time-frequency dynamic occupation patterns for multiple legitimate users. The scheme can proactively avoid external interference and intra-system co-channel collisions, thereby improving covertness and reliability. Within this framework, we derive closed-form expressions for the detection error probability (DEP) of the eavesdropper and the reliable transmission probability (RTP) of legitimate users under multi-user joint detection. We then analytically optimize the transmission power that can maximize the covert rate (CR), as well as the maximum number of users that can access the system covertly and concurrently under given covertness and reliability constraints. Simulation results confirm the tight match between the analytical and Monte Carlo curves, and show that the proposed scheme can achieve a higher DEP, a larger RTP, and a greater multi-user capacity than the benchmark scheme."}
{"id": "2601.05292", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05292", "abs": "https://arxiv.org/abs/2601.05292", "authors": ["Jingyi Wang", "Fanggang Wang"], "title": "Secure Communication via Modulation Order Confusion", "comment": null, "summary": "With the increasing threat posed by modulation classification to wireless security, this paper proposes a secure communication framework based on modulation order confusion (MOC), which intentionally disguises the original modulation as a higher- or lower-order one to mislead eavesdroppers. For single-antenna systems, two schemes are developed: symbol random mapping and symbol time diversity, enabling modulation order confusion with customized receivers. For multi-antenna systems, receiver-transparent MOC schemes are proposed, including series-expansion-based and constellation-path-based signal designs, and are further extended to RIS-assisted systems with joint beamformer and RIS reflection design. Numerical results show that the proposed schemes effectively defeat both deep-learning-based and expert-knowledge-based modulation classifiers without degrading communication performance."}
{"id": "2601.05340", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05340", "abs": "https://arxiv.org/abs/2601.05340", "authors": ["Roxana Smarandache", "David G. M. Mitchell"], "title": "The Number of Cycles of Bi-regular Tanner Graphs in Terms of the Eigenvalues of the Adjacency Matrix", "comment": "25 pages, submitted to IT Transactions", "summary": "In this paper, we explore new connections between the cycles in the graph of low-density parity-check (LDPC) codes and the eigenvalues of the corresponding adjacency matrix. The resulting observations are used to derive fast, simple, recursive formulas for the number of cycles $N_{2k}$ of length $2k$, $k<g$, in a bi-regular graph of girth $g$. Moreover, we derive explicit formulas for $N_{2k}$, $k\\leq 7$, in terms of the nonzero eigenvalues of the adjacency matrix. Throughout, we focus on the practically interesting class of bi-regular quasi-cyclic LDPC (QC-LDPC) codes, for which the eigenvalues can be obtained efficiently by applying techniques used for block-circulant matrices."}
{"id": "2601.05665", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2601.05665", "abs": "https://arxiv.org/abs/2601.05665", "authors": ["Kathrin Elmenhorst", "Nils Aschenbruck"], "title": "2BRobust -- Overcoming TCP BBR Performance Degradation in Virtual Machines under CPU Contention", "comment": "under review", "summary": "Motivated by the recent introduction and large-scale deployment of BBR congestion control algorithms, multiple studies have investigated the performance and fairness implications of this shift from loss-based to delay-based congestion control. Given the potential Internet-wide adoption of BBR, we must also consider its robustness in network and system scenarios. One such scenario is Cloud-based Virtual Machine (VM) networking - highly relevant in today's CDN-centric Internet. Interestingly, previous work has shown significant performance problems of BBRv1-2 running in Xen VMs, with BBR performance dropping to almost zero when CPU credit is low. In this paper, we develop a framework for measuring TCP throughput under fully controlled CPU contention, which uses Linux deadline scheduling to emulate generalized CPU contention conditions. Our measurements reveal that - in stark contrast to Cubic! - BBR throughput can break down during CPU contention under any hypervisor and all tested BDP conditions. Characterizing this performance degradation on a fine-granular level, we show that CPU limited BBR senders are capped at very low throughput levels below 10-20 Mbps. This finding implies that an Internet-wide shift from Cubic to BBR could harm the Internet's overall robustness, if not deployed with caution. To detect and overcome CPU-limited throughput, we propose a minimal BBR patch which detects the problematic situation by monitoring inflight bytes and reacts by increasing the pacing rate to make better use of the available CPU time. We show that our BBR patch overcomes the throughput problem for the most critical cases."}
{"id": "2601.05276", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05276", "abs": "https://arxiv.org/abs/2601.05276", "authors": ["Nicholas R. Rasmussen", "Rodrigue Rizk", "Longwei Wang", "Arun Singh", "KC Santosh"], "title": "Channel Selected Stratified Nested Cross Validation for Clinically Relevant EEG Based Parkinsons Disease Detection", "comment": "Submitted to IEEE Conference -> posting to Arxiv as normal", "summary": "The early detection of Parkinsons disease remains a critical challenge in clinical neuroscience, with electroencephalography offering a noninvasive and scalable pathway toward population level screening. While machine learning has shown promise in this domain, many reported results suffer from methodological flaws, most notably patient level data leakage, inflating performance estimates and limiting clinical translation. To address these modeling pitfalls, we propose a unified evaluation framework grounded in nested cross validation and incorporating three complementary safeguards: (i) patient level stratification to eliminate subject overlap and ensure unbiased generalization, (ii) multi layered windowing to harmonize heterogeneous EEG recordings while preserving temporal dynamics, and (iii) inner loop channel selection to enable principled feature reduction without information leakage. Applied across three independent datasets with a heterogeneous number of channels, a convolutional neural network trained under this framework achieved 80.6% accuracy and demonstrated state of the art performance under held out population block testing, comparable to other methods in the literature. This performance underscores the necessity of nested cross validation as a safeguard against bias and as a principled means of selecting the most relevant information for patient level decisions, providing a reproducible foundation that can extend to other biomedical signal analysis domains."}
{"id": "2601.05293", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05293", "abs": "https://arxiv.org/abs/2601.05293", "authors": ["Sahaya Jestus Lazer", "Kshitiz Aryal", "Maanak Gupta", "Elisa Bertino"], "title": "A Survey of Agentic AI and Cybersecurity: Challenges, Opportunities and Use-case Prototypes", "comment": null, "summary": "Agentic AI marks an important transition from single-step generative models to systems capable of reasoning, planning, acting, and adapting over long-lasting tasks. By integrating memory, tool use, and iterative decision cycles, these systems enable continuous, autonomous workflows in real-world environments. This survey examines the implications of agentic AI for cybersecurity. On the defensive side, agentic capabilities enable continuous monitoring, autonomous incident response, adaptive threat hunting, and fraud detection at scale. Conversely, the same properties amplify adversarial power by accelerating reconnaissance, exploitation, coordination, and social-engineering attacks. These dual-use dynamics expose fundamental gaps in existing governance, assurance, and accountability mechanisms, which were largely designed for non-autonomous and short-lived AI systems. To address these challenges, we survey emerging threat models, security frameworks, and evaluation pipelines tailored to agentic systems, and analyze systemic risks including agent collusion, cascading failures, oversight evasion, and memory poisoning. Finally, we present three representative use-case implementations that illustrate how agentic AI behaves in practical cybersecurity workflows, and how design choices shape reliability, safety, and operational effectiveness."}
{"id": "2601.05395", "categories": ["eess.SY", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.05395", "abs": "https://arxiv.org/abs/2601.05395", "authors": ["Janina Schaa", "Thomas Berger"], "title": "Data-Based Analysis of Relative Degree and Zero Dynamics in Linear Systems", "comment": "43 pages, submitted to MCSS", "summary": "Data-driven control offers a powerful alternative to traditional model-based methods, particularly when accurate system models are unavailable or prohibitively complex. While existing data-driven control methods primarily aim to construct controllers directly from measured data, our approach uses the available data to assess fundamental system-theoretic properties. This allows the informed selection of suitable control strategies without explicit model identification. We provide data-based conditions characterizing the (vector) relative degree and the stability of the zero dynamics, which are critical for ensuring proper performance of modern controllers. Our results cover both single- and multi-input/output settings of discrete-time linear systems. We further show how a continuous-time system can be reconstructed from three sampling discretizations obtained via Zero-order Hold at suitable sampling times, thus allowing the extension of the results to the combined data collected from these discretizations. All results can be applied directly to observed data sets using the proposed algorithms."}
{"id": "2601.05296", "categories": ["cs.LG", "cs.AI", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.05296", "abs": "https://arxiv.org/abs/2601.05296", "authors": ["Jiyuan Zhang", "Yining Liu", "Siqi Yan", "Lisen Deng", "Jennifer Cao", "Shuqi Yang", "Min Ni", "Bi Xue", "Shen Li"], "title": "MoEBlaze: Breaking the Memory Wall for Efficient MoE Training on Modern GPUs", "comment": null, "summary": "The pervasive \"memory wall\" bottleneck is significantly amplified in modern large-scale Mixture-of-Experts (MoE) architectures. MoE's inherent architectural sparsity leads to sparse arithmetic compute and also introduces substantial activation memory overheads -- driven by large token routing buffers and the need to materialize and buffer intermediate tensors. This memory pressure limits the maximum batch size and sequence length that can fit on GPUs, and also results in excessive data movements that hinders performance and efficient model scaling. We present MoEBlaze, a memory-efficient MoE training framework that addresses these issues through a co-designed system approach: (i) an end-to-end token dispatch and MoE training method with optimized data structures to eliminate intermediate buffers and activation materializing, and (ii) co-designed kernels with smart activation checkpoint to mitigate memory footprint while simultaneously achieving better performance. We demonstrate that MoEBlaze can achieve over 4x speedups and over 50% memory savings compared to existing MoE frameworks."}
{"id": "2601.05581", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05581", "abs": "https://arxiv.org/abs/2601.05581", "authors": ["Chao Liu", "Hao Chen", "Qinqin Ji", "Ziyan Xie", "Dabin Zheng"], "title": "Strong Singleton-Like Bounds, Quasi-Perfect Codes and Distance-Optimal Codes in the Sum-Rank Metric", "comment": "20 pages", "summary": "Codes in the sum-rank metric have received many attentions in recent years, since they have wide applications in the multishot network coding, the space-time coding and the distributed storage. In this paper, by constructing covering codes in the sum-rank metric from covering codes in the Hamming metric, we derive new upper bounds on sizes, the covering radii and the block length functions of codes in the sum-rank metric. As applications, we present several strong Singleton-like bounds that are tighter than the classical Singleton-like bound when block lengths are large. In addition, we give the explicit constructions of the distance-optimal sum-rank codes of matrix sizes $s\\times s$ and $2\\times 2$ with minimum sum-rank distance four respectively by using cyclic codes in the Hamming metric. More importantly, we present an infinite families of quasi-perfect $q$-ary sum-rank codes with matrix sizes $2\\times m$. Furthermore, we construct almost MSRD codes with larger block lengths and demonstrate how the Plotkin sum can be used to give more distance-optimal sum-rank codes."}
{"id": "2601.05978", "categories": ["cs.NI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05978", "abs": "https://arxiv.org/abs/2601.05978", "authors": ["Dror Jacoby", "Yanzhi Li", "Shuyue Yu", "Nicola Di Cicco", "Hagit Messer", "Gil Zussman", "Igor Kadota"], "title": "AWaRe-SAC: Proactive Slice Admission Control under Weather-Induced Capacity Uncertainty", "comment": null, "summary": "As emerging applications demand higher throughput and lower latencies, operators are increasingly deploying millimeter-wave (mmWave) links within x-haul transport networks, spanning fronthaul, midhaul, and backhaul segments. However, the inherent susceptibility of mmWave frequencies to weather-related attenuation, particularly rain fading, complicates the maintenance of stringent Quality of Service (QoS) requirements. This creates a critical challenge: making admission decisions under uncertainty regarding future network capacity. To address this, we develop a proactive slice admission control framework for mmWave x-haul networks subject to rain-induced fluctuations. Our objective is to improve network performance, ensure QoS, and optimize revenue, thereby surpassing the limitations of standard reactive approaches. The proposed framework integrates a deep learning predictor of future network conditions with a proactive Q-learning-based slice admission control mechanism. We validate our solution using real-world data from a mmWave x-haul deployment in a dense urban area, incorporating realistic models of link capacity attenuation and dynamic slice demands. Extensive evaluations demonstrate that our proactive solution achieves 2-3x higher long-term average revenue under dynamic link conditions, providing a scalable and resilient framework for adaptive admission control."}
{"id": "2601.05323", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05323", "abs": "https://arxiv.org/abs/2601.05323", "authors": ["Mohammad Ali Vahedifar", "Qi Zhang"], "title": "Discrete Mode Decomposition Meets Shapley Value: Robust Signal Prediction in Tactile Internet", "comment": "This paper has been accepted at IEEE INFOCOM 2026", "summary": "Tactile Internet (TI) requires ultra-low latency and high reliability to ensure stability and transparency in touch-enabled teleoperation. However, variable delays and packet loss present significant challenges to maintaining immersive haptic communication. To address this, we propose a predictive framework that integrates Discrete Mode Decomposition (DMD) with Shapley Mode Value (SMV) for accurate and timely haptic signal prediction. DMD decomposes haptic signals into interpretable intrinsic modes, while SMV evaluates each mode's contribution to prediction accuracy, which is well-aligned with the goal-oriented semantic communication. Integrating SMV with DMD further accelerates inference, enabling efficient communication and smooth teleoperation even under adverse network conditions.\n  Extensive experiments show that DMD+SMV, combined with a Transformer architecture, outperforms baseline methods significantly. It achieves 98.9% accuracy for 1-sample prediction and 92.5% for 100-sample prediction, as well as extremely low inference latency: 0.056 ms and 2 ms, respectively. These results demonstrate that the proposed framework has strong potential to ease the stringent latency and reliability requirements of TI without compromising performance, highlighting its feasibility for real-world deployment in TI systems."}
{"id": "2601.05339", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05339", "abs": "https://arxiv.org/abs/2601.05339", "authors": ["Badhan Chandra Das", "Md Tasnim Jawad", "Joaquin Molto", "M. Hadi Amini", "Yanzhao Wu"], "title": "Multi-turn Jailbreaking Attack in Multi-Modal Large Language Models", "comment": null, "summary": "In recent years, the security vulnerabilities of Multi-modal Large Language Models (MLLMs) have become a serious concern in the Generative Artificial Intelligence (GenAI) research. These highly intelligent models, capable of performing multi-modal tasks with high accuracy, are also severely susceptible to carefully launched security attacks, such as jailbreaking attacks, which can manipulate model behavior and bypass safety constraints. This paper introduces MJAD-MLLMs, a holistic framework that systematically analyzes the proposed Multi-turn Jailbreaking Attacks and multi-LLM-based defense techniques for MLLMs. In this paper, we make three original contributions. First, we introduce a novel multi-turn jailbreaking attack to exploit the vulnerabilities of the MLLMs under multi-turn prompting. Second, we propose a novel fragment-optimized and multi-LLM defense mechanism, called FragGuard, to effectively mitigate jailbreaking attacks in the MLLMs. Third, we evaluate the efficacy of the proposed attacks and defenses through extensive experiments on several state-of-the-art (SOTA) open-source and closed-source MLLMs and benchmark datasets, and compare their performance with the existing techniques."}
{"id": "2601.05408", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.05408", "abs": "https://arxiv.org/abs/2601.05408", "authors": ["Sumit S. Kamat", "Ajin Sunny", "T. Michael Seigler", "Jesse B. Hoagg"], "title": "Experimental Demonstration of a Decentralized Electromagnetic Formation Flying Control Using Alternating Magnetic Field Forces", "comment": "Preprint submitted to Aerospace Science and Technology (Elsevier)", "summary": "Electromagnetic formation flying (EMFF) is challenging due to the complex coupling between the electromagnetic fields generated by each satellite in the formation. To address this challenge, this article uses alternating magnetic field forces (AMFF) to decouple the electromagnetic forces between each pair of satellites. Each satellite's electromagnetic actuation system is driven by a sum of amplitude-modulated sinusoids, where amplitudes are controlled to achieve desired forces between each pair of satellites. The main contribution of this article is a 3-satellite experimental demonstration of decentralized closed-loop EMFF using AMFF. To our knowledge, this is the first demonstration of AMFF with at least 3 satellites in open or closed loop. This is noteworthy because the coupling challenges of EMFF are only present with more than 2 satellites, and thus, a formation of at least 3 is necessary to evaluate the effectiveness of AMFF. The experiments are conducted on a ground-based testbed consisting of 3 electromagnetically actuated satellites on linear air tracks. The closed-loop experimental results are compared with behavior from numerical simulations."}
{"id": "2601.05300", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.05300", "abs": "https://arxiv.org/abs/2601.05300", "authors": ["Susmit Das"], "title": "TIME: Temporally Intelligent Meta-reasoning Engine for Context Triggered Explicit Reasoning", "comment": "14 pages, 3 figures with 27 page appendix. See https://github.com/The-Coherence-Initiative/TIME and https://github.com/The-Coherence-Initiative/TIMEBench for associated code", "summary": "Reasoning oriented large language models often expose explicit \"thinking\" as long, turn-global traces at the start of every response, either always on or toggled externally at inference time. While useful for arithmetic, programming, and problem solving, this design is costly, blurs claim level auditability, and cannot re-trigger explicit reasoning once the model begins presenting. Dialogue models are also largely blind to temporal structure, treating replies after seconds and replies after weeks as equivalent unless time is stated in text. We introduce TIME, the Temporally Intelligent Meta-reasoning Engine, a behavioral alignment framework that treats explicit reasoning as a context sensitive resource driven by discourse and temporal cues. TIME augments dialogue with optional ISO 8601 <time> tags, tick turns that represent silent gaps, and short <think> blocks that can appear anywhere in a reply. A four-phase curriculum including a small, maximally diverse full-batch alignment step trains Qwen3 dense models to invoke brief, in-place reasoning bursts and keep user facing text compact. We evaluate with TIMEBench, a temporally grounded dialogue benchmark probing chronology, commonsense under gaps and offsets, anomaly detection, and continuity. Across 4B to 32B scales, TIME improves TIMEBench scores over base Qwen3 in both thinking and no-thinking modes while reducing reasoning tokens by about an order of magnitude. Our training data and code are available at https://github.com/The-Coherence-Initiative/TIME and TIMEBench is available at https://github.com/The-Coherence-Initiative/TIMEBench"}
{"id": "2601.05636", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05636", "abs": "https://arxiv.org/abs/2601.05636", "authors": ["Avraham Kreindel", "Isaac Barouch Essayag", "Aryeh Lev Zabokritskiy"], "title": "Multiset Deletion-Correcting Codes: Bounds and Constructions", "comment": "24 pages", "summary": "We study error-correcting codes in the space $\\mathcal{S}_{n,q}$ of length-$n$ multisets over a $q$-ary alphabet, motivated by permutation channels in which ordering is completely lost and errors act solely by deletions of symbols, i.e., by reducing symbol multiplicities.\n  Our focus is on the \\emph{extremal deletion regime}, where the channel output contains $k=n-t$ symbols. In this regime, we establish tight or near-tight bounds on the maximum code size. In particular, we determine the exact optimal code sizes for $t=n-1$ and for $t=n-2$, develop a refined analysis for $t=n-3$, and derive a general recursive puncturing upper bound for $t=n-k$ via a reduction from parameters $(n,k)$ to $(n-1,k-1)$.\n  On the constructive side, we completely resolve the binary multiset model: for all $t\\ge1$ we determine $S_2(n,t)$ exactly and give an explicit optimal congruence-based construction. We then study single-deletion codes beyond the binary case, presenting general $q$-ary constructions and showing, via explicit small-parameter examples, that the natural modular construction need not be optimal for $q\\ge3$. Finally, we present an explicit cyclic Sidon-type linear construction for general $(q,t)$ based on a single congruence constraint, with redundancy $\\log_q\\!\\bigl(t(t+1)^{q-2}+1\\bigr)$ and encoding and decoding complexity linear in the blocklength $n$."}
{"id": "2601.05440", "categories": ["eess.SP", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.05440", "abs": "https://arxiv.org/abs/2601.05440", "authors": ["William Bjorndahl", "Mark O'Hair", "Ben Zoghi", "Joseph Camp"], "title": "SPARK: Sparse Parametric Antenna Representation using Kernels", "comment": "Accepted to IEEE INFOCOM 2026", "summary": "Channel state information (CSI) acquisition and feedback overhead grows with the number of antennas, users, and reported subbands. This growth becomes a bottleneck for many antenna and reconfigurable intelligent surface (RIS) systems as arrays and user densities scale. Practical CSI feedback and beam management rely on codebooks, where beams are selected via indices rather than explicitly transmitting radiation patterns. Hardware-aware operation requires an explicit representation of the measured antenna/RIS response, yet high-fidelity measured patterns are high-dimensional and costly to handle. We present SPARK (Sparse Parametric Antenna Representation using Kernels), a training-free compression model that decomposes patterns into a smooth global base and sparse localized lobes. For 3D patterns, SPARK uses low-order spherical harmonics for global directivity and anisotropic Gaussian kernels for localized features. For RIS 1D azimuth cuts, it uses a Fourier-series base with 1D Gaussians. On patterns from the AERPAW testbed and a public RIS dataset, SPARK achieves up to 2.8$\\times$ and 10.4$\\times$ reductions in reconstruction MSE over baselines, respectively. Simulation shows that amortizing a compact pattern description and reporting sparse path descriptors can produce 12.65% mean uplink goodput gain under a fixed uplink budget. Overall, SPARK turns dense patterns into compact, parametric models for scalable, hardware-aware beam management."}
{"id": "2601.05440", "categories": ["eess.SP", "cs.NI"], "pdf": "https://arxiv.org/pdf/2601.05440", "abs": "https://arxiv.org/abs/2601.05440", "authors": ["William Bjorndahl", "Mark O'Hair", "Ben Zoghi", "Joseph Camp"], "title": "SPARK: Sparse Parametric Antenna Representation using Kernels", "comment": "Accepted to IEEE INFOCOM 2026", "summary": "Channel state information (CSI) acquisition and feedback overhead grows with the number of antennas, users, and reported subbands. This growth becomes a bottleneck for many antenna and reconfigurable intelligent surface (RIS) systems as arrays and user densities scale. Practical CSI feedback and beam management rely on codebooks, where beams are selected via indices rather than explicitly transmitting radiation patterns. Hardware-aware operation requires an explicit representation of the measured antenna/RIS response, yet high-fidelity measured patterns are high-dimensional and costly to handle. We present SPARK (Sparse Parametric Antenna Representation using Kernels), a training-free compression model that decomposes patterns into a smooth global base and sparse localized lobes. For 3D patterns, SPARK uses low-order spherical harmonics for global directivity and anisotropic Gaussian kernels for localized features. For RIS 1D azimuth cuts, it uses a Fourier-series base with 1D Gaussians. On patterns from the AERPAW testbed and a public RIS dataset, SPARK achieves up to 2.8$\\times$ and 10.4$\\times$ reductions in reconstruction MSE over baselines, respectively. Simulation shows that amortizing a compact pattern description and reporting sparse path descriptors can produce 12.65% mean uplink goodput gain under a fixed uplink budget. Overall, SPARK turns dense patterns into compact, parametric models for scalable, hardware-aware beam management."}
{"id": "2601.05445", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05445", "abs": "https://arxiv.org/abs/2601.05445", "authors": ["Songze Li", "Ruishi He", "Xiaojun Jia", "Jun Wang", "Zhihui Fu"], "title": "Knowledge-Driven Multi-Turn Jailbreaking on Large Language Models", "comment": null, "summary": "Large Language Models (LLMs) face a significant threat from multi-turn jailbreak attacks, where adversaries progressively steer conversations to elicit harmful outputs. However, the practical effectiveness of existing attacks is undermined by several critical limitations: they struggle to maintain a coherent progression over long interactions, often losing track of what has been accomplished and what remains to be done; they rely on rigid or pre-defined patterns, and fail to adapt to the LLM's dynamic and unpredictable conversational state. To address these shortcomings, we introduce Mastermind, a multi-turn jailbreak framework that adopts a dynamic and self-improving approach. Mastermind operates in a closed loop of planning, execution, and reflection, enabling it to autonomously build and refine its knowledge of model vulnerabilities through interaction. It employs a hierarchical planning architecture that decouples high-level attack objectives from low-level tactical execution, ensuring long-term focus and coherence. This planning is guided by a knowledge repository that autonomously discovers and refines effective attack patterns by reflecting on interactive experiences. Mastermind leverages this accumulated knowledge to dynamically recombine and adapt attack vectors, dramatically improving both effectiveness and resilience. We conduct comprehensive experiments against state-of-the-art models, including GPT-5 and Claude 3.7 Sonnet. The results demonstrate that Mastermind significantly outperforms existing baselines, achieving substantially higher attack success rates and harmfulness ratings. Moreover, our framework exhibits notable resilience against multiple advanced defense mechanisms."}
{"id": "2601.05490", "categories": ["eess.SY", "econ.EM", "stat.OT"], "pdf": "https://arxiv.org/pdf/2601.05490", "abs": "https://arxiv.org/abs/2601.05490", "authors": ["Joseph Nyangon", "Brecht Seifi"], "title": "How Carbon Border Adjustment Mechanism is Energizing the EU Carbon Market and Industrial Transformation", "comment": "17 Pages; 4 Figures", "summary": "The global carbon market is fragmented and characterized by limited pricing transparency and empirical evidence, creating challenges for investors and policymakers in identifying carbon management opportunities. The European Union is among several regions that have implemented emissions pricing through an Emissions Trading System (EU ETS). While the EU ETS has contributed to emissions reductions, it has also raised concerns related to international competitiveness and carbon leakage, particularly given the strong integration of EU industries into global value chains. To address these challenges, the European Commission proposed the Carbon Border Adjustment Mechanism (CBAM) in 2021. CBAM is designed to operate alongside the EU ETS by applying a carbon price to selected imported goods, thereby aligning carbon costs between domestic and foreign producers. It will gradually replace existing carbon leakage mitigation measures, including the allocation of free allowances under the EU ETS. The initial scope of CBAM covers electricity, cement, fertilizer, aluminium, iron, and steel. As climate policies intensify under the Paris Agreement, CBAM-like mechanisms are expected to play an increasingly important role in managing carbon-related trade risks and supporting the transition to net zero emissions."}
{"id": "2601.05304", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.05304", "abs": "https://arxiv.org/abs/2601.05304", "authors": ["Jaehong Oh"], "title": "Ontology Neural Networks for Topologically Conditioned Constraint Satisfaction", "comment": "12 pages, 11 figures", "summary": "Neuro-symbolic reasoning systems face fundamental challenges in maintaining semantic coherence while satisfying physical and logical constraints. Building upon our previous work on Ontology Neural Networks, we present an enhanced framework that integrates topological conditioning with gradient stabilization mechanisms. The approach employs Forman-Ricci curvature to capture graph topology, Deep Delta Learning for stable rank-one perturbations during constraint projection, and Covariance Matrix Adaptation Evolution Strategy for parameter optimization. Experimental evaluation across multiple problem sizes demonstrates that the method achieves mean energy reduction to 1.15 compared to baseline values of 11.68, with 95 percent success rate in constraint satisfaction tasks. The framework exhibits seed-independent convergence and graceful scaling behavior up to twenty-node problems, suggesting that topological structure can inform gradient-based optimization without sacrificing interpretability or computational efficiency."}
{"id": "2601.05652", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05652", "abs": "https://arxiv.org/abs/2601.05652", "authors": ["Irina Bocharova", "Maiara F. Bollauf", "Boris Kudryashov"], "title": "Coset Shaping for Coded Modulation", "comment": "Paper accepted for presentation at the 2026 International Zurich Seminar on Information and Communication (IZS 2026)", "summary": "A new shaping technique called coset shaping for coded QAM and PAM signaling is introduced and analyzed. This technique can be applied not only to information bits but also to parity bits without incurring additional complexity costs. It is proven that as the length of the error-correcting code and the modulation order tend to infinity, the gap to capacity for the proposed shaping scheme can be made arbitrarily small. Numerical results and comparisons for the shaping scheme, along with nonbinary LDPC-coded QAM signaling, are presented."}
{"id": "2601.05983", "categories": ["cs.IT", "cs.NI", "cs.SI", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05983", "abs": "https://arxiv.org/abs/2601.05983", "authors": ["Arunabh Srivastava", "Sennur Ulukus"], "title": "Age of Gossip With Cellular Drone Mobility", "comment": null, "summary": "We consider a cellular network containing $n$ nodes where nodes within a cell gossip with each other in a fully-connected fashion and a source shares updates with these nodes via a mobile drone. The mobile drone receives updates directly from the source and shares them with nodes in the cell where it currently resides. The drone moves between cells according to an underlying continuous-time Markov chain (CTMC). In this work, we evaluate the impact of the number of cells $f(n)$, drone speed $λ_m(n)$ and drone dissemination rate $λ_d(n)$ on the freshness of information of nodes in the network. We utilize the version age of information metric to quantify the freshness of information. We observe that the expected duration between two drone-to-cell service times depends on the stationary distribution of the underlying CTMC and $λ_d(n)$, but not on $λ_m(n)$. However, the version age instability in slow moving CTMCs makes high probability analysis for a general underlying CTMC difficult. Therefore, next we focus on the fully-connected drone mobility model. Under this model, we uncover a dual-bottleneck between drone mobility and drone dissemination speed: the version age is constrained by the slower of these two processes. If $λ_d(n) \\gg λ_m(n)$, then the version age scaling of nodes is dominated by the inverse of $λ_m(n)$ and is independent of $λ_d(n)$. If $λ_m(n) \\gg λ_d(n)$, then the version age scaling of nodes is dominated by the inverse of $λ_d(n)$ and is independent of $λ_m(n)$."}
{"id": "2601.05676", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05676", "abs": "https://arxiv.org/abs/2601.05676", "authors": ["Guangqi Shi", "Kimitaka Sumi", "Takuya Sakamoto"], "title": "Deformation-Aware Observation Modeling for Radar-Based Human Sensing via 3D Scan-Depth Sequence Fusion", "comment": "10 pages, 8 figures, and 5 tables. This work is going to be submitted to the IEEE for possible publication", "summary": "Non-contact radar-based human sensing is often interpreted using simplified motion assumptions. However, respiration induces non-rigid surface deformation of the human body that impacts electromagnetic wave scattering and can degrade the robustness of measurements. To address this, we propose a surface-deformation-aware observation model for radar-based human sensing that fuses static high-resolution three-dimensional scanner measurements with temporal depth camera data to represent time-varying human surface geometry. Non-rigid registration using the coherent point drift algorithm is employed to align a static template with dynamic depth frames. Frame-wise electromagnetic scattering is subsequently computed using the physical optics approximation, allowing the reconstruction of intermediate-frequency radar signals that emulate radar observations. Validation against experimental radar data demonstrated that the proposed model exhibited greater robustness than a depth-sequence-only model under low-signal-quality conditions involving complex surface dynamics and multiple reflective sites. For two participants, the proposed model achieved higher Pearson correlation coefficients of 0.943 and 0.887 between model-derived and experimentally measured displacement waveforms, compared with 0.868 and 0.796 for the depth-sequence-only model. Furthermore, in a favorable case characterized by a single relatively-stationary reflective site, the proposed method achieved a correlation coefficient of 0.789 between model-derived and experimentally measured in-phase-quadrature magnitude variations. These results suggest that our sensor-fusion-based deformation-aware observation modeling can realistically reproduce radar observations and provide physically grounded insights into the interpretation of radar measurement variations."}
{"id": "2601.05466", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05466", "abs": "https://arxiv.org/abs/2601.05466", "authors": ["Zhaoqi Wang", "Zijian Zhang", "Daqing He", "Pengtao Kou", "Xin Li", "Jiamou Liu", "Jincheng An", "Yong Liu"], "title": "Jailbreaking Large Language Models through Iterative Tool-Disguised Attacks via Reinforcement Learning", "comment": null, "summary": "Large language models (LLMs) have demonstrated remarkable capabilities across diverse applications, however, they remain critically vulnerable to jailbreak attacks that elicit harmful responses violating human values and safety guidelines. Despite extensive research on defense mechanisms, existing safeguards prove insufficient against sophisticated adversarial strategies. In this work, we propose iMIST (\\underline{i}nteractive \\underline{M}ulti-step \\underline{P}rogre\\underline{s}sive \\underline{T}ool-disguised Jailbreak Attack), a novel adaptive jailbreak method that synergistically exploits vulnerabilities in current defense mechanisms. iMIST disguises malicious queries as normal tool invocations to bypass content filters, while simultaneously introducing an interactive progressive optimization algorithm that dynamically escalates response harmfulness through multi-turn dialogues guided by real-time harmfulness assessment. Our experiments on widely-used models demonstrate that iMIST achieves higher attack effectiveness, while maintaining low rejection rates. These results reveal critical vulnerabilities in current LLM safety mechanisms and underscore the urgent need for more robust defense strategies."}
{"id": "2601.05519", "categories": ["eess.SY", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05519", "abs": "https://arxiv.org/abs/2601.05519", "authors": ["Luis A. Garcia-Reyes", "Oriol Gomis-Bellmunt", "Eduardo Prieto-Araujo", "Vinícius A. Lacerda", "Marc Cheah-Mañe"], "title": "SIaD-Tool: A Comprehensive Frequency-Domain Tool for Small-Signal Stability and Interaction Assessment in Modern Power Systems", "comment": "IEEE Transactions on Power Delivery", "summary": "This paper presents SIaD-Tool, an open-source frequency-domain (FD) scanning solution for stability and interaction assessment in modern power systems. The tool enables multi-sequence identification in the abc, dq0, and 0pn frames and supports both series voltage and parallel current perturbation strategies. A novel perturbation scheme allows direct scanning in the target frame, simplifying the analysis of coupling effects and mirrored frequencies. SIaD-Tool is implemented on a multi-platform architecture, including MATLAB/Simulink and Python-PSCAD/EMTDC. Beyond system identification, it integrates automated stability evaluation through four standardized methods: Generalized Nyquist Criterion (GNC), modal impedance analysis, phase margin assessment, and passivity checks. Validation is carried out via extensive case studies involving passive elements, grid-following and grid-forming converters, offshore wind power plants, and the IEEE 9-bus system. Results confirm high accuracy, scalability, and robustness in detecting critical modes, interaction frequencies, oscillatory behavior, and stability margins."}
{"id": "2601.05352", "categories": ["cs.LG", "cs.CR", "cs.IR", "cs.SI"], "pdf": "https://arxiv.org/pdf/2601.05352", "abs": "https://arxiv.org/abs/2601.05352", "authors": ["Tianrun Yu", "Kaixiang Zhao", "Cheng Zhang", "Anjun Gao", "Yueyang Quan", "Zhuqing Liu", "Minghong Fang"], "title": "When the Server Steps In: Calibrated Updates for Fair Federated Learning", "comment": null, "summary": "Federated learning (FL) has emerged as a transformative distributed learning paradigm, enabling multiple clients to collaboratively train a global model under the coordination of a central server without sharing their raw training data. While FL offers notable advantages, it faces critical challenges in ensuring fairness across diverse demographic groups. To address these fairness concerns, various fairness-aware debiasing methods have been proposed. However, many of these approaches either require modifications to clients' training protocols or lack flexibility in their aggregation strategies. In this work, we address these limitations by introducing EquFL, a novel server-side debiasing method designed to mitigate bias in FL systems. EquFL operates by allowing the server to generate a single calibrated update after receiving model updates from the clients. This calibrated update is then integrated with the aggregated client updates to produce an adjusted global model that reduces bias. Theoretically, we establish that EquFL converges to the optimal global model achieved by FedAvg and effectively reduces fairness loss over training rounds. Empirically, we demonstrate that EquFL significantly mitigates bias within the system, showcasing its practical effectiveness."}
{"id": "2601.05655", "categories": ["cs.IT", "physics.optics"], "pdf": "https://arxiv.org/pdf/2601.05655", "abs": "https://arxiv.org/abs/2601.05655", "authors": ["Stella Civelli", "Marco Secondini", "Luca Potì"], "title": "Nonlinearity Mitigation for Coherent Ground-to-Satellite Optical Links", "comment": "The paper has been accepted for poster presentation at the optical fiber communication (OFC) conference 2026", "summary": "We propose digital signal processing techniques for nonlinearity mitigation in high power optical amplifiers used in satellite communications. The acceptable link loss increases by 6dB with negligible complexity."}
{"id": "2601.05920", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05920", "abs": "https://arxiv.org/abs/2601.05920", "authors": ["Meiwen Men", "Tao Zhou", "Kaifeng Bao", "Zhiyang Guo", "Yongning Qi", "Liu Liu", "Bo Ai"], "title": "A Novel Deep Learning-Based Coarse-to-Fine Frame Synchronization Method for OTFS Systems", "comment": null, "summary": "Orthogonal time frequency space (OTFS) modulation is a robust candidate waveform for future wireless systems, particularly in high-mobility scenarios, as it effectively mitigates the impact of rapidly time-varying channels by mapping symbols in the delay-Doppler (DD) domain. However, accurate frame synchronization in OTFS systems remains a challenge due to the performance limitations of conventional algorithms. To address this, we propose a low-complexity synchronization method based on a coarse-to-fine deep residual network (ResNet) architecture. Unlike traditional approaches relying on high-overhead preamble structures, our method exploits the intrinsic periodic features of OTFS pilots in the delay-time (DT) domain to formulate synchronization as a hierarchical classification problem. Specifically, the proposed architecture employs a two-stage strategy to first narrow the search space and then pinpoint the precise symbol timing offset (STO), thereby significantly reducing computational complexity while maintaining high estimation accuracy. We construct a comprehensive simulation dataset incorporating diverse channel models and randomized STO to validate the method. Extensive simulation results demonstrate that the proposed method achieves robust signal start detection and superior accuracy compared to conventional benchmarks, particularly in low signal-to-noise ratio (SNR) regimes and high-mobility scenarios."}
{"id": "2601.05504", "categories": ["cs.CR", "cs.MA"], "pdf": "https://arxiv.org/pdf/2601.05504", "abs": "https://arxiv.org/abs/2601.05504", "authors": ["Balachandra Devarangadi Sunil", "Isheeta Sinha", "Piyush Maheshwari", "Shantanu Todmal", "Shreyan Malik", "Shuchi Mishra"], "title": "Memory Poisoning Attack and Defense on Memory Based LLM-Agents", "comment": null, "summary": "Large language model agents equipped with persistent memory are vulnerable to memory poisoning attacks, where adversaries inject malicious instructions through query only interactions that corrupt the agents long term memory and influence future responses. Recent work demonstrated that the MINJA (Memory Injection Attack) achieves over 95 % injection success rate and 70 % attack success rate under idealized conditions. However, the robustness of these attacks in realistic deployments and effective defensive mechanisms remain understudied. This work addresses these gaps through systematic empirical evaluation of memory poisoning attacks and defenses in Electronic Health Record (EHR) agents. We investigate attack robustness by varying three critical dimensions: initial memory state, number of indication prompts, and retrieval parameters. Our experiments on GPT-4o-mini, Gemini-2.0-Flash and Llama-3.1-8B-Instruct models using MIMIC-III clinical data reveal that realistic conditions with pre-existing legitimate memories dramatically reduce attack effectiveness. We then propose and evaluate two novel defense mechanisms: (1) Input/Output Moderation using composite trust scoring across multiple orthogonal signals, and (2) Memory Sanitization with trust-aware retrieval employing temporal decay and pattern-based filtering. Our defense evaluation reveals that effective memory sanitization requires careful trust threshold calibration to prevent both overly conservative rejection (blocking all entries) and insufficient filtering (missing subtle attacks), establishing important baselines for future adaptive defense mechanisms. These findings provide crucial insights for securing memory-augmented LLM agents in production environments."}
{"id": "2601.05526", "categories": ["eess.SY", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.05526", "abs": "https://arxiv.org/abs/2601.05526", "authors": ["Yu Zhou", "Andrey Polyakov", "Gang Zheng", "Masaaki Nagahara"], "title": "Discrete Homogeneity and Quantizer Design for Nonlinear Homogeneous Control Systems", "comment": null, "summary": "This paper proposes a framework for analysis of generalized homogeneous control systems under state quantization. In particular, it addresses the challenge of maintaining finite/fixed-time stability of nonlinear systems in the presence of quantized measurements. To analyze the behavior of quantized control system, we introduce a new type of discrete homogeneity, where the dilation is defined by a discrete group. The converse Lyapunov function theorem is established for homogeneous systems with respect to discrete dilations. By extending the notion of sector-boundedness to a homogeneous vector space, we derive a generalized homogeneous sector-boundedness condition that guarantees finite/fixed-time stability of nonlinear control system under quantized measurements. A geometry-aware homogeneous static vector quantizer is then designed using generalized homogeneous coordinates, enabling an efficient quantization scheme. The resulting homogeneous control system with the proposed quantizer is proven to be homogeneous with respect to discrete dilation and globally finite-time, nearly fixed-time, or exponentially stable, depending on the homogeneity degree. Numerical examples validate the effectiveness of the proposed approach."}
{"id": "2601.05353", "categories": ["cs.LG", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05353", "abs": "https://arxiv.org/abs/2601.05353", "authors": ["Shovito Barua Soumma", "Hassan Ghasemzadeh"], "title": "GlyRAG: Context-Aware Retrieval-Augmented Framework for Blood Glucose Forecasting", "comment": null, "summary": "Accurate forecasting of blood glucose from CGM is essential for preventing dysglycemic events, thus enabling proactive diabetes management. However, current forecasting models treat blood glucose readings captured using CGMs as a numerical sequence, either ignoring context or relying on additional sensors/modalities that are difficult to collect and deploy at scale. Recently, LLMs have shown promise for time-series forecasting tasks, yet their role as agentic context extractors in diabetes care remains largely unexplored. To address these limitations, we propose GlyRAG, a context-aware, retrieval-augmented forecasting framework that derives semantic understanding of blood glucose dynamics directly from CGM traces without requiring additional sensor modalities. GlyRAG employs an LLM as a contextualization agent to generate clinical summaries. These summaries are embedded by a language model and fused with patch-based glucose representations in a multimodal transformer architecture with a cross translation loss aligining textual and physiological embeddings. A retrieval module then identifies similar historical episodes in the learned embedding space and uses cross-attention to integrate these case-based analogues prior to making a forecasting inference. Extensive evaluations on two T1D cohorts show that GlyRAG consistently outperforms state-of-the art methods, achieving up to 39% lower RMSE and a further 1.7% reduction in RMSE over the baseline. Clinical evaluation shows that GlyRAG places 85% predictions in safe zones and achieves 51% improvement in predicting dysglycemic events across both cohorts. These results indicate that LLM-based contextualization and retrieval over CGM traces can enhance the accuracy and clinical reliability of long-horizon glucose forecasting without the need for extra sensors, thus supporting future agentic decision-support tools for diabetes management."}
{"id": "2601.05674", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05674", "abs": "https://arxiv.org/abs/2601.05674", "authors": ["Torben Kölle", "Alexander Stutz-Tirri", "Christoph Studer"], "title": "On the Complexity of Electromagnetic Far-Field Modeling", "comment": "Accepted for presentation at the 2026 International Zurich Seminar on Information and Communication", "summary": "Modern wireless systems are envisioned to employ antenna architectures that not only transmit and receive electromagnetic (EM) waves, but also intentionally reflect and possibly transform incident EM waves. In this paper, we propose a mathematically rigorous framework grounded in Maxwell's equations for analyzing the complexity of EM far-field modeling of general antenna architectures. We show that-under physically meaningful assumptions-such antenna architectures exhibit limited complexity, i.e., can be modeled by finite-rank operators using finitely many parameters. Furthermore, we construct a sequence of finite-rank operators whose approximation error decays super-exponentially once the operator rank exceeds an effective bandwidth associated with the antenna architecture and the analysis frequency. These results constitute a fundamental prerequisite for the efficient and accurate modeling of general antenna architectures on digital computing platforms."}
{"id": "2601.05923", "categories": ["eess.SP", "cs.AI", "cs.LG", "eess.IV", "q-bio.QM"], "pdf": "https://arxiv.org/pdf/2601.05923", "abs": "https://arxiv.org/abs/2601.05923", "authors": ["E. Middell", "L. Carlton", "S. Moradi", "T. Codina", "T. Fischer", "J. Cutler", "S. Kelley", "J. Behrendt", "T. Dissanayake", "N. Harmening", "M. A. Yücel", "D. A. Boas", "A. von Lühmann"], "title": "Cedalion Tutorial: A Python-based framework for comprehensive analysis of multimodal fNIRS & DOT from the lab to the everyday world", "comment": "33 pages main manuscript, 180 pages Supplementary Tutorial Notebooks, 12 figures, 6 tables, under review in SPIE Neurophotonics", "summary": "Functional near-infrared spectroscopy (fNIRS) and diffuse optical tomography (DOT) are rapidly evolving toward wearable, multimodal, and data-driven, AI-supported neuroimaging in the everyday world. However, current analytical tools are fragmented across platforms, limiting reproducibility, interoperability, and integration with modern machine learning (ML) workflows. Cedalion is a Python-based open-source framework designed to unify advanced model-based and data-driven analysis of multimodal fNIRS and DOT data within a reproducible, extensible, and community-driven environment. Cedalion integrates forward modelling, photogrammetric optode co-registration, signal processing, GLM Analysis, DOT image reconstruction, and ML-based data-driven methods within a single standardized architecture based on the Python ecosystem. It adheres to SNIRF and BIDS standards, supports cloud-executable Jupyter notebooks, and provides containerized workflows for scalable, fully reproducible analysis pipelines that can be provided alongside original research publications. Cedalion connects established optical-neuroimaging pipelines with ML frameworks such as scikit-learn and PyTorch, enabling seamless multimodal fusion with EEG, MEG, and physiological data. It implements validated algorithms for signal-quality assessment, motion correction, GLM modelling, and DOT reconstruction, complemented by modules for simulation, data augmentation, and multimodal physiology analysis. Automated documentation links each method to its source publication, and continuous-integration testing ensures robustness. This tutorial paper provides seven fully executable notebooks that demonstrate core features. Cedalion offers an open, transparent, and community extensible foundation that supports reproducible, scalable, cloud- and ML-ready fNIRS/DOT workflows for laboratory-based and real-world neuroimaging."}
{"id": "2601.05534", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.05534", "abs": "https://arxiv.org/abs/2601.05534", "authors": ["Nicholas Papadopoulos"], "title": "Blockchain Verifiable Proof of Quantum Supremacy as a Trigger for Quantum-Secure Signatures", "comment": "12 pages, 2 figures, 1 table", "summary": "Blockchain is a decentralized, distributed ledger technology that ensures transparency, security, and immutability through cryptographic techniques. However, advancements in quantum computing threaten the security of classical cryptographic schemes, jeopardizing blockchain integrity once cryptographic quantum supremacy is achieved. This milestone, defined here as the realization of quantum computers to solve practical cryptographic problems, would render existing security standards vulnerable, exposing blockchain assets (currency, data, etc.) to fraud and theft. To address this risk, we propose and implement a smart contract deployable on the Ethereum blockchain, having the ability to run applications on its blockchain, that generates classically intractable puzzles by probabilistically generating large, hard-to-factor numbers without requiring secret information. This contract then serves two purposes: to establish a mechanism (1) for a trustless, unbiased proof of cryptographic quantum supremacy by verifying solutions to these puzzles, and (2) to protect user funds on Ethereum by triggering quantum-secure fallback protocols upon detecting cryptographic quantum supremacy, since it is desirable to wait as long as possible to fall back to a quantum-secure scheme because of its inherent additional cost and complexity. These mechanisms demonstrate the ability to identify cryptographic vulnerabilities and ensure a smooth transition to quantum-secure standards, safeguarding blockchain assets in a post-quantum era."}
{"id": "2601.05632", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.05632", "abs": "https://arxiv.org/abs/2601.05632", "authors": ["Chao Shen", "Zihan Guo", "Ke Zuo", "Wenqi Huang", "Mingyang Sun"], "title": "LLM-DMD: Large Language Model-based Power System Dynamic Model Discovery", "comment": null, "summary": "Current model structural discovery methods for power system dynamics impose rigid priors on the basis functions and variable sets of dynamic models while often neglecting algebraic constraints, thereby limiting the formulation of high-fidelity models required for precise simulation and analysis. This letter presents a novel large language model (LLM)-based framework for dynamic model discovery (LLM-DMD) which integrates the reasoning and code synthesis capabilities of LLMs to discover dynamic equations and enforce algebraic constraints through two sequential loops: the differential-equation loop that identifies state dynamics and associated variables, and the algebraic-equation loop that formulates algebraic constraints on the identified algebraic variables. In each loop, executable skeletons of power system dynamic equations are generated by the LLM-based agent and evaluated via gradient-based optimizer. Candidate models are stored in an island-based archive to guide future iterations, and evaluation stagnation activates a variable extension mechanism that augments the model with missing algebraic or input variables, such as stator currents to refine the model. Validation on synchronous generator benchmarks of the IEEE 39-bus system demonstrates the superiority of LLM-DMD in complete dynamic model discovery."}
{"id": "2601.05371", "categories": ["cs.LG", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.05371", "abs": "https://arxiv.org/abs/2601.05371", "authors": ["Md Shafiqul Islam", "Shakti Prasad Padhy", "Douglas Allaire", "Raymundo Arróyave"], "title": "The Kernel Manifold: A Geometric Approach to Gaussian Process Model Selection", "comment": null, "summary": "Gaussian Process (GP) regression is a powerful nonparametric Bayesian framework, but its performance depends critically on the choice of covariance kernel. Selecting an appropriate kernel is therefore central to model quality, yet remains one of the most challenging and computationally expensive steps in probabilistic modeling. We present a Bayesian optimization framework built on kernel-of-kernels geometry, using expected divergence-based distances between GP priors to explore kernel space efficiently. A multidimensional scaling (MDS) embedding of this distance matrix maps a discrete kernel library into a continuous Euclidean manifold, enabling smooth BO. In this formulation, the input space comprises kernel compositions, the objective is the log marginal likelihood, and featurization is given by the MDS coordinates. When the divergence yields a valid metric, the embedding preserves geometry and produces a stable BO landscape. We demonstrate the approach on synthetic benchmarks, real-world time-series datasets, and an additive manufacturing case study predicting melt-pool geometry, achieving superior predictive accuracy and uncertainty calibration relative to baselines including Large Language Model (LLM)-guided search. This framework establishes a reusable probabilistic geometry for kernel search, with direct relevance to GP modeling and deep kernel learning."}
{"id": "2601.05686", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05686", "abs": "https://arxiv.org/abs/2601.05686", "authors": ["Zhenqiao Cheng", "Chongjun Ouyang", "Boqun Zhao", "Xingqi Zhang"], "title": "Secure Multiuser Beamforming With Movable Antenna Arrays", "comment": "6 pages; code available at https://github.com/DragonAim0597/Secure-Multiuser-Beamforming-With-Movable-Antenna-Arrays", "summary": "A movable antennas (MAs)-enabled secure multiuser transmission framework is developed to enhance physical-layer security. Novel expressions are derived to characterize the achievable sum secrecy rate based on the secure channel coding theorem. On this basis, a joint optimization algorithm for digital beamforming and MA placement is proposed to maximize the sum secrecy rate via fractional programming and block coordinate descent. In each iteration, every variable admits either a closed-form update or a low-complexity one-dimensional or bisection search, which yields an efficient implementation. Numerical results demonstrate the effectiveness of the proposed method and show that the MA-enabled design achieves higher secrecy rates than conventional fixed-position antenna arrays."}
{"id": "2601.05998", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05998", "abs": "https://arxiv.org/abs/2601.05998", "authors": ["Caroline Jane Spindel", "Edward Knightly"], "title": "Curving Beam Reflections: Model and Experimental Validation", "comment": "Accepted to IEEE INFOCOM 2026", "summary": "Curving beams are a promising new method for bypassing obstacles in future millimeter-wave to sub-terahertz (sub-THz) networks but lack a general predictive model for their reflections from arbitrary surfaces. We show that, unfortunately, attempting to \"mirror\" the incident beam trajectory across the normal of the reflector, as in ray optics, fails in general. Thus, we introduce the first geometric framework capable of modeling the reflections of arbitrary convex sub-THz curving beams from general reflectors with experimental verification. Rather than \"mirroring\" the trajectory, we decompose the beam into a family of tangents and demonstrate that this process is equivalent to the Legendre transform. This approach allows us to accurately account for reflectors of any shape, size, and position while preserving the underlying physics of wave propagation. Our model is validated through finite element method simulations and over-the-air experiments, demonstrating millimeter-scale accuracy in predicting reflections. Our model provides a foundation for future curving beam communication and sensing systems, enabling the design of reflected curved links and curving radar paths."}
{"id": "2601.05587", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05587", "abs": "https://arxiv.org/abs/2601.05587", "authors": ["Jingxiao Yang", "Ping He", "Tianyu Du", "Sun Bing", "Xuhong Zhang"], "title": "HogVul: Black-box Adversarial Code Generation Framework Against LM-based Vulnerability Detectors", "comment": "AAAI26", "summary": "Recent advances in software vulnerability detection have been driven by Language Model (LM)-based approaches. However, these models remain vulnerable to adversarial attacks that exploit lexical and syntax perturbations, allowing critical flaws to evade detection. Existing black-box attacks on LM-based vulnerability detectors primarily rely on isolated perturbation strategies, limiting their ability to efficiently explore the adversarial code space for optimal perturbations. To bridge this gap, we propose HogVul, a black-box adversarial code generation framework that integrates both lexical and syntax perturbations under a unified dual-channel optimization strategy driven by Particle Swarm Optimization (PSO). By systematically coordinating two-level perturbations, HogVul effectively expands the search space for adversarial examples, enhancing the attack efficacy. Extensive experiments on four benchmark datasets demonstrate that HogVul achieves an average attack success rate improvement of 26.05\\% over state-of-the-art baseline methods. These findings highlight the potential of hybrid optimization strategies in exposing model vulnerabilities."}
{"id": "2601.05756", "categories": ["eess.SY", "cs.CE"], "pdf": "https://arxiv.org/pdf/2601.05756", "abs": "https://arxiv.org/abs/2601.05756", "authors": ["Thomas Stegen", "Julien Allard", "Noé Diffels", "François Vallée", "Mevludin Glavic", "Zacharie De Grève", "Bertrand Cornélusse"], "title": "Explicit Reward Mechanisms for Local Flexibility in Renewable Energy Communities", "comment": null, "summary": "Incentivizing flexible consumption of end-users is key to maximizing the value of local exchanges within Renewable Energy Communities. If centralized coordination for flexible resources planning raises concerns regarding data privacy and fair benefits distribution, state-of-the-art approaches (e.g., bi-level, ADMM) often face computational complexity and convexity challenges, limiting the precision of embedded flexible models. This work proposes an iterative resolution procedure to solve the decentralized flexibility planning with a central operator as a coordinator within a community. The community operator asks for upward or downward flexibility depending on the global needs, while members can individually react with an offer for flexible capacity. This approach ensures individual optimality while converging towards a global optimum, as validated on a 20-member domestic case study for which the gap in terms of collective bill is not more than 3.5% between the decentralized and centralized coordination schemes."}
{"id": "2601.05378", "categories": ["cs.LG", "cs.RO"], "pdf": "https://arxiv.org/pdf/2601.05378", "abs": "https://arxiv.org/abs/2601.05378", "authors": ["Sebastian J. Wetzel"], "title": "Inverting Non-Injective Functions with Twin Neural Network Regression", "comment": null, "summary": "Non-injective functions are not invertible. However, non-injective functions can be restricted to sub-domains on which they are locally injective and surjective and thus invertible if the dimensionality between input and output spaces are the same. Further, even if the dimensionalities do not match it is often possible to choose a preferred solution from many possible solutions. Twin neural network regression is naturally capable of incorporating these properties to invert non-injective functions. Twin neural network regression is trained to predict adjustments to well known input variables $\\mathbf{x}^{\\text{anchor}}$ to obtain an estimate for an unknown $\\mathbf{x}^{\\text{new}}$ under a change of the target variable from $\\mathbf{y}^{\\text{anchor}}$ to $\\mathbf{y}^{\\text{new}}$. In combination with k-nearest neighbor search, I propose a deterministic framework that finds input parameters to a given target variable of non-injective functions. The method is demonstrated by inverting non-injective functions describing toy problems and robot arm control that are a) defined by data or b) known as mathematical formula."}
{"id": "2601.05873", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05873", "abs": "https://arxiv.org/abs/2601.05873", "authors": ["Javad Maheri", "K. K. Krishnan Namboodiri", "Petros Elia"], "title": "Universal and Asymptotically Optimal Data and Task Allocation in Distributed Computing", "comment": "49 pages, 2 figures", "summary": "We study the joint minimization of communication and computation costs in distributed computing, where a master node coordinates $N$ workers to evaluate a function over a library of $n$ files. Assuming that the function is decomposed into an arbitrary subfunction set $\\mathbf{X}$, with each subfunction depending on $d$ input files, renders our distributed computing problem into a $d$-uniform hypergraph edge partitioning problem wherein the edge set (subfunction set), defined by $d$-wise dependencies between vertices (files) must be partitioned across $N$ disjoint groups (workers). The aim is to design a file and subfunction allocation, corresponding to a partition of $\\mathbf{X}$, that minimizes the communication cost $π_{\\mathbf{X}}$, representing the maximum number of distinct files per server, while also minimizing the computation cost $δ_{\\mathbf{X}}$ corresponding to a maximal worker subfunction load. For a broad range of parameters, we propose a deterministic allocation solution, the \\emph{Interweaved-Cliques (IC) design}, whose information-theoretic-inspired interweaved clique structure simultaneously achieves order-optimal communication and computation costs, for a large class of decompositions $\\mathbf{X}$. This optimality is derived from our achievability and converse bounds, which reveal -- under reasonable assumptions on the density of $\\mathbf{X}$ -- that the optimal scaling of the communication cost takes the form $n/N^{1/d}$, revealing that our design achieves the order-optimal \\textit{partitioning gain} that scales as $N^{1/d}$, while also achieving an order-optimal computation cost. Interestingly, this order optimality is achieved in a deterministic manner, and very importantly, it is achieved blindly from $\\mathbf{X}$, therefore enabling multiple desired functions to be computed without reshuffling files."}
{"id": "2601.06012", "categories": ["eess.SP", "stat.AP"], "pdf": "https://arxiv.org/pdf/2601.06012", "abs": "https://arxiv.org/abs/2601.06012", "authors": ["Helena Calatrava", "Daniel Medina", "Pau Closas"], "title": "Cooperative Differential GNSS Positioning: Estimators and Bounds", "comment": "The manuscript comprises a 13-page main paper and a 6-page supplementary appendix providing extended derivations and matrix expansions. The main body includes 5 figures and 5 tables", "summary": "In Differential GNSS (DGNSS) positioning, differencing measurements between a user and a reference station suppresses common-mode errors but also introduces reference-station noise, which fundamentally limits accuracy. This limitation is minor for high-grade stations but becomes significant when using reference infrastructure of mixed quality. This paper investigates how large-scale user cooperation can mitigate the impact of reference-station noise in conventional (non-cooperative) DGNSS systems. We develop a unified estimation framework for cooperative DGNSS (C-DGNSS) and cooperative real-time kinematic (C-RTK) positioning, and derive parameterized expressions for their Fisher information matrices as functions of network size, satellite geometry, and reference-station noise. This formulation enables theoretical analysis of estimation performance, identifying regimes where cooperation asymptotically restores the accuracy of DGNSS with an ideal (noise-free) reference. Simulations validate these theoretical findings."}
{"id": "2601.05635", "categories": ["cs.CR", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.05635", "abs": "https://arxiv.org/abs/2601.05635", "authors": ["Honghao Liu", "Xuhui Jiang", "Chengjin Xu", "Cehao Yang", "Yiran Cheng", "Lionel Ni", "Jian Guo"], "title": "Continual Pretraining on Encrypted Synthetic Data for Privacy-Preserving LLMs", "comment": null, "summary": "Preserving privacy in sensitive data while pretraining large language models on small, domain-specific corpora presents a significant challenge. In this work, we take an exploratory step toward privacy-preserving continual pretraining by proposing an entity-based framework that synthesizes encrypted training data to protect personally identifiable information (PII). Our approach constructs a weighted entity graph to guide data synthesis and applies deterministic encryption to PII entities, enabling LLMs to encode new knowledge through continual pretraining while granting authorized access to sensitive data through decryption keys. Our results on limited-scale datasets demonstrate that our pretrained models outperform base models and ensure PII security, while exhibiting a modest performance gap compared to models trained on unencrypted synthetic data. We further show that increasing the number of entities and leveraging graph-based synthesis improves model performance, and that encrypted models retain instruction-following capabilities with long retrieved contexts. We discuss the security implications and limitations of deterministic encryption, positioning this work as an initial investigation into the design space of encrypted data pretraining for privacy-preserving LLMs. Our code is available at https://github.com/DataArcTech/SoE."}
{"id": "2601.05800", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.05800", "abs": "https://arxiv.org/abs/2601.05800", "authors": ["Kavita Shekhawat", "Nandan Kumar Sinha"], "title": "Modeling and Bifurcation Analysis of Longitudinal Dynamics of an Air-Breathing Hypersonic Vehicle", "comment": "22 pages, 14 figures", "summary": "A nonlinear model of an Air-Breathing Hypersonic Vehicle (ABHV) longitudinal dynamics characterized by coupling of aerodynamic and propulsive terms is presented in this paper. The model is verified using modal analysis carried out around a design operating condition with results available in the literature. Further, parametric dynamic behavior is computed for the model as steady states with local stability with respect to its control inputs, elevator and fuel-equivalence ratio in four different cases using a numerical continuation algorithm. Detailed analysis of the qualitative longitudinal dynamics of the model is carried out based on bifurcation theory methodology. Numerical simulation results are presented to verify bifurcation analysis results."}
{"id": "2601.05383", "categories": ["cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.05383", "abs": "https://arxiv.org/abs/2601.05383", "authors": ["Prakash Gawas", "Antoine Legrain", "Louis-Martin Rousseau"], "title": "Imitation Learning for Combinatorial Optimisation under Uncertainty", "comment": null, "summary": "Imitation learning (IL) provides a data-driven framework for approximating policies for large-scale combinatorial optimisation problems formulated as sequential decision problems (SDPs), where exact solution methods are computationally intractable. A central but underexplored aspect of IL in this context is the role of the \\emph{expert} that generates training demonstrations. Existing studies employ a wide range of expert constructions, yet lack a unifying framework to characterise their modelling assumptions, computational properties, and impact on learning performance.\n  This paper introduces a systematic taxonomy of experts for IL in combinatorial optimisation under uncertainty. Experts are classified along three dimensions: (i) their treatment of uncertainty, including myopic, deterministic, full-information, two-stage stochastic, and multi-stage stochastic formulations; (ii) their level of optimality, distinguishing task-optimal and approximate experts; and (iii) their interaction mode with the learner, ranging from one-shot supervision to iterative, interactive schemes. Building on this taxonomy, we propose a generalised Dataset Aggregation (DAgger) algorithm that supports multiple expert queries, expert aggregation, and flexible interaction strategies.\n  The proposed framework is evaluated on a dynamic physician-to-patient assignment problem with stochastic arrivals and capacity constraints. Computational experiments compare learning outcomes across expert types and interaction regimes. The results show that policies learned from stochastic experts consistently outperform those learned from deterministic or full-information experts, while interactive learning improves solution quality using fewer expert demonstrations. Aggregated deterministic experts provide an effective alternative when stochastic optimisation becomes computationally challenging."}
{"id": "2601.05983", "categories": ["cs.IT", "cs.NI", "cs.SI", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05983", "abs": "https://arxiv.org/abs/2601.05983", "authors": ["Arunabh Srivastava", "Sennur Ulukus"], "title": "Age of Gossip With Cellular Drone Mobility", "comment": null, "summary": "We consider a cellular network containing $n$ nodes where nodes within a cell gossip with each other in a fully-connected fashion and a source shares updates with these nodes via a mobile drone. The mobile drone receives updates directly from the source and shares them with nodes in the cell where it currently resides. The drone moves between cells according to an underlying continuous-time Markov chain (CTMC). In this work, we evaluate the impact of the number of cells $f(n)$, drone speed $λ_m(n)$ and drone dissemination rate $λ_d(n)$ on the freshness of information of nodes in the network. We utilize the version age of information metric to quantify the freshness of information. We observe that the expected duration between two drone-to-cell service times depends on the stationary distribution of the underlying CTMC and $λ_d(n)$, but not on $λ_m(n)$. However, the version age instability in slow moving CTMCs makes high probability analysis for a general underlying CTMC difficult. Therefore, next we focus on the fully-connected drone mobility model. Under this model, we uncover a dual-bottleneck between drone mobility and drone dissemination speed: the version age is constrained by the slower of these two processes. If $λ_d(n) \\gg λ_m(n)$, then the version age scaling of nodes is dominated by the inverse of $λ_m(n)$ and is independent of $λ_d(n)$. If $λ_m(n) \\gg λ_d(n)$, then the version age scaling of nodes is dominated by the inverse of $λ_d(n)$ and is independent of $λ_m(n)$."}
{"id": "2601.05519", "categories": ["eess.SY", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05519", "abs": "https://arxiv.org/abs/2601.05519", "authors": ["Luis A. Garcia-Reyes", "Oriol Gomis-Bellmunt", "Eduardo Prieto-Araujo", "Vinícius A. Lacerda", "Marc Cheah-Mañe"], "title": "SIaD-Tool: A Comprehensive Frequency-Domain Tool for Small-Signal Stability and Interaction Assessment in Modern Power Systems", "comment": "IEEE Transactions on Power Delivery", "summary": "This paper presents SIaD-Tool, an open-source frequency-domain (FD) scanning solution for stability and interaction assessment in modern power systems. The tool enables multi-sequence identification in the abc, dq0, and 0pn frames and supports both series voltage and parallel current perturbation strategies. A novel perturbation scheme allows direct scanning in the target frame, simplifying the analysis of coupling effects and mirrored frequencies. SIaD-Tool is implemented on a multi-platform architecture, including MATLAB/Simulink and Python-PSCAD/EMTDC. Beyond system identification, it integrates automated stability evaluation through four standardized methods: Generalized Nyquist Criterion (GNC), modal impedance analysis, phase margin assessment, and passivity checks. Validation is carried out via extensive case studies involving passive elements, grid-following and grid-forming converters, offshore wind power plants, and the IEEE 9-bus system. Results confirm high accuracy, scalability, and robustness in detecting critical modes, interaction frequencies, oscillatory behavior, and stability margins."}
{"id": "2601.05742", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05742", "abs": "https://arxiv.org/abs/2601.05742", "authors": ["Ahmad Alobaid", "Martí Jordà Roca", "Carlos Castillo", "Joan Vendrell"], "title": "The Echo Chamber Multi-Turn LLM Jailbreak", "comment": null, "summary": "The availability of Large Language Models (LLMs) has led to a new generation of powerful chatbots that can be developed at relatively low cost. As companies deploy these tools, security challenges need to be addressed to prevent financial loss and reputational damage. A key security challenge is jailbreaking, the malicious manipulation of prompts and inputs to bypass a chatbot's safety guardrails. Multi-turn attacks are a relatively new form of jailbreaking involving a carefully crafted chain of interactions with a chatbot. We introduce Echo Chamber, a new multi-turn attack using a gradual escalation method. We describe this attack in detail, compare it to other multi-turn attacks, and demonstrate its performance against multiple state-of-the-art models through extensive evaluation."}
{"id": "2601.05949", "categories": ["eess.SY", "math.SP"], "pdf": "https://arxiv.org/pdf/2601.05949", "abs": "https://arxiv.org/abs/2601.05949", "authors": ["Gerald Ogbonna", "C. Lindsay Anderson"], "title": "Generalized Spectral Clustering of Low-Inertia Power Networks", "comment": null, "summary": "Large-scale integration of distributed energy resources has led to a rapid increase in the number of controllable devices and a significant change in system dynamics. This has necessitating the shift towards more distributed and scalable control strategies to manage the increasing system complexity. In this work, we address the problem of partitioning a low-inertia power network into dynamically coherent subsystems to facilitate the utilization of distributed control schemes. We show that an embedding of the power network using the spectrum of the linearized synchronization dynamics matrix results in a natural decomposition of the network. We establish the connection between our approach and the broader framework of spectral clustering using the Laplacian matrix of the admittance network. The proposed method is demonstrated on the IEEE 30-bus test system, and numerical simulations show that the resulting clusters using our approach are dynamically coherent. We consider the robustness of the clusters identified in the network by analyzing the sensitivity of the small eigenvalues and their corresponding eigenspaces, which determines the coherency structure of the oscillator dynamics, to variations in the steady-state operating points of the network."}
{"id": "2601.05391", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05391", "abs": "https://arxiv.org/abs/2601.05391", "authors": ["Namrata Banerji", "Tanya Berger-Wolf"], "title": "DynaSTy: A Framework for SpatioTemporal Node Attribute Prediction in Dynamic Graphs", "comment": null, "summary": "Accurate multistep forecasting of node-level attributes on dynamic graphs is critical for applications ranging from financial trust networks to biological networks. Existing spatiotemporal graph neural networks typically assume a static adjacency matrix. In this work, we propose an end-to-end dynamic edge-biased spatiotemporal model that ingests a multi-dimensional timeseries of node attributes and a timeseries of adjacency matrices, to predict multiple future steps of node attributes. At each time step, our transformer-based model injects the given adjacency as an adaptable attention bias, allowing the model to focus on relevant neighbors as the graph evolves. We further deploy a masked node-time pretraining objective that primes the encoder to reconstruct missing features, and train with scheduled sampling and a horizon-weighted loss to mitigate compounding error over long horizons. Unlike prior work, our model accommodates dynamic graphs that vary across input samples, enabling forecasting in multi-system settings such as brain networks across different subjects, financial systems in different contexts, or evolving social systems. Empirical results demonstrate that our method consistently outperforms strong baselines on Root Mean Squared Error (RMSE) and Mean Absolute Error (MAE)."}
{"id": "2601.05353", "categories": ["cs.LG", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.05353", "abs": "https://arxiv.org/abs/2601.05353", "authors": ["Shovito Barua Soumma", "Hassan Ghasemzadeh"], "title": "GlyRAG: Context-Aware Retrieval-Augmented Framework for Blood Glucose Forecasting", "comment": null, "summary": "Accurate forecasting of blood glucose from CGM is essential for preventing dysglycemic events, thus enabling proactive diabetes management. However, current forecasting models treat blood glucose readings captured using CGMs as a numerical sequence, either ignoring context or relying on additional sensors/modalities that are difficult to collect and deploy at scale. Recently, LLMs have shown promise for time-series forecasting tasks, yet their role as agentic context extractors in diabetes care remains largely unexplored. To address these limitations, we propose GlyRAG, a context-aware, retrieval-augmented forecasting framework that derives semantic understanding of blood glucose dynamics directly from CGM traces without requiring additional sensor modalities. GlyRAG employs an LLM as a contextualization agent to generate clinical summaries. These summaries are embedded by a language model and fused with patch-based glucose representations in a multimodal transformer architecture with a cross translation loss aligining textual and physiological embeddings. A retrieval module then identifies similar historical episodes in the learned embedding space and uses cross-attention to integrate these case-based analogues prior to making a forecasting inference. Extensive evaluations on two T1D cohorts show that GlyRAG consistently outperforms state-of-the art methods, achieving up to 39% lower RMSE and a further 1.7% reduction in RMSE over the baseline. Clinical evaluation shows that GlyRAG places 85% predictions in safe zones and achieves 51% improvement in predicting dysglycemic events across both cohorts. These results indicate that LLM-based contextualization and retrieval over CGM traces can enhance the accuracy and clinical reliability of long-horizon glucose forecasting without the need for extra sensors, thus supporting future agentic decision-support tools for diabetes management."}
{"id": "2601.05674", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05674", "abs": "https://arxiv.org/abs/2601.05674", "authors": ["Torben Kölle", "Alexander Stutz-Tirri", "Christoph Studer"], "title": "On the Complexity of Electromagnetic Far-Field Modeling", "comment": "Accepted for presentation at the 2026 International Zurich Seminar on Information and Communication", "summary": "Modern wireless systems are envisioned to employ antenna architectures that not only transmit and receive electromagnetic (EM) waves, but also intentionally reflect and possibly transform incident EM waves. In this paper, we propose a mathematically rigorous framework grounded in Maxwell's equations for analyzing the complexity of EM far-field modeling of general antenna architectures. We show that-under physically meaningful assumptions-such antenna architectures exhibit limited complexity, i.e., can be modeled by finite-rank operators using finitely many parameters. Furthermore, we construct a sequence of finite-rank operators whose approximation error decays super-exponentially once the operator rank exceeds an effective bandwidth associated with the antenna architecture and the analysis frequency. These results constitute a fundamental prerequisite for the efficient and accurate modeling of general antenna architectures on digital computing platforms."}
{"id": "2601.05755", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05755", "abs": "https://arxiv.org/abs/2601.05755", "authors": ["Junda Lin", "Zhaomeng Zhou", "Zhi Zheng", "Shuochen Liu", "Tong Xu", "Yong Chen", "Enhong Chen"], "title": "VIGIL: Defending LLM Agents Against Tool Stream Injection via Verify-Before-Commit", "comment": null, "summary": "LLM agents operating in open environments face escalating risks from indirect prompt injection, particularly within the tool stream where manipulated metadata and runtime feedback hijack execution flow. Existing defenses encounter a critical dilemma as advanced models prioritize injected rules due to strict alignment while static protection mechanisms sever the feedback loop required for adaptive reasoning. To reconcile this conflict, we propose \\textbf{VIGIL}, a framework that shifts the paradigm from restrictive isolation to a verify-before-commit protocol. By facilitating speculative hypothesis generation and enforcing safety through intent-grounded verification, \\textbf{VIGIL} preserves reasoning flexibility while ensuring robust control. We further introduce \\textbf{SIREN}, a benchmark comprising 959 tool stream injection cases designed to simulate pervasive threats characterized by dynamic dependencies. Extensive experiments demonstrate that \\textbf{VIGIL} outperforms state-of-the-art dynamic defenses by reducing the attack success rate by over 22\\% while more than doubling the utility under attack compared to static baselines, thereby achieving an optimal balance between security and utility. Code is available at https://anonymous.4open.science/r/VIGIL-378B/."}
{"id": "2601.06000", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.06000", "abs": "https://arxiv.org/abs/2601.06000", "authors": ["Md Sharif Hossen", "Anil Gurses", "Ozgur Ozdemir", "Mihail Sichitiu", "Ismail Guvenc"], "title": "Resilient UAV Data Mule via Adaptive Sensor Association under Timing Constraints", "comment": "13 pages", "summary": "Unmanned aerial vehicles (UAVs) can be critical for time-sensitive data collection missions, yet existing research often relies on simulations that fail to capture real-world complexities. Many studies assume ideal wireless conditions or focus only on path planning, neglecting the challenge of making real-time decisions in dynamic environments. To bridge this gap, we address the problem of adaptive sensor selection for a data-gathering UAV, considering both the buffered data at each sensor and realistic propagation conditions. We introduce the Hover-based Greedy Adaptive Download (HGAD) strategy, designed to maximize data transfer by intelligently hovering over sensors during periods of peak signal quality. We validate HGAD using both a digital twin (DT) and a real-world (RW) testbed at the NSF-funded AERPAW platform. Our experiments show that HGAD significantly improves download stability and successfully meets per-sensor data targets. When compared with the traditional Greedy approach that simply follows the strongest signal, HGAD is shown to outperform in the cumulative data download. This work demonstrates the importance of integrating signal-to-noise ratio (SNR)-aware and buffer-aware scheduling with DT and RW signal traces to design resilient UAV data-mule strategies for realistic deployments."}
{"id": "2601.05407", "categories": ["cs.LG", "cs.MA"], "pdf": "https://arxiv.org/pdf/2601.05407", "abs": "https://arxiv.org/abs/2601.05407", "authors": ["Minwoo Cho", "Batuhan Altundas", "Matthew Gombolay"], "title": "Interactive Distillation for Cooperative Multi-Agent Reinforcement Learning", "comment": null, "summary": "Knowledge distillation (KD) has the potential to accelerate MARL by employing a centralized teacher for decentralized students but faces key bottlenecks. Specifically, there are (1) challenges in synthesizing high-performing teaching policies in complex domains, (2) difficulties when teachers must reason in out-of-distribution (OOD) states, and (3) mismatches between the decentralized students' and the centralized teacher's observation spaces. To address these limitations, we propose HINT (Hierarchical INteractive Teacher-based transfer), a novel KD framework for MARL in a centralized training, decentralized execution setup. By leveraging hierarchical RL, HINT provides a scalable, high-performing teacher. Our key innovation, pseudo off-policy RL, enables the teacher policy to be updated using both teacher and student experience, thereby improving OOD adaptation. HINT also applies performance-based filtering to retain only outcome-relevant guidance, reducing observation mismatches. We evaluate HINT on challenging cooperative domains (e.g., FireCommander for resource allocation, MARINE for tactical combat). Across these benchmarks, HINT outperforms baselines, achieving improvements of 60% to 165% in success rate."}
{"id": "2601.05686", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05686", "abs": "https://arxiv.org/abs/2601.05686", "authors": ["Zhenqiao Cheng", "Chongjun Ouyang", "Boqun Zhao", "Xingqi Zhang"], "title": "Secure Multiuser Beamforming With Movable Antenna Arrays", "comment": "6 pages; code available at https://github.com/DragonAim0597/Secure-Multiuser-Beamforming-With-Movable-Antenna-Arrays", "summary": "A movable antennas (MAs)-enabled secure multiuser transmission framework is developed to enhance physical-layer security. Novel expressions are derived to characterize the achievable sum secrecy rate based on the secure channel coding theorem. On this basis, a joint optimization algorithm for digital beamforming and MA placement is proposed to maximize the sum secrecy rate via fractional programming and block coordinate descent. In each iteration, every variable admits either a closed-form update or a low-complexity one-dimensional or bisection search, which yields an efficient implementation. Numerical results demonstrate the effectiveness of the proposed method and show that the MA-enabled design achieves higher secrecy rates than conventional fixed-position antenna arrays."}
{"id": "2601.05828", "categories": ["cs.CR", "cs.AI", "cs.IR"], "pdf": "https://arxiv.org/pdf/2601.05828", "abs": "https://arxiv.org/abs/2601.05828", "authors": ["Manuel Brosch", "Matthias Probst", "Stefan Kögler", "Georg Sigl"], "title": "Influence of Parallelism in Vector-Multiplication Units on Correlation Power Analysis", "comment": null, "summary": "The use of neural networks in edge devices is increasing, which introduces new security challenges related to the neural networks' confidentiality. As edge devices often offer physical access, attacks targeting the hardware, such as side-channel analysis, must be considered. To enhance the performance of neural network inference, hardware accelerators are commonly employed. This work investigates the influence of parallel processing within such accelerators on correlation-based side-channel attacks that exploit power consumption. The focus is on neurons that are part of the same fully-connected layer, which run parallel and simultaneously process the same input value. The theoretical impact of concurrent multiply-and-accumulate operations on overall power consumption is evaluated, as well as the success rate of correlation power analysis. Based on the observed behavior, equations are derived that describe how the correlation decreases with increasing levels of parallelism. The applicability of these equations is validated using a vector-multiplication unit implemented on an FPGA."}
{"id": "2601.05420", "categories": ["cs.LG", "stat.AP", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.05420", "abs": "https://arxiv.org/abs/2601.05420", "authors": ["Yiqun T Chen", "Sizhu Lu", "Sijia Li", "Moran Guo", "Shengyi Li"], "title": "Efficient Inference for Noisy LLM-as-a-Judge Evaluation", "comment": null, "summary": "Large language models (LLMs) are increasingly used as automatic evaluators of generative AI outputs, a paradigm often referred to as \"LLM-as-a-judge.\" In practice, LLM judges are imperfect predictions for the underlying truth and can exhibit systematic, non-random errors. Two main approaches have recently been proposed to address this issue: (i) direct measurementerror correction based on misclassification models such as Rogan-Gladen-style estimators, and (ii) surrogate-outcome approaches such as prediction-powered inference (PPI), which correct bias by calibrating prediction residuals on a small set of gold-standard human labels. In this paper, we systematically study the performance of these two approaches for estimating mean parameters (e.g., average benchmark scores or pairwise win rates). Leveraging tools from semiparametric efficiency theory, we unify the two classes of estimators by deriving explicit forms of efficient influence function (EIF)-based efficient estimators and characterize conditions under which PPI-style estimators attain strictly smaller asymptotic variance than measurement-error corrections. We verify our theoretical results in simulations and demonstrate the methods on real-data examples. We provide an implementation of the benchmarked methods and comparison utilities at https://github.com/yiqunchen/debias-llm-as-a-judge."}
{"id": "2601.05983", "categories": ["cs.IT", "cs.NI", "cs.SI", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.05983", "abs": "https://arxiv.org/abs/2601.05983", "authors": ["Arunabh Srivastava", "Sennur Ulukus"], "title": "Age of Gossip With Cellular Drone Mobility", "comment": null, "summary": "We consider a cellular network containing $n$ nodes where nodes within a cell gossip with each other in a fully-connected fashion and a source shares updates with these nodes via a mobile drone. The mobile drone receives updates directly from the source and shares them with nodes in the cell where it currently resides. The drone moves between cells according to an underlying continuous-time Markov chain (CTMC). In this work, we evaluate the impact of the number of cells $f(n)$, drone speed $λ_m(n)$ and drone dissemination rate $λ_d(n)$ on the freshness of information of nodes in the network. We utilize the version age of information metric to quantify the freshness of information. We observe that the expected duration between two drone-to-cell service times depends on the stationary distribution of the underlying CTMC and $λ_d(n)$, but not on $λ_m(n)$. However, the version age instability in slow moving CTMCs makes high probability analysis for a general underlying CTMC difficult. Therefore, next we focus on the fully-connected drone mobility model. Under this model, we uncover a dual-bottleneck between drone mobility and drone dissemination speed: the version age is constrained by the slower of these two processes. If $λ_d(n) \\gg λ_m(n)$, then the version age scaling of nodes is dominated by the inverse of $λ_m(n)$ and is independent of $λ_d(n)$. If $λ_m(n) \\gg λ_d(n)$, then the version age scaling of nodes is dominated by the inverse of $λ_d(n)$ and is independent of $λ_m(n)$."}
{"id": "2601.05865", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.05865", "abs": "https://arxiv.org/abs/2601.05865", "authors": ["Federico Mazzone", "Giorgio Micali", "Massimiliano Pronesti"], "title": "Secure Change-Point Detection for Time Series under Homomorphic Encryption", "comment": "To appear at PETs 2026", "summary": "We introduce the first method for change-point detection on encrypted time series. Our approach employs the CKKS homomorphic encryption scheme to detect shifts in statistical properties (e.g., mean, variance, frequency) without ever decrypting the data. Unlike solutions based on differential privacy, which degrade accuracy through noise injection, our solution preserves utility comparable to plaintext baselines. We assess its performance through experiments on both synthetic datasets and real-world time series from healthcare and network monitoring. Notably, our approach can process one million points within 3 minutes."}
{"id": "2601.05431", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05431", "abs": "https://arxiv.org/abs/2601.05431", "authors": ["Xiaowen He", "Su Jiang", "Louis J. Durlofsky"], "title": "Prediction of Fault Slip Tendency in CO${_2}$ Storage using Data-space Inversion", "comment": null, "summary": "Accurately assessing the potential for fault slip is essential in many subsurface operations. Conventional model-based history matching methods, which entail the generation of posterior geomodels calibrated to observed data, can be challenging to apply in coupled flow-geomechanics problems with faults. In this work, we implement a variational autoencoder (VAE)-based data-space inversion (DSI) framework to predict pressure, stress and strain fields, and fault slip tendency, in CO${_2}$ storage projects. The main computations required by the DSI workflow entail the simulation of O(1000) prior geomodels. The posterior distributions for quantities of interest are then inferred directly from prior simulation results and observed data, without the need to generate posterior geomodels. The model used here involves a synthetic 3D system with two faults. Realizations of heterogeneous permeability and porosity fields are generated using geostatistical software, and uncertain geomechanical and fault parameters are sampled for each realization from prior distributions. Coupled flow-geomechanics simulations for these geomodels are conducted using GEOS. A VAE with stacked convolutional long short-term memory layers is trained, using the prior simulation results, to represent pressure, strain, effective normal stress and shear stress fields in terms of latent variables. The VAE parameterization is used with DSI for posterior predictions, with monitoring wells providing observed pressure and strain data. Posterior results for synthetic true models demonstrate that the DSI-VAE framework gives accurate predictions for pressure, strain, and stress fields and for fault slip tendency. The framework is also shown to reduce uncertainty in key geomechanical and fault parameters."}
{"id": "2601.05887", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.05887", "abs": "https://arxiv.org/abs/2601.05887", "authors": ["Víctor Mayoral-Vilches", "María Sanz-Gómez", "Francesco Balassone", "Stefan Rass", "Lidia Salas-Espejo", "Benjamin Jablonski", "Luis Javier Navarrete-Lozano", "Maite del Mundo de Torres", "Cristóbal R. J. Veas Chavez"], "title": "Cybersecurity AI: A Game-Theoretic AI for Guiding Attack and Defense", "comment": null, "summary": "AI-driven penetration testing now executes thousands of actions per hour but still lacks the strategic intuition humans apply in competitive security. To build cybersecurity superintelligence --Cybersecurity AI exceeding best human capability-such strategic intuition must be embedded into agentic reasoning processes. We present Generative Cut-the-Rope (G-CTR), a game-theoretic guidance layer that extracts attack graphs from agent's context, computes Nash equilibria with effort-aware scoring, and feeds a concise digest back into the LLM loop \\emph{guiding} the agent's actions. Across five real-world exercises, G-CTR matches 70--90% of expert graph structure while running 60--245x faster and over 140x cheaper than manual analysis. In a 44-run cyber-range, adding the digest lifts success from 20.0% to 42.9%, cuts cost-per-success by 2.7x, and reduces behavioral variance by 5.2x. In Attack-and-Defense exercises, a shared digest produces the Purple agent, winning roughly 2:1 over the LLM-only baseline and 3.7:1 over independently guided teams. This closed-loop guidance is what produces the breakthrough: it reduces ambiguity, collapses the LLM's search space, suppresses hallucinations, and keeps the model anchored to the most relevant parts of the problem, yielding large gains in success rate, consistency, and reliability."}
{"id": "2601.05451", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.05451", "abs": "https://arxiv.org/abs/2601.05451", "authors": ["Marko Sterbentz", "Kevin Cushing", "Cameron Barrie", "Kristian J. Hammond"], "title": "RingSQL: Generating Synthetic Data with Schema-Independent Templates for Text-to-SQL Reasoning Models", "comment": null, "summary": "Recent advances in text-to-SQL systems have been driven by larger models and improved datasets, yet progress is still limited by the scarcity of high-quality training data. Manual data creation is expensive, and existing synthetic methods trade off reliability and scalability. Template-based approaches ensure correct SQL but require schema-specific templates, while LLM-based generation scales easily but lacks quality and correctness guarantees. We introduce RingSQL, a hybrid data generation framework that combines schema-independent query templates with LLM-based paraphrasing of natural language questions. This approach preserves SQL correctness across diverse schemas while providing broad linguistic variety. In our experiments, we find that models trained using data produced by RingSQL achieve an average gain in accuracy of +2.3% across six text-to-SQL benchmarks when compared to models trained on other synthetic data. We make our code available at https://github.com/nu-c3lab/RingSQL."}
{"id": "2601.05918", "categories": ["cs.CR", "cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2601.05918", "abs": "https://arxiv.org/abs/2601.05918", "authors": ["Tianshi Li"], "title": "Agentic LLMs as Powerful Deanonymizers: Re-identification of Participants in the Anthropic Interviewer Dataset", "comment": "4 pages", "summary": "On December 4, 2025, Anthropic released Anthropic Interviewer, an AI tool for running qualitative interviews at scale, along with a public dataset of 1,250 interviews with professionals, including 125 scientists, about their use of AI for research. Focusing on the scientist subset, I show that widely available LLMs with web search and agentic capabilities can link six out of twenty-four interviews to specific scientific works, recovering associated authors and, in some cases, uniquely identifying the interviewees. My contribution is to show that modern LLM-based agents make such re-identification attacks easy and low-effort: off-the-shelf tools can, with a few natural-language prompts, search the web, cross-reference details, and propose likely matches, effectively lowering the technical barrier. Existing safeguards can be bypassed by breaking down the re-identification into benign tasks. I outline the attack at a high level, discuss implications for releasing rich qualitative data in the age of LLM agents, and propose mitigation recommendations and open problems. I have notified Anthropic of my findings."}
{"id": "2601.05474", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05474", "abs": "https://arxiv.org/abs/2601.05474", "authors": ["Pingchuan Ma", "Qixin Zhang", "Shuai Wang", "Dacheng Tao"], "title": "Efficient Differentiable Causal Discovery via Reliable Super-Structure Learning", "comment": null, "summary": "Recently, differentiable causal discovery has emerged as a promising approach to improve the accuracy and efficiency of existing methods. However, when applied to high-dimensional data or data with latent confounders, these methods, often based on off-the-shelf continuous optimization algorithms, struggle with the vast search space, the complexity of the objective function, and the nontrivial nature of graph-theoretical constraints. As a result, there has been a surge of interest in leveraging super-structures to guide the optimization process. Nonetheless, learning an appropriate super-structure at the right level of granularity, and doing so efficiently across various settings, presents significant challenges.\n  In this paper, we propose ALVGL, a novel and general enhancement to the differentiable causal discovery pipeline. ALVGL employs a sparse and low-rank decomposition to learn the precision matrix of the data. We design an ADMM procedure to optimize this decomposition, identifying components in the precision matrix that are most relevant to the underlying causal structure. These components are then combined to construct a super-structure that is provably a superset of the true causal graph. This super-structure is used to initialize a standard differentiable causal discovery method with a more focused search space, thereby improving both optimization efficiency and accuracy.\n  We demonstrate the versatility of ALVGL by instantiating it across a range of structural causal models, including both Gaussian and non-Gaussian settings, with and without unmeasured confounders. Extensive experiments on synthetic and real-world datasets show that ALVGL not only achieves state-of-the-art accuracy but also significantly improves optimization efficiency, making it a reliable and effective solution for differentiable causal discovery."}
{"id": "2601.05988", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05988", "abs": "https://arxiv.org/abs/2601.05988", "authors": ["Isaiah J. King", "Bernardo Trindade", "Benjamin Bowman", "H. Howie Huang"], "title": "CyberGFM: Graph Foundation Models for Lateral Movement Detection in Enterprise Networks", "comment": "17 pages; 11 figures; 8 tables", "summary": "Representing networks as a graph and training a link prediction model using benign connections is an effective method of anomaly-based intrusion detection. Existing works using this technique have shown great success using temporal graph neural networks and skip-gram-based approaches on random walks. However, random walk-based approaches are unable to incorporate rich edge data, while the GNN-based approaches require large amounts of memory to train. In this work, we propose extending the original insight from random walk-based skip-grams--that random walks through a graph are analogous to sentences in a corpus--to the more modern transformer-based foundation models. Using language models that take advantage of GPU optimizations, we can quickly train a graph foundation model to predict missing tokens in random walks through a network of computers. The graph foundation model is then finetuned for link prediction and used as a network anomaly detector. This new approach allows us to combine the efficiency of random walk-based methods and the rich semantic representation of deep learning methods. This system, which we call CyberGFM, achieved state-of-the-art results on three widely used network anomaly detection datasets, delivering a up to 2$\\times$ improvement in average precision. We found that CyberGFM outperforms all prior works in unsupervised link prediction for network anomaly detection, using the same number of parameters, and with equal or better efficiency than the previous best approaches."}
{"id": "2601.05475", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.05475", "abs": "https://arxiv.org/abs/2601.05475", "authors": ["Jiefu Ou", "Sapana Chaudhary", "Kaj Bostrom", "Nathaniel Weir", "Shuai Zhang", "Huzefa Rangwala", "George Karypis"], "title": "MaxCode: A Max-Reward Reinforcement Learning Framework for Automated Code Optimization", "comment": null, "summary": "Large Language Models (LLMs) demonstrate strong capabilities in general coding tasks but encounter two key challenges when optimizing code: (i) the complexity of writing optimized code (such as performant CUDA kernels and competition-level CPU code) requires expertise in systems, algorithms and specific languages and (ii) requires interpretation of performance metrics like timing and device utilization beyond binary correctness. In this work, we explore inference-time search algorithms that guide the LLM to discover better solutions through iterative refinement based on execution feedback. Our approach, called MaxCode unifies existing search methods under a max-reward reinforcement learning framework, making the observation and action-value functions modular for modification. To enhance the observation space, we integrate a natural language critique model that converts raw execution feedback into diagnostic insights about errors and performance bottlenecks, and the best-discounted reward seen so far. Together, these provide richer input to the code proposal function. To improve exploration during search, we train a generative reward-to-go model using action values from rollouts to rerank potential solutions. Testing on the KernelBench (CUDA) and PIE (C++) optimization benchmarks shows that MaxCode improves optimized code performance compared to baselines, achieving 20.3% and 10.1% relative improvements in absolute speedup value and relative speedup ranking, respectively."}
{"id": "2601.05352", "categories": ["cs.LG", "cs.CR", "cs.IR", "cs.SI"], "pdf": "https://arxiv.org/pdf/2601.05352", "abs": "https://arxiv.org/abs/2601.05352", "authors": ["Tianrun Yu", "Kaixiang Zhao", "Cheng Zhang", "Anjun Gao", "Yueyang Quan", "Zhuqing Liu", "Minghong Fang"], "title": "When the Server Steps In: Calibrated Updates for Fair Federated Learning", "comment": null, "summary": "Federated learning (FL) has emerged as a transformative distributed learning paradigm, enabling multiple clients to collaboratively train a global model under the coordination of a central server without sharing their raw training data. While FL offers notable advantages, it faces critical challenges in ensuring fairness across diverse demographic groups. To address these fairness concerns, various fairness-aware debiasing methods have been proposed. However, many of these approaches either require modifications to clients' training protocols or lack flexibility in their aggregation strategies. In this work, we address these limitations by introducing EquFL, a novel server-side debiasing method designed to mitigate bias in FL systems. EquFL operates by allowing the server to generate a single calibrated update after receiving model updates from the clients. This calibrated update is then integrated with the aggregated client updates to produce an adjusted global model that reduces bias. Theoretically, we establish that EquFL converges to the optimal global model achieved by FedAvg and effectively reduces fairness loss over training rounds. Empirically, we demonstrate that EquFL significantly mitigates bias within the system, showcasing its practical effectiveness."}
{"id": "2601.05501", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.05501", "abs": "https://arxiv.org/abs/2601.05501", "authors": ["Feihu Jin", "Ying Tan"], "title": "Hi-ZFO: Hierarchical Zeroth- and First-Order LLM Fine-Tuning via Importance-Guided Tensor Selection", "comment": "13 pages, 4 figures", "summary": "Fine-tuning large language models (LLMs) using standard first-order (FO) optimization often drives training toward sharp, poorly generalizing minima. Conversely, zeroth-order (ZO) methods offer stronger exploratory behavior without relying on explicit gradients, yet suffer from slow convergence. More critically, our analysis reveals that in generative tasks, the vast output and search space significantly amplify estimation variance, rendering ZO methods both noisy and inefficient. To address these challenges, we propose \\textbf{Hi-ZFO} (\\textbf{Hi}erarchical \\textbf{Z}eroth- and \\textbf{F}irst-\\textbf{O}rder optimization), a hybrid framework designed to synergize the precision of FO gradients with the exploratory capability of ZO estimation. Hi-ZFO adaptively partitions the model through layer-wise importance profiling, applying precise FO updates to critical layers while leveraging ZO optimization for less sensitive ones. Notably, ZO in Hi-ZFO is not merely a memory-saving surrogate; it is intentionally introduced as a source of \"beneficial stochasticity\" to help the model escape the local minima where pure FO optimization tends to stagnate. Validated across diverse generative, mathematical, and code reasoning tasks, Hi-ZFO consistently achieves superior performance while significantly reducing the training time. These results demonstrate the effectiveness of hierarchical hybrid optimization for LLM fine-tuning."}
{"id": "2601.05503", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05503", "abs": "https://arxiv.org/abs/2601.05503", "authors": ["Roy Xie", "Deepak Gopinath", "David Qiu", "Dong Lin", "Haitian Sun", "Saloni Potdar", "Bhuwan Dhingra"], "title": "Over-Searching in Search-Augmented Large Language Models", "comment": "Accepted to EACL 2026 Main Conference", "summary": "Search-augmented large language models (LLMs) excel at knowledge-intensive tasks by integrating external retrieval. However, they often over-search -- unnecessarily invoking search tool even when it does not improve response quality, which leads to computational inefficiency and hallucinations by incorporating irrelevant context. In this work, we conduct a systematic evaluation of over-searching across multiple dimensions, including query types, model categories, retrieval conditions, and multi-turn conversations. Our finding shows: (i) search generally improves answer accuracy on answerable queries but harms abstention on unanswerable ones; (ii) over-searching is more pronounced in complex reasoning models and deep research systems, is exacerbated by noisy retrieval, and compounds across turns in multi-turn conversations; and (iii) the composition of retrieved evidence is crucial, as the presence of negative evidence improves abstention. To quantify over-searching, we introduce Tokens Per Correctness (TPC), an evaluation metric that captures the performance-cost trade-off for search-augmented LLMs. Lastly, we investigate mitigation approaches at both the query and retrieval levels and release the OverSearchQA to foster continued research into efficient search-augmented LLMs."}
{"id": "2601.05521", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05521", "abs": "https://arxiv.org/abs/2601.05521", "authors": ["Jiayu Fang", "Zhiqi Shao", "Haoning Xi", "Boris Choy", "Junbin Gao"], "title": "Toward an Integrated Cross-Urban Accident Prevention System: A Multi-Task Spatial-Temporal Learning Framework for Urban Safety Management", "comment": "38pages, 18figures", "summary": "The development of a cross-city accident prevention system is particularly challenging due to the heterogeneity, inconsistent reporting, and inherently clustered, sparse, cyclical, and noisy nature of urban accident data. These intrinsic data properties, combined with fragmented governance and incompatible reporting standards, have long hindered the creation of an integrated, cross-city accident prevention framework. To address this gap, we propose the Mamba Local-ttention Spatial-Temporal Network MLA-STNet, a unified system that formulates accident risk prediction as a multi-task learning problem across multiple cities. MLA-STNet integrates two complementary modules: (i)the Spatio-Temporal Geographical Mamba-Attention (STG-MA), which suppresses unstable spatio-temporal fluctuations and strengthens long-range temporal dependencies; and (ii) the Spatio-Temporal Semantic Mamba-Attention (STS-MA), which mitigates cross-city heterogeneity through a shared-parameter design that jointly trains all cities while preserving individual semantic representation spaces. We validate the proposed framework through 75 experiments under two forecasting scenarios, full-day and high-frequency accident periods, using real-world datasets from New York City and Chicago. Compared with the state-of-the-art baselines, MLA-STNet achieves up to 6% lower RMSE, 8% higher Recall, and 5% higher MAP, while maintaining less than 1% performance variation under 50% input noise. These results demonstrate that MLA-STNet effectively unifies heterogeneous urban datasets within a scalable, robust, and interpretable Cross-City Accident Prevention System, paving the way for coordinated and data-driven urban safety management."}
{"id": "2601.05527", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05527", "abs": "https://arxiv.org/abs/2601.05527", "authors": ["Rui An", "Haohao Qu", "Wenqi Fan", "Xuequn Shang", "Qing Li"], "title": "DeMa: Dual-Path Delay-Aware Mamba for Efficient Multivariate Time Series Analysis", "comment": "Under review", "summary": "Accurate and efficient multivariate time series (MTS) analysis is increasingly critical for a wide range of intelligent applications. Within this realm, Transformers have emerged as the predominant architecture due to their strong ability to capture pairwise dependencies. However, Transformer-based models suffer from quadratic computational complexity and high memory overhead, limiting their scalability and practical deployment in long-term and large-scale MTS modeling. Recently, Mamba has emerged as a promising linear-time alternative with high expressiveness. Nevertheless, directly applying vanilla Mamba to MTS remains suboptimal due to three key limitations: (i) the lack of explicit cross-variate modeling, (ii) difficulty in disentangling the entangled intra-series temporal dynamics and inter-series interactions, and (iii) insufficient modeling of latent time-lag interaction effects. These issues constrain its effectiveness across diverse MTS tasks. To address these challenges, we propose DeMa, a dual-path delay-aware Mamba backbone. DeMa preserves Mamba's linear-complexity advantage while substantially improving its suitability for MTS settings. Specifically, DeMa introduces three key innovations: (i) it decomposes the MTS into intra-series temporal dynamics and inter-series interactions; (ii) it develops a temporal path with a Mamba-SSD module to capture long-range dynamics within each individual series, enabling series-independent, parallel computation; and (iii) it designs a variate path with a Mamba-DALA module that integrates delay-aware linear attention to model cross-variate dependencies. Extensive experiments on five representative tasks, long- and short-term forecasting, data imputation, anomaly detection, and series classification, demonstrate that DeMa achieves state-of-the-art performance while delivering remarkable computational efficiency."}
{"id": "2601.05537", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05537", "abs": "https://arxiv.org/abs/2601.05537", "authors": ["Wei Zhou", "Hong Huang", "Ruize Shi", "Bang Liu"], "title": "Scalable Heterogeneous Graph Learning via Heterogeneous-aware Orthogonal Prototype Experts", "comment": null, "summary": "Heterogeneous Graph Neural Networks(HGNNs) have advanced mainly through better encoders, yet their decoding/projection stage still relies on a single shared linear head, assuming it can map rich node embeddings to labels. We call this the Linear Projection Bottleneck: in heterogeneous graphs, contextual diversity and long-tail shifts make a global head miss fine semantics, overfit hub nodes, and underserve tail nodes. While Mixture-of-Experts(MoE) could help, naively applying it clashes with structural imbalance and risks expert collapse. We propose a Heterogeneous-aware Orthogonal Prototype Experts framework named HOPE, a plug-and-play replacement for the standard prediction head. HOPE uses learnable prototype-based routing to assign instances to experts by similarity, letting expert usage follow the natural long-tail distribution, and adds expert orthogonalization to encourage diversity and prevent collapse. Experiments on four real datasets show consistent gains across SOTA HGNN backbones with minimal overhead."}
{"id": "2601.05544", "categories": ["cs.LG", "math.OC", "stat.AP"], "pdf": "https://arxiv.org/pdf/2601.05544", "abs": "https://arxiv.org/abs/2601.05544", "authors": ["Moe Shiina", "Shunnosuke Ikeda", "Yuichi Takano"], "title": "Buffered AUC maximization for scoring systems via mixed-integer optimization", "comment": null, "summary": "A scoring system is a linear classifier composed of a small number of explanatory variables, each assigned a small integer coefficient. This system is highly interpretable and allows predictions to be made with simple manual calculations without the need for a calculator. Several previous studies have used mixed-integer optimization (MIO) techniques to develop scoring systems for binary classification; however, they have not focused on directly maximizing AUC (i.e., area under the receiver operating characteristic curve), even though AUC is recognized as an essential evaluation metric for scoring systems. Our goal herein is to establish an effective MIO framework for constructing scoring systems that directly maximize the buffered AUC (bAUC) as the tightest concave lower bound on AUC. Our optimization model is formulated as a mixed-integer linear optimization (MILO) problem that maximizes bAUC subject to a group sparsity constraint for limiting the number of questions in the scoring system. Computational experiments using publicly available real-world datasets demonstrate that our MILO method can build scoring systems with superior AUC values compared to the baseline methods based on regularization and stepwise regression. This research contributes to the advancement of MIO techniques for developing highly interpretable classification models."}
{"id": "2601.05583", "categories": ["cs.LG", "math.NA"], "pdf": "https://arxiv.org/pdf/2601.05583", "abs": "https://arxiv.org/abs/2601.05583", "authors": ["Xue Feng", "Li Wang", "Deanna Needell", "Rongjie Lai"], "title": "Learn to Evolve: Self-supervised Neural JKO Operator for Wasserstein Gradient Flow", "comment": null, "summary": "The Jordan-Kinderlehrer-Otto (JKO) scheme provides a stable variational framework for computing Wasserstein gradient flows, but its practical use is often limited by the high computational cost of repeatedly solving the JKO subproblems. We propose a self-supervised approach for learning a JKO solution operator without requiring numerical solutions of any JKO trajectories. The learned operator maps an input density directly to the minimizer of the corresponding JKO subproblem, and can be iteratively applied to efficiently generate the gradient-flow evolution. A key challenge is that only a number of initial densities are typically available for training. To address this, we introduce a Learn-to-Evolve algorithm that jointly learns the JKO operator and its induced trajectories by alternating between trajectory generation and operator updates. As training progresses, the generated data increasingly approximates true JKO trajectories. Meanwhile, this Learn-to-Evolve strategy serves as a natural form of data augmentation, significantly enhancing the generalization ability of the learned operator. Numerical experiments demonstrate the accuracy, stability, and robustness of the proposed method across various choices of energies and initial conditions."}
{"id": "2601.05586", "categories": ["cs.LG", "stat.ME", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.05586", "abs": "https://arxiv.org/abs/2601.05586", "authors": ["Shufei Ge", "Shijia Wang", "Lloyd Elliott"], "title": "Poisson Hyperplane Processes with Rectified Linear Units", "comment": null, "summary": "Neural networks have shown state-of-the-art performances in various classification and regression tasks. Rectified linear units (ReLU) are often used as activation functions for the hidden layers in a neural network model. In this article, we establish the connection between the Poisson hyperplane processes (PHP) and two-layer ReLU neural networks. We show that the PHP with a Gaussian prior is an alternative probabilistic representation to a two-layer ReLU neural network. In addition, we show that a two-layer neural network constructed by PHP is scalable to large-scale problems via the decomposition propositions. Finally, we propose an annealed sequential Monte Carlo algorithm for Bayesian inference. Our numerical experiments demonstrate that our proposed method outperforms the classic two-layer ReLU neural network. The implementation of our proposed model is available at https://github.com/ShufeiGe/Pois_Relu.git."}
{"id": "2601.05593", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05593", "abs": "https://arxiv.org/abs/2601.05593", "authors": ["Jingcheng Hu", "Yinmin Zhang", "Shijie Shang", "Xiaobo Yang", "Yue Peng", "Zhewei Huang", "Hebin Zhou", "Xin Wu", "Jie Cheng", "Fanqi Wan", "Xiangwen Kong", "Chengyuan Yao", "Kaiwen Yan", "Ailin Huang", "Hongyu Zhou", "Qi Han", "Zheng Ge", "Daxin Jiang", "Xiangyu Zhang", "Heung-Yeung Shum"], "title": "PaCoRe: Learning to Scale Test-Time Compute with Parallel Coordinated Reasoning", "comment": null, "summary": "We introduce Parallel Coordinated Reasoning (PaCoRe), a training-and-inference framework designed to overcome a central limitation of contemporary language models: their inability to scale test-time compute (TTC) far beyond sequential reasoning under a fixed context window. PaCoRe departs from the traditional sequential paradigm by driving TTC through massive parallel exploration coordinated via a message-passing architecture in multiple rounds. Each round launches many parallel reasoning trajectories, compacts their findings into context-bounded messages, and synthesizes these messages to guide the next round and ultimately produce the final answer. Trained end-to-end with large-scale, outcome-based reinforcement learning, the model masters the synthesis abilities required by PaCoRe and scales to multi-million-token effective TTC without exceeding context limits. The approach yields strong improvements across diverse domains, and notably pushes reasoning beyond frontier systems in mathematics: an 8B model reaches 94.5% on HMMT 2025, surpassing GPT-5's 93.2% by scaling effective TTC to roughly two million tokens. We open-source model checkpoints, training data, and the full inference pipeline to accelerate follow-up work."}
{"id": "2601.05597", "categories": ["cs.LG", "cs.CY"], "pdf": "https://arxiv.org/pdf/2601.05597", "abs": "https://arxiv.org/abs/2601.05597", "authors": ["Sílvia Casacuberta", "Moritz Hardt"], "title": "Good Allocations from Bad Estimates", "comment": null, "summary": "Conditional average treatment effect (CATE) estimation is the de facto gold standard for targeting a treatment to a heterogeneous population. The method estimates treatment effects up to an error $ε> 0$ in each of $M$ different strata of the population, targeting individuals in decreasing order of estimated treatment effect until the budget runs out. In general, this method requires $O(M/ε^2)$ samples. This is best possible if the goal is to estimate all treatment effects up to an $ε$ error. In this work, we show how to achieve the same total treatment effect as CATE with only $O(M/ε)$ samples for natural distributions of treatment effects. The key insight is that coarse estimates suffice for near-optimal treatment allocations. In addition, we show that budget flexibility can further reduce the sample complexity of allocation. Finally, we evaluate our algorithm on various real-world RCT datasets. In all cases, it finds nearly optimal treatment allocations with surprisingly few samples. Our work highlights the fundamental distinction between treatment effect estimation and treatment allocation: the latter requires far fewer samples."}
{"id": "2601.05607", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05607", "abs": "https://arxiv.org/abs/2601.05607", "authors": ["Zijun Min", "Bingshuai Liu", "Ante Wang", "Long Zhang", "Anxiang Zeng", "Haibo Zhang", "Jinsong Su"], "title": "Orchestrating Tokens and Sequences: Dynamic Hybrid Policy Optimization for RLVR", "comment": null, "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) offers a promising framework for optimizing large language models in reasoning tasks. However, existing RLVR algorithms focus on different granularities, and each has complementary strengths and limitations. Group Relative Policy Optimization (GRPO) updates the policy with token-level importance ratios, which preserves fine-grained credit assignment but often suffers from high variance and instability. In contrast, Group Sequence Policy Optimization (GSPO) applies single sequence-level importance ratios across all tokens in a response that better matches sequence-level rewards, but sacrifices token-wise credit assignment. In this paper, we propose Dynamic Hybrid Policy Optimization (DHPO) to bridge GRPO and GSPO within a single clipped surrogate objective. DHPO combines token-level and sequence-level importance ratios using weighting mechanisms. We explore two variants of the mixing mechanism, including an averaged mixing and an entropy-guided mixing. To further stabilize training, we employ a branch-specific clipping strategy that constrains token-level and sequence-level ratios within separate trust regions before mixing, preventing outliers in either branch from dominating the update. Across seven challenging mathematical reasoning benchmarks, experiments on both dense and MoE models from the Qwen3 series show that DHPO consistently outperforms GRPO and GSPO. We will release our code upon acceptance of this paper."}
{"id": "2601.05613", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05613", "abs": "https://arxiv.org/abs/2601.05613", "authors": ["Yiming Zhou", "Mingyue Cheng", "Hao Wang", "Enhong Chen"], "title": "PiXTime: A Model for Federated Time Series Forecasting with Heterogeneous Data Structures Across Nodes", "comment": null, "summary": "Time series are highly valuable and rarely shareable across nodes, making federated learning a promising paradigm to leverage distributed temporal data. However, different sampling standards lead to diverse time granularities and variable sets across nodes, hindering classical federated learning. We propose PiXTime, a novel time series forecasting model designed for federated learning that enables effective prediction across nodes with multi-granularity and heterogeneous variable sets. PiXTime employs a personalized Patch Embedding to map node-specific granularity time series into token sequences of a unified dimension for processing by a subsequent shared model, and uses a global VE Table to align variable category semantics across nodes, thereby enhancing cross-node transferability. With a transformer-based shared model, PiXTime captures representations of auxiliary series with arbitrary numbers of variables and uses cross-attention to enhance the prediction of the target series. Experiments show PiXTime achieves state-of-the-art performance in federated settings and demonstrates superior performance on eight widely used real-world traditional benchmarks."}
{"id": "2601.05616", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05616", "abs": "https://arxiv.org/abs/2601.05616", "authors": ["ShaoZhen Liu", "Xinting Huang", "Houwen Peng", "Xin Chen", "Xinyang Song", "Qi Li", "Zhenan Sun"], "title": "Dual-Phase LLM Reasoning: Self-Evolved Mathematical Frameworks", "comment": null, "summary": "In recent years, large language models (LLMs) have demonstrated significant potential in complex reasoning tasks like mathematical problem-solving. However, existing research predominantly relies on reinforcement learning (RL) frameworks while overlooking supervised fine-tuning (SFT) methods. This paper proposes a new two-stage training framework that enhances models' self-correction capabilities through self-generated long chain-of-thought (CoT) data. During the first stage, a multi-turn dialogue strategy guides the model to generate CoT data incorporating verification, backtracking, subgoal decomposition, and backward reasoning, with predefined rules filtering high-quality samples for supervised fine-tuning. The second stage employs a difficulty-aware rejection sampling mechanism to dynamically optimize data distribution, strengthening the model's ability to handle complex problems. The approach generates reasoning chains extended over 4 times longer while maintaining strong scalability, proving that SFT effectively activates models' intrinsic reasoning capabilities and provides a resource-efficient pathway for complex task optimization. Experimental results demonstrate performance improvements on mathematical benchmarks including GSM8K and MATH500, with the fine-tuned model achieving a substantial improvement on competition-level problems like AIME24. Code will be open-sourced."}
{"id": "2601.05623", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.05623", "abs": "https://arxiv.org/abs/2601.05623", "authors": ["Zhi Wang", "Zhongbin Wu", "Yanni Li", "Bing Liu", "Guangxi Li", "Yuping Wang"], "title": "Continual Learning of Achieving Forgetting-free and Positive Knowledge Transfer", "comment": null, "summary": "Existing research on continual learning (CL) of a sequence of tasks focuses mainly on dealing with catastrophic forgetting (CF) to balance the learning plasticity of new tasks and the memory stability of old tasks. However, an ideal CL agent should not only be able to overcome CF, but also encourage positive forward and backward knowledge transfer (KT), i.e., using the learned knowledge from previous tasks for the new task learning (namely FKT), and improving the previous tasks' performance with the knowledge of the new task (namely BKT). To this end, this paper first models CL as an optimization problem in which each sequential learning task aims to achieve its optimal performance under the constraint that both FKT and BKT should be positive. It then proposes a novel Enhanced Task Continual Learning (ETCL) method, which achieves forgetting-free and positive KT. Furthermore, the bounds that can lead to negative FKT and BKT are estimated theoretically. Based on the bounds, a new strategy for online task similarity detection is also proposed to facilitate positive KT. To overcome CF, ETCL learns a set of task-specific binary masks to isolate a sparse sub-network for each task while preserving the performance of a dense network for the task. At the beginning of a new task learning, ETCL tries to align the new task's gradient with that of the sub-network of the previous most similar task to ensure positive FKT. By using a new bi-objective optimization strategy and an orthogonal gradient projection method, ETCL updates only the weights of previous similar tasks at the classification layer to achieve positive BKT. Extensive evaluations demonstrate that the proposed ETCL markedly outperforms strong baselines on dissimilar, similar, and mixed task sequences."}
{"id": "2601.05647", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05647", "abs": "https://arxiv.org/abs/2601.05647", "authors": ["Xinyue Wang", "Stephen Wang", "Biwei Huang"], "title": "Transformer Is Inherently a Causal Learner", "comment": null, "summary": "We reveal that transformers trained in an autoregressive manner naturally encode time-delayed causal structures in their learned representations. When predicting future values in multivariate time series, the gradient sensitivities of transformer outputs with respect to past inputs directly recover the underlying causal graph, without any explicit causal objectives or structural constraints. We prove this connection theoretically under standard identifiability conditions and develop a practical extraction method using aggregated gradient attributions. On challenging cases such as nonlinear dynamics, long-term dependencies, and non-stationary systems, this approach greatly surpasses the performance of state-of-the-art discovery algorithms, especially as data heterogeneity increases, exhibiting scaling potential where causal accuracy improves with data volume and heterogeneity, a property traditional methods lack. This unifying view lays the groundwork for a future paradigm where causal discovery operates through the lens of foundation models, and foundation models gain interpretability and enhancement through the lens of causality."}
{"id": "2601.05650", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05650", "abs": "https://arxiv.org/abs/2601.05650", "authors": ["Miguel Matey-Sanz", "Joaquín Torres-Sospedra", "Joaquín Huerta", "Sergio Trilles"], "title": "From Global to Local: Cluster-Aware Learning for Wi-Fi Fingerprinting Indoor Localisation", "comment": "20 pages, 9 figures, 6 tables", "summary": "Wi-Fi fingerprinting remains one of the most practical solutions for indoor positioning, however, its performance is often limited by the size and heterogeneity of fingerprint datasets, strong Received Signal Strength Indicator variability, and the ambiguity introduced in large and multi-floor environments. These factors significantly degrade localisation accuracy, particularly when global models are applied without considering structural constraints. This paper introduces a clustering-based method that structures the fingerprint dataset prior to localisation. Fingerprints are grouped using either spatial or radio features, and clustering can be applied at the building or floor level. In the localisation phase, a clustering estimation procedure based on the strongest access points assigns unseen fingerprints to the most relevant cluster. Localisation is then performed only within the selected clusters, allowing learning models to operate on reduced and more coherent subsets of data. The effectiveness of the method is evaluated on three public datasets and several machine learning models. Results show a consistent reduction in localisation errors, particularly under building-level strategies, but at the cost of reducing the floor detection accuracy. These results demonstrate that explicitly structuring datasets through clustering is an effective and flexible approach for scalable indoor positioning."}
{"id": "2601.05679", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05679", "abs": "https://arxiv.org/abs/2601.05679", "authors": ["George Ma", "Zhongyuan Liang", "Irene Y. Chen", "Somayeh Sojoudi"], "title": "Do Sparse Autoencoders Identify Reasoning Features in Language Models?", "comment": null, "summary": "We investigate whether sparse autoencoders (SAEs) identify genuine reasoning features in large language models (LLMs). Starting from features selected using standard contrastive activation methods, we introduce a falsification-oriented framework that combines causal token injection experiments and LLM-guided falsification to test whether feature activation reflects reasoning processes or superficial linguistic correlates. Across 20 configurations spanning multiple model families, layers, and reasoning datasets, we find that identified reasoning features are highly sensitive to token-level interventions. Injecting a small number of feature-associated tokens into non-reasoning text is sufficient to elicit strong activation for 59% to 94% of features, indicating reliance on lexical artifacts. For the remaining features that are not explained by simple token triggers, LLM-guided falsification consistently produces non-reasoning inputs that activate the feature and reasoning inputs that do not, with no analyzed feature satisfying our criteria for genuine reasoning behavior. Steering these features yields minimal changes or slight degradations in benchmark performance. Together, these results suggest that SAE features identified by contrastive approaches primarily capture linguistic correlates of reasoning rather than the underlying reasoning computations themselves."}
{"id": "2601.05680", "categories": ["cs.LG", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.05680", "abs": "https://arxiv.org/abs/2601.05680", "authors": ["Yeonsang Shin", "Insoo Kim", "Bongkeun Kim", "Keonwoo Bae", "Bohyung Han"], "title": "AGDC: Autoregressive Generation of Variable-Length Sequences with Joint Discrete and Continuous Spaces", "comment": null, "summary": "Transformer-based autoregressive models excel in data generation but are inherently constrained by their reliance on discretized tokens, which limits their ability to represent continuous values with high precision. We analyze the scalability limitations of existing discretization-based approaches for generating hybrid discrete-continuous sequences, particularly in high-precision domains such as semiconductor circuit designs, where precision loss can lead to functional failure. To address the challenge, we propose AGDC, a novel unified framework that jointly models discrete and continuous values for variable-length sequences. AGDC employs a hybrid approach that combines categorical prediction for discrete values with diffusion-based modeling for continuous values, incorporating two key technical components: an end-of-sequence (EOS) logit adjustment mechanism that uses an MLP to dynamically adjust EOS token logits based on sequence context, and a length regularization term integrated into the loss function. Additionally, we present ContLayNet, a large-scale benchmark comprising 334K high-precision semiconductor layout samples with specialized evaluation metrics that capture functional correctness where precision errors significantly impact performance. Experiments on semiconductor layouts (ContLayNet), graphic layouts, and SVGs demonstrate AGDC's superior performance in generating high-fidelity hybrid vector representations compared to discretization-based and fixed-schema baselines, achieving scalable high-precision generation across diverse domains."}
{"id": "2601.05684", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05684", "abs": "https://arxiv.org/abs/2601.05684", "authors": ["Hongyaoxing Gul", "Lijuan Hu", "Shuzi Niu", "Fangfang Liu"], "title": "FLRQ: Faster LLM Quantization with Flexible Low-Rank Matrix Sketching", "comment": null, "summary": "Traditional post-training quantization (PTQ) is considered an effective approach to reduce model size and accelerate inference of large-scale language models (LLMs). However, existing low-rank PTQ methods require costly fine-tuning to determine a compromise rank for diverse data and layers in large models, failing to exploit their full potential. Additionally, the current SVD-based low-rank approximation compounds the computational overhead. In this work, we thoroughly analyze the varying effectiveness of low-rank approximation across different layers in representative models. Accordingly, we introduce \\underline{F}lexible \\underline{L}ow-\\underline{R}ank \\underline{Q}uantization (FLRQ), a novel solution designed to quickly identify the accuracy-optimal ranks and aggregate them to achieve minimal storage combinations. FLRQ comprises two powerful components, Rank1-Sketch-based Flexible Rank Selection (R1-FLR) and Best Low-rank Approximation under Clipping (BLC). R1-FLR applies the R1-Sketch with Gaussian projection for the fast low-rank approximation, enabling outlier-aware rank extraction for each layer. Meanwhile, BLC aims at minimizing the low-rank quantization error under the scaling and clipping strategy through an iterative method. FLRQ demonstrates strong effectiveness and robustness in comprehensive experiments, achieving state-of-the-art performance in both quantization quality and algorithm efficiency."}
{"id": "2601.05732", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05732", "abs": "https://arxiv.org/abs/2601.05732", "authors": ["Yongyi Yang", "Jianyang Gao"], "title": "mHC-lite: You Don't Need 20 Sinkhorn-Knopp Iterations", "comment": null, "summary": "Hyper-Connections (HC) generalizes residual connections by introducing dynamic residual matrices that mix information across multiple residual streams, accelerating convergence in deep neural networks. However, unconstrained residual matrices can compromise training stability. To address this, DeepSeek's Manifold-Constrained Hyper-Connections (mHC) approximately projects these matrices onto the Birkhoff polytope via iterative Sinkhorn--Knopp (SK) normalization. We identify two limitations of this approach: (i) finite SK iterations do not guarantee exact doubly stochasticity, leaving an approximation gap that can accumulate through network depth and undermine stability; (ii) efficient SK implementation requires highly specialized CUDA kernels, raising engineering barriers and reducing portability. Motivated by the Birkhoff--von Neumann theorem, we propose mHC-lite, a simple reparameterization that explicitly constructs doubly stochastic matrices as convex combinations of permutation matrices. This approach guarantees exact doubly stochasticity by construction and can be implemented using only native matrix operations. Extensive experiments demonstrate that mHC-lite matches or exceeds mHC in performance while achieving higher training throughput with a naive implementation and eliminating the residual instabilities observed in both HC and mHC. The code is publicly available at https://github.com/FFTYYY/mhc-lite."}
{"id": "2601.05759", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05759", "abs": "https://arxiv.org/abs/2601.05759", "authors": ["Turkan Simge Ispak", "Salih Tileylioglu", "Erdem Akagunduz"], "title": "Variational Autoencoders for P-wave Detection on Strong Motion Earthquake Spectrograms", "comment": "13 pages, 8 figures, 3 tables", "summary": "Accurate P-wave detection is critical for earthquake early warning, yet strong-motion records pose challenges due to high noise levels, limited labeled data, and complex waveform characteristics. This study reframes P-wave arrival detection as a self-supervised anomaly detection task to evaluate how architectural variations regulate the trade-off between reconstruction fidelity and anomaly discrimination. Through a comprehensive grid search of 492 Variational Autoencoder configurations, we show that while skip connections minimize reconstruction error (Mean Absolute Error approximately 0.0012), they induce \"overgeneralization\", allowing the model to reconstruct noise and masking the detection signal. In contrast, attention mechanisms prioritize global context over local detail and yield the highest detection performance with an area-under-the-curve of 0.875. The attention-based Variational Autoencoder achieves an area-under-the-curve of 0.91 in the 0 to 40-kilometer near-source range, demonstrating high suitability for immediate early warning applications. These findings establish that architectural constraints favoring global context over pixel-perfect reconstruction are essential for robust, self-supervised P-wave detection."}
{"id": "2601.05770", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.05770", "abs": "https://arxiv.org/abs/2601.05770", "authors": ["Yifan Zhang", "Wei Bi", "Kechi Zhang", "Dongming Jin", "Jie Fu", "Zhi Jin"], "title": "Weights to Code: Extracting Interpretable Algorithms from the Discrete Transformer", "comment": null, "summary": "Algorithm extraction aims to synthesize executable programs directly from models trained on specific algorithmic tasks, enabling de novo algorithm discovery without relying on human-written code. However, extending this paradigm to Transformer is hindered by superposition, where entangled features encoded in overlapping directions obstruct the extraction of symbolic expressions. In this work, we propose the Discrete Transformer, an architecture explicitly engineered to bridge the gap between continuous representations and discrete symbolic logic. By enforcing a strict functional disentanglement, which constrains Numerical Attention to information routing and Numerical MLP to element-wise arithmetic, and employing temperature-annealed sampling, our method effectively facilitates the extraction of human-readable programs. Empirically, the Discrete Transformer not only achieves performance comparable to RNN-based baselines but crucially extends interpretability to continuous variable domains. Moreover, our analysis of the annealing process shows that the efficient discrete search undergoes a clear phase transition from exploration to exploitation. We further demonstrate that our method enables fine-grained control over synthesized programs by imposing inductive biases. Collectively, these findings establish the Discrete Transformer as a robust framework for demonstration-free algorithm discovery, offering a rigorous pathway toward Transformer interpretability."}
{"id": "2601.05792", "categories": ["cs.LG", "cs.AI", "q-bio.BM"], "pdf": "https://arxiv.org/pdf/2601.05792", "abs": "https://arxiv.org/abs/2601.05792", "authors": ["Manel Gil-Sorribes", "Júlia Vilalta-Mor", "Isaac Filella-Mercè", "Robert Soliva", "Álvaro Ciudad", "Víctor Guallar", "Alexis Molina"], "title": "Tensor-DTI: Enhancing Biomolecular Interaction Prediction with Contrastive Embedding Learning", "comment": "Accepted at the Generative and Experimental Perspectives for Biomolecular Design Workshop at ICLR 2025 and at the Learning Meaningful Representations of Life Workshop at ICLR 2025", "summary": "Accurate drug-target interaction (DTI) prediction is essential for computational drug discovery, yet existing models often rely on single-modality predefined molecular descriptors or sequence-based embeddings with limited representativeness. We propose Tensor-DTI, a contrastive learning framework that integrates multimodal embeddings from molecular graphs, protein language models, and binding-site predictions to improve interaction modeling. Tensor-DTI employs a siamese dual-encoder architecture, enabling it to capture both chemical and structural interaction features while distinguishing interacting from non-interacting pairs. Evaluations on multiple DTI benchmarks demonstrate that Tensor-DTI outperforms existing sequence-based and graph-based models. We also conduct large-scale inference experiments on CDK2 across billion-scale chemical libraries, where Tensor-DTI produces chemically plausible hit distributions even when CDK2 is withheld from training. In enrichment studies against Glide docking and Boltz-2 co-folder, Tensor-DTI remains competitive on CDK2 and improves the screening budget required to recover moderate fractions of high-affinity ligands on out-of-family targets under strict family-holdout splits. Additionally, we explore its applicability to protein-RNA and peptide-protein interactions. Our findings highlight the benefits of integrating multimodal information with contrastive objectives to enhance interaction-prediction accuracy and to provide more interpretable and reliability-aware models for virtual screening."}
{"id": "2601.05807", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.05807", "abs": "https://arxiv.org/abs/2601.05807", "authors": ["Mohamed Amine Hallam", "Kuo-Kun Tseng"], "title": "Fusion Matters: Length-Aware Analysis of Positional-Encoding Fusion in Transformers", "comment": "10 pages, 5 figures. Code and reproduction materials available on GitHub", "summary": "Transformers require positional encodings to represent sequence order, yet most prior work focuses on designing new positional encodings rather than examining how positional information is fused with token embeddings. In this paper, we study whether the fusion mechanism itself affects performance, particularly in long-sequence settings. We conduct a controlled empirical study comparing three canonical fusion strategies--element-wise addition, concatenation with projection, and scalar gated fusion--under identical Transformer architectures, data splits, and random seeds. Experiments on three text classification datasets spanning short (AG News), medium (IMDB), and long (ArXiv) sequences show that fusion choice has negligible impact on short texts but produces consistent gains on long documents. To verify that these gains are structural rather than stochastic, we perform paired-seed analysis and cross-dataset comparison across sequence-length regimes. Additional experiments on the ArXiv dataset indicate that the benefit of learnable fusion generalizes across multiple positional encoding families. Finally, we explore a lightweight convolutional gating mechanism that introduces local inductive bias at the fusion level, evaluated on long documents only. Our results indicate that positional-encoding fusion is a non-trivial design choice for long-sequence Transformers and should be treated as an explicit modeling decision rather than a fixed default."}
{"id": "2601.05811", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05811", "abs": "https://arxiv.org/abs/2601.05811", "authors": ["Enrique Feito-Casares", "Francisco M. Melgarejo-Meseguer", "José-Luis Rojo-Álvarez"], "title": "Learning Reconstructive Embeddings in Reproducing Kernel Hilbert Spaces via the Representer Theorem", "comment": null, "summary": "Motivated by the growing interest in representation learning approaches that uncover the latent structure of high-dimensional data, this work proposes new algorithms for reconstruction-based manifold learning within Reproducing-Kernel Hilbert Spaces (RKHS). Each observation is first reconstructed as a linear combination of the other samples in the RKHS, by optimizing a vector form of the Representer Theorem for their autorepresentation property. A separable operator-valued kernel extends the formulation to vector-valued data while retaining the simplicity of a single scalar similarity function. A subsequent kernel-alignment task projects the data into a lower-dimensional latent space whose Gram matrix aims to match the high-dimensional reconstruction kernel, thus transferring the auto-reconstruction geometry of the RKHS to the embedding. Therefore, the proposed algorithms represent an extended approach to the autorepresentation property, exhibited by many natural data, by using and adapting well-known results of Kernel Learning Theory. Numerical experiments on both simulated (concentric circles and swiss-roll) and real (cancer molecular activity and IoT network intrusions) datasets provide empirical evidence of the practical effectiveness of the proposed approach."}
{"id": "2601.05812", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05812", "abs": "https://arxiv.org/abs/2601.05812", "authors": ["Zhanpei Huang", "Taochen chen", "Fangqing Gu", "Yiqun Zhang"], "title": "Detecting Autism Spectrum Disorder with Deep Eye Movement Features", "comment": "Accepted to CIS 2025", "summary": "Autism Spectrum Disorder (ASD) is a neurodevelopmental disorder characterized by deficits in social communication and behavioral patterns. Eye movement data offers a non-invasive diagnostic tool for ASD detection, as it is inherently discrete and exhibits short-term temporal dependencies, reflecting localized gaze focus between fixation points. These characteristics enable the data to provide deeper insights into subtle behavioral markers, distinguishing ASD-related patterns from typical development. Eye movement signals mainly contain short-term and localized dependencies. However, despite the widespread application of stacked attention layers in Transformer-based models for capturing long-range dependencies, our experimental results indicate that this approach yields only limited benefits when applied to eye movement data. This may be because discrete fixation points and short-term dependencies in gaze focus reduce the utility of global attention mechanisms, making them less efficient than architectures focusing on local temporal patterns. To efficiently capture subtle and complex eye movement patterns, distinguishing ASD from typically developing (TD) individuals, a discrete short-term sequential (DSTS) modeling framework is designed with Class-aware Representation and Imbalance-aware Mechanisms. Through extensive experiments on several eye movement datasets, DSTS outperforms both traditional machine learning techniques and more sophisticated deep learning models."}
{"id": "2601.05814", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05814", "abs": "https://arxiv.org/abs/2601.05814", "authors": ["Md Sultanul Islam Ovi", "Muhsina Tarannum Munfa", "Miftahul Alam Adib", "Syed Sabbir Hasan"], "title": "A Dual Pipeline Machine Learning Framework for Automated Multi Class Sleep Disorder Screening Using Hybrid Resampling and Ensemble Learning", "comment": "32 pages, 5 figures, 14 tables", "summary": "Accurate classification of sleep disorders, particularly insomnia and sleep apnea, is important for reducing long term health risks and improving patient quality of life. However, clinical sleep studies are resource intensive and are difficult to scale for population level screening. This paper presents a Dual Pipeline Machine Learning Framework for multi class sleep disorder screening using the Sleep Health and Lifestyle dataset. The framework consists of two parallel processing streams: a statistical pipeline that targets linear separability using Mutual Information and Linear Discriminant Analysis, and a wrapper based pipeline that applies Boruta feature selection with an autoencoder for non linear representation learning. To address class imbalance, we use the hybrid SMOTETomek resampling strategy. In experiments, Extra Trees and K Nearest Neighbors achieved an accuracy of 98.67%, outperforming recent baselines on the same dataset. Statistical testing using the Wilcoxon Signed Rank Test indicates that the improvement over baseline configurations is significant, and inference latency remains below 400 milliseconds. These results suggest that the proposed dual pipeline design supports accurate and efficient automated screening for non invasive sleep disorder risk stratification."}
{"id": "2601.05845", "categories": ["cs.LG", "stat.ME"], "pdf": "https://arxiv.org/pdf/2601.05845", "abs": "https://arxiv.org/abs/2601.05845", "authors": ["Eric Weine", "Peter Carbonetto", "Rafael A. Irizarry", "Matthew Stephens"], "title": "A New Family of Poisson Non-negative Matrix Factorization Methods Using the Shifted Log Link", "comment": null, "summary": "Poisson non-negative matrix factorization (NMF) is a widely used method to find interpretable \"parts-based\" decompositions of count data. While many variants of Poisson NMF exist, existing methods assume that the \"parts\" in the decomposition combine additively. This assumption may be natural in some settings, but not in others. Here we introduce Poisson NMF with the shifted-log link function to relax this assumption. The shifted-log link function has a single tuning parameter, and as this parameter varies the model changes from assuming that parts combine additively (i.e., standard Poisson NMF) to assuming that parts combine more multiplicatively. We provide an algorithm to fit this model by maximum likelihood, and also an approximation that substantially reduces computation time for large, sparse datasets (computations scale with the number of non-zero entries in the data matrix). We illustrate these new methods on a variety of real datasets. Our examples show how the choice of link function in Poisson NMF can substantively impact the results, and how in some settings the use of a shifted-log link function may improve interpretability compared with the standard, additive link."}
{"id": "2601.05870", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.05870", "abs": "https://arxiv.org/abs/2601.05870", "authors": ["Huilin Deng", "Hongchen Luo", "Yue Zhu", "Long Li", "Zhuoyue Chen", "Xinghao Zhao", "Ming Li", "Jihai Zhang", "Mengchang Wang", "Yang Cao", "Yu Kang"], "title": "IIB-LPO: Latent Policy Optimization via Iterative Information Bottleneck", "comment": null, "summary": "Recent advances in Reinforcement Learning with Verifiable Rewards (RLVR) for Large Language Model (LLM) reasoning have been hindered by a persistent challenge: exploration collapse. The semantic homogeneity of random rollouts often traps models in narrow, over-optimized behaviors. While existing methods leverage policy entropy to encourage exploration, they face inherent limitations. Global entropy regularization is susceptible to reward hacking, which can induce meaningless verbosity, whereas local token-selective updates struggle with the strong inductive bias of pre-trained models. To address this, we propose Latent Policy Optimization via Iterative Information Bottleneck (IIB-LPO), a novel approach that shifts exploration from statistical perturbation of token distributions to topological branching of reasoning trajectories. IIB-LPO triggers latent branching at high-entropy states to diversify reasoning paths and employs the Information Bottleneck principle both as a trajectory filter and a self-reward mechanism, ensuring concise and informative exploration. Empirical results across four mathematical reasoning benchmarks demonstrate that IIB-LPO achieves state-of-the-art performance, surpassing prior methods by margins of up to 5.3% in accuracy and 7.4% in diversity metrics."}
{"id": "2601.05889", "categories": ["cs.LG", "astro-ph.CO", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2601.05889", "abs": "https://arxiv.org/abs/2601.05889", "authors": ["Doyoung Kim", "Donghee Lee", "Hye-Sung Lee", "Jiheon Lee", "Jaeok Yi"], "title": "GlueNN: gluing patchwise analytic solutions with neural networks", "comment": "7 pages, 3 figures", "summary": "In many problems in physics and engineering, one encounters complicated differential equations with strongly scale-dependent terms for which exact analytical or numerical solutions are not available. A common strategy is to divide the domain into several regions (patches) and simplify the equation in each region. When approximate analytic solutions can be obtained in each patch, they are then matched at the interfaces to construct a global solution. However, this patching procedure can fail to reproduce the correct solution, since the approximate forms may break down near the matching boundaries. In this work, we propose a learning framework in which the integration constants of asymptotic analytic solutions are promoted to scale-dependent functions. By constraining these coefficient functions with the original differential equation over the domain, the network learns a globally valid solution that smoothly interpolates between asymptotic regimes, eliminating the need for arbitrary boundary matching. We demonstrate the effectiveness of this framework in representative problems from chemical kinetics and cosmology, where it accurately reproduces global solutions and outperforms conventional matching procedures."}
{"id": "2601.05909", "categories": ["cs.LG", "cs.AI", "cs.CY", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.05909", "abs": "https://arxiv.org/abs/2601.05909", "authors": ["Ayoub Ajarra", "Debabrota Basu"], "title": "Auditing Fairness under Model Updates: Fundamental Complexity and Property-Preserving Updates", "comment": null, "summary": "As machine learning models become increasingly embedded in societal infrastructure, auditing them for bias is of growing importance. However, in real-world deployments, auditing is complicated by the fact that model owners may adaptively update their models in response to changing environments, such as financial markets. These updates can alter the underlying model class while preserving certain properties of interest, raising fundamental questions about what can be reliably audited under such shifts.\n  In this work, we study group fairness auditing under arbitrary updates. We consider general shifts that modify the pre-audit model class while maintaining invariance of the audited property. Our goals are two-fold: (i) to characterize the information complexity of allowable updates, by identifying which strategic changes preserve the property under audit; and (ii) to efficiently estimate auditing properties, such as group fairness, using a minimal number of labeled samples.\n  We propose a generic framework for PAC auditing based on an Empirical Property Optimization (EPO) oracle. For statistical parity, we establish distribution-free auditing bounds characterized by the SP dimension, a novel combinatorial measure that captures the complexity of admissible strategic updates. Finally, we demonstrate that our framework naturally extends to other auditing objectives, including prediction error and robust risk."}
{"id": "2601.05913", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05913", "abs": "https://arxiv.org/abs/2601.05913", "authors": ["Pattarawat Chormai", "Ali Hashemi", "Klaus-Robert Müller", "Grégoire Montavon"], "title": "Distilling Lightweight Domain Experts from Large ML Models by Identifying Relevant Subspaces", "comment": "20 pages + supplement", "summary": "Knowledge distillation involves transferring the predictive capabilities of large, high-performing AI models (teachers) to smaller models (students) that can operate in environments with limited computing power. In this paper, we address the scenario in which only a few classes and their associated intermediate concepts are relevant to distill. This scenario is common in practice, yet few existing distillation methods explicitly focus on the relevant subtask. To address this gap, we introduce 'SubDistill', a new distillation algorithm with improved numerical properties that only distills the relevant components of the teacher model at each layer. Experiments on CIFAR-100 and ImageNet with Convolutional and Transformer models demonstrate that SubDistill outperforms existing layer-wise distillation techniques on a representative set of subtasks. Our benchmark evaluations are complemented by Explainable AI analyses showing that our distilled student models more closely match the decision structure of the original teacher model."}
{"id": "2601.05929", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05929", "abs": "https://arxiv.org/abs/2601.05929", "authors": ["Sidney Shapiro", "Burhanuddin Panvelwala"], "title": "Prophet as a Repro ducible Forecasting Framework: A Methodological Guide for Business and Financial Analytics", "comment": null, "summary": "Reproducibility remains a persistent challenge in forecasting research and practice, particularly in business and financial analytics where forecasts inform high-stakes decisions. Traditional forecasting methods, while theoretically interpretable, often require extensive manual tuning and are difficult to replicate in proprietary environments. Machine learning approaches offer predictive flexibility but introduce challenges related to interpretability, stochastic training procedures, and cross-environment reproducibility. This paper examines Prophet, an open-source forecasting framework developed by Meta, as a reproducibility-enabling solution that balances interpretability, standardized workflows, and accessibility. Rather than proposing a new algorithm, this study evaluates how Prophet's additive structure, open-source implementation, and standardized workflow contribute to transparent and replicable forecasting practice. Using publicly available financial and retail datasets, we compare Prophet's performance and interpretability with multiple ARIMA specifications (auto-selected, manually specified, and seasonal variants) and Random Forest under a controlled and fully documented experimental design. This multi-model comparison provides a robust assessment of Prophet's relative performance and reproducibility advantages. Through concrete Python examples, we demonstrate how Prophet facilitates efficient forecasting workflows and integration with analytical pipelines. The study positions Prophet within the broader context of reproducible research. It highlights Prophet's role as a methodological building block that supports verification, auditability, and methodological rigor. This work provides researchers and practitioners with a practical reference framework for reproducible forecasting in Python-based research workflows."}
{"id": "2601.05956", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05956", "abs": "https://arxiv.org/abs/2601.05956", "authors": ["Juaren Steiger", "Bin Li"], "title": "On the Robustness of Age for Learning-Based Wireless Scheduling in Unknown Environments", "comment": "technical report of conference paper", "summary": "The constrained combinatorial multi-armed bandit model has been widely employed to solve problems in wireless networking and related areas, including the problem of wireless scheduling for throughput optimization under unknown channel conditions. Most work in this area uses an algorithm design strategy that combines a bandit learning algorithm with the virtual queue technique to track the throughput constraint violation. These algorithms seek to minimize the virtual queue length in their algorithm design. However, in networks where channel conditions change abruptly, the resulting constraints may become infeasible, leading to unbounded growth in virtual queue lengths. In this paper, we make the key observation that the dynamics of the head-of-line age, i.e. the age of the oldest packet in the virtual queue, make it more robust when used in algorithm design compared to the virtual queue length. We therefore design a learning-based scheduling policy that uses the head-of-line age in place of the virtual queue length. We show that our policy matches state-of-the-art performance under i.i.d. network conditions. Crucially, we also show that the system remains stable even under abrupt changes in channel conditions and can rapidly recover from periods of constraint infeasibility."}
{"id": "2601.05984", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05984", "abs": "https://arxiv.org/abs/2601.05984", "authors": ["Sahibzada Saadoon Hammad", "Joaquín Huerta Guijarro", "Francisco Ramos", "Michael Gould Carlson", "Sergio Trilles Oliver"], "title": "Community-Based Model Sharing and Generalisation: Anomaly Detection in IoT Temperature Sensor Networks", "comment": "20 pages, 9 figures, Journal submission", "summary": "The rapid deployment of Internet of Things (IoT) devices has led to large-scale sensor networks that monitor environmental and urban phenomena in real time. Communities of Interest (CoIs) provide a promising paradigm for organising heterogeneous IoT sensor networks by grouping devices with similar operational and environmental characteristics. This work presents an anomaly detection framework based on the CoI paradigm by grouping sensors into communities using a fused similarity matrix that incorporates temporal correlations via Spearman coefficients, spatial proximity using Gaussian distance decay, and elevation similarities. For each community, representative stations based on the best silhouette are selected and three autoencoder architectures (BiLSTM, LSTM, and MLP) are trained using Bayesian hyperparameter optimization with expanding window cross-validation and tested on stations from the same cluster and the best representative stations of other clusters. The models are trained on normal temperature patterns of the data and anomalies are detected through reconstruction error analysis. Experimental results show a robust within-community performance across the evaluated configurations, while variations across communities are observed. Overall, the results support the applicability of community-based model sharing in reducing computational overhead and to analyse model generalisability across IoT sensor networks."}
{"id": "2601.06016", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.06016", "abs": "https://arxiv.org/abs/2601.06016", "authors": ["Þór Sverrisson", "Steinn Guðmundsson"], "title": "LookAroundNet: Extending Temporal Context with Transformers for Clinically Viable EEG Seizure Detection", "comment": null, "summary": "Automated seizure detection from electroencephalography (EEG) remains difficult due to the large variability of seizure dynamics across patients, recording conditions, and clinical settings. We introduce LookAroundNet, a transformer-based seizure detector that uses a wider temporal window of EEG data to model seizure activity. The seizure detector incorporates EEG signals before and after the segment of interest, reflecting how clinicians use surrounding context when interpreting EEG recordings. We evaluate the proposed method on multiple EEG datasets spanning diverse clinical environments, patient populations, and recording modalities, including routine clinical EEG and long-term ambulatory recordings, in order to study performance across varying data distributions. The evaluation includes publicly available datasets as well as a large proprietary collection of home EEG recordings, providing complementary views of controlled clinical data and unconstrained home-monitoring conditions. Our results show that LookAroundNet achieves strong performance across datasets, generalizes well to previously unseen recording conditions, and operates with computational costs compatible with real-world clinical deployment. The results indicate that extended temporal context, increased training data diversity, and model ensembling are key factors for improving performance. This work contributes to moving automatic seizure detection models toward clinically viable solutions."}
{"id": "2509.12515", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2509.12515", "abs": "https://arxiv.org/abs/2509.12515", "authors": ["Zequan Liang", "Ruoyu Zhang", "Wei Shao", "krishna Karthik", "Ehsan Kourkchi", "Setareh Rafatirad", "Houman Homayoun"], "title": "Rapid Adaptation of SpO2 Estimation to Wearable Devices via Transfer Learning on Low-Sampling-Rate PPG", "comment": "In the proceedings of IEEE-EMBS International Conference on Body Sensor Networks 2025", "summary": "Blood oxygen saturation (SpO2) is a vital marker for healthcare monitoring. Traditional SpO2 estimation methods often rely on complex clinical calibration, making them unsuitable for low-power, wearable applications. In this paper, we propose a transfer learning-based framework for the rapid adaptation of SpO2 estimation to energy-efficient wearable devices using low-sampling-rate (25Hz) dual-channel photoplethysmography (PPG). We first pretrain a bidirectional Long Short-Term Memory (BiLSTM) model with self-attention on a public clinical dataset, then fine-tune it using data collected from our wearable We-Be band and an FDA-approved reference pulse oximeter. Experimental results show that our approach achieves a mean absolute error (MAE) of 2.967% on the public dataset and 2.624% on the private dataset, significantly outperforming traditional calibration and non-transferred machine learning baselines. Moreover, using 25Hz PPG reduces power consumption by 40% compared to 100Hz, excluding baseline draw. Our method also attains an MAE of 3.284% in instantaneous SpO2 prediction, effectively capturing rapid fluctuations. These results demonstrate the rapid adaptation of accurate, low-power SpO2 monitoring on wearable devices without the need for clinical calibration."}
{"id": "2509.12518", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2509.12518", "abs": "https://arxiv.org/abs/2509.12518", "authors": ["Zequan Liang", "Ruoyu Zhang", "Wei Shao", "Mahdi Pirayesh Shirazi Nejad", "Ehsan Kourkchi", "Setareh Rafatirad", "Houman Homayoun"], "title": "Generalizable Blood Pressure Estimation from Multi-Wavelength PPG Using Curriculum-Adversarial Learning", "comment": "In the proceedings of IEEE-EMBS International Conference on Body Sensor Networks 2025", "summary": "Accurate and generalizable blood pressure (BP) estimation is vital for the early detection and management of cardiovascular diseases. In this study, we enforce subject-level data splitting on a public multi-wavelength photoplethysmography (PPG) dataset and propose a generalizable BP estimation framework based on curriculum-adversarial learning. Our approach combines curriculum learning, which transitions from hypertension classification to BP regression, with domain-adversarial training that confuses subject identity to encourage the learning of subject-invariant features. Experiments show that multi-channel fusion consistently outperforms single-channel models. On the four-wavelength PPG dataset, our method achieves strong performance under strict subject-level splitting, with mean absolute errors (MAE) of 14.2mmHg for systolic blood pressure (SBP) and 6.4mmHg for diastolic blood pressure (DBP). Additionally, ablation studies validate the effectiveness of both the curriculum and adversarial components. These results highlight the potential of leveraging complementary information in multi-wavelength PPG and curriculum-adversarial strategies for accurate and robust BP estimation."}
{"id": "2601.05276", "categories": ["eess.SP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05276", "abs": "https://arxiv.org/abs/2601.05276", "authors": ["Nicholas R. Rasmussen", "Rodrigue Rizk", "Longwei Wang", "Arun Singh", "KC Santosh"], "title": "Channel Selected Stratified Nested Cross Validation for Clinically Relevant EEG Based Parkinsons Disease Detection", "comment": "Submitted to IEEE Conference -> posting to Arxiv as normal", "summary": "The early detection of Parkinsons disease remains a critical challenge in clinical neuroscience, with electroencephalography offering a noninvasive and scalable pathway toward population level screening. While machine learning has shown promise in this domain, many reported results suffer from methodological flaws, most notably patient level data leakage, inflating performance estimates and limiting clinical translation. To address these modeling pitfalls, we propose a unified evaluation framework grounded in nested cross validation and incorporating three complementary safeguards: (i) patient level stratification to eliminate subject overlap and ensure unbiased generalization, (ii) multi layered windowing to harmonize heterogeneous EEG recordings while preserving temporal dynamics, and (iii) inner loop channel selection to enable principled feature reduction without information leakage. Applied across three independent datasets with a heterogeneous number of channels, a convolutional neural network trained under this framework achieved 80.6% accuracy and demonstrated state of the art performance under held out population block testing, comparable to other methods in the literature. This performance underscores the necessity of nested cross validation as a safeguard against bias and as a principled means of selecting the most relevant information for patient level decisions, providing a reproducible foundation that can extend to other biomedical signal analysis domains."}
{"id": "2601.05280", "categories": ["cs.IT", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05280", "abs": "https://arxiv.org/abs/2601.05280", "authors": ["Hector Zenil"], "title": "On the Limits of Self-Improving in LLMs and Why AGI, ASI and the Singularity Are Not Near Without Symbolic Model Synthesis", "comment": "26 pages", "summary": "We formalise recursive self-training in Large Language Models (LLMs) and Generative AI as a discrete-time dynamical system and prove that, as training data become increasingly self-generated ($α_t \\to 0$), the system undergoes inevitably degenerative dynamics. We derive two fundamental failure modes: (1) Entropy Decay, where finite sampling effects cause a monotonic loss of distributional diversity (mode collapse), and (2) Variance Amplification, where the loss of external grounding causes the model's representation of truth to drift as a random walk, bounded only by the support diameter. We show these behaviours are not contingent on architecture but are consequences of distributional learning on finite samples. We further argue that Reinforcement Learning with imperfect verifiers suffers similar semantic collapse. To overcome these limits, we propose a path involving symbolic regression and program synthesis guided by Algorithmic Probability. The Coding Theorem Method (CTM) allows for identifying generative mechanisms rather than mere correlations, escaping the data-processing inequality that binds standard statistical learning. We conclude that while purely distributional learning leads to model collapse, hybrid neurosymbolic approaches offer a coherent framework for sustained self-improvement."}
{"id": "2601.05445", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05445", "abs": "https://arxiv.org/abs/2601.05445", "authors": ["Songze Li", "Ruishi He", "Xiaojun Jia", "Jun Wang", "Zhihui Fu"], "title": "Knowledge-Driven Multi-Turn Jailbreaking on Large Language Models", "comment": null, "summary": "Large Language Models (LLMs) face a significant threat from multi-turn jailbreak attacks, where adversaries progressively steer conversations to elicit harmful outputs. However, the practical effectiveness of existing attacks is undermined by several critical limitations: they struggle to maintain a coherent progression over long interactions, often losing track of what has been accomplished and what remains to be done; they rely on rigid or pre-defined patterns, and fail to adapt to the LLM's dynamic and unpredictable conversational state. To address these shortcomings, we introduce Mastermind, a multi-turn jailbreak framework that adopts a dynamic and self-improving approach. Mastermind operates in a closed loop of planning, execution, and reflection, enabling it to autonomously build and refine its knowledge of model vulnerabilities through interaction. It employs a hierarchical planning architecture that decouples high-level attack objectives from low-level tactical execution, ensuring long-term focus and coherence. This planning is guided by a knowledge repository that autonomously discovers and refines effective attack patterns by reflecting on interactive experiences. Mastermind leverages this accumulated knowledge to dynamically recombine and adapt attack vectors, dramatically improving both effectiveness and resilience. We conduct comprehensive experiments against state-of-the-art models, including GPT-5 and Claude 3.7 Sonnet. The results demonstrate that Mastermind significantly outperforms existing baselines, achieving substantially higher attack success rates and harmfulness ratings. Moreover, our framework exhibits notable resilience against multiple advanced defense mechanisms."}
{"id": "2601.05923", "categories": ["eess.SP", "cs.AI", "cs.LG", "eess.IV", "q-bio.QM"], "pdf": "https://arxiv.org/pdf/2601.05923", "abs": "https://arxiv.org/abs/2601.05923", "authors": ["E. Middell", "L. Carlton", "S. Moradi", "T. Codina", "T. Fischer", "J. Cutler", "S. Kelley", "J. Behrendt", "T. Dissanayake", "N. Harmening", "M. A. Yücel", "D. A. Boas", "A. von Lühmann"], "title": "Cedalion Tutorial: A Python-based framework for comprehensive analysis of multimodal fNIRS & DOT from the lab to the everyday world", "comment": "33 pages main manuscript, 180 pages Supplementary Tutorial Notebooks, 12 figures, 6 tables, under review in SPIE Neurophotonics", "summary": "Functional near-infrared spectroscopy (fNIRS) and diffuse optical tomography (DOT) are rapidly evolving toward wearable, multimodal, and data-driven, AI-supported neuroimaging in the everyday world. However, current analytical tools are fragmented across platforms, limiting reproducibility, interoperability, and integration with modern machine learning (ML) workflows. Cedalion is a Python-based open-source framework designed to unify advanced model-based and data-driven analysis of multimodal fNIRS and DOT data within a reproducible, extensible, and community-driven environment. Cedalion integrates forward modelling, photogrammetric optode co-registration, signal processing, GLM Analysis, DOT image reconstruction, and ML-based data-driven methods within a single standardized architecture based on the Python ecosystem. It adheres to SNIRF and BIDS standards, supports cloud-executable Jupyter notebooks, and provides containerized workflows for scalable, fully reproducible analysis pipelines that can be provided alongside original research publications. Cedalion connects established optical-neuroimaging pipelines with ML frameworks such as scikit-learn and PyTorch, enabling seamless multimodal fusion with EEG, MEG, and physiological data. It implements validated algorithms for signal-quality assessment, motion correction, GLM modelling, and DOT reconstruction, complemented by modules for simulation, data augmentation, and multimodal physiology analysis. Automated documentation links each method to its source publication, and continuous-integration testing ensures robustness. This tutorial paper provides seven fully executable notebooks that demonstrate core features. Cedalion offers an open, transparent, and community extensible foundation that supports reproducible, scalable, cloud- and ML-ready fNIRS/DOT workflows for laboratory-based and real-world neuroimaging."}
{"id": "2601.05978", "categories": ["cs.NI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05978", "abs": "https://arxiv.org/abs/2601.05978", "authors": ["Dror Jacoby", "Yanzhi Li", "Shuyue Yu", "Nicola Di Cicco", "Hagit Messer", "Gil Zussman", "Igor Kadota"], "title": "AWaRe-SAC: Proactive Slice Admission Control under Weather-Induced Capacity Uncertainty", "comment": null, "summary": "As emerging applications demand higher throughput and lower latencies, operators are increasingly deploying millimeter-wave (mmWave) links within x-haul transport networks, spanning fronthaul, midhaul, and backhaul segments. However, the inherent susceptibility of mmWave frequencies to weather-related attenuation, particularly rain fading, complicates the maintenance of stringent Quality of Service (QoS) requirements. This creates a critical challenge: making admission decisions under uncertainty regarding future network capacity. To address this, we develop a proactive slice admission control framework for mmWave x-haul networks subject to rain-induced fluctuations. Our objective is to improve network performance, ensure QoS, and optimize revenue, thereby surpassing the limitations of standard reactive approaches. The proposed framework integrates a deep learning predictor of future network conditions with a proactive Q-learning-based slice admission control mechanism. We validate our solution using real-world data from a mmWave x-haul deployment in a dense urban area, incorporating realistic models of link capacity attenuation and dynamic slice demands. Extensive evaluations demonstrate that our proactive solution achieves 2-3x higher long-term average revenue under dynamic link conditions, providing a scalable and resilient framework for adaptive admission control."}
{"id": "2601.05988", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.05988", "abs": "https://arxiv.org/abs/2601.05988", "authors": ["Isaiah J. King", "Bernardo Trindade", "Benjamin Bowman", "H. Howie Huang"], "title": "CyberGFM: Graph Foundation Models for Lateral Movement Detection in Enterprise Networks", "comment": "17 pages; 11 figures; 8 tables", "summary": "Representing networks as a graph and training a link prediction model using benign connections is an effective method of anomaly-based intrusion detection. Existing works using this technique have shown great success using temporal graph neural networks and skip-gram-based approaches on random walks. However, random walk-based approaches are unable to incorporate rich edge data, while the GNN-based approaches require large amounts of memory to train. In this work, we propose extending the original insight from random walk-based skip-grams--that random walks through a graph are analogous to sentences in a corpus--to the more modern transformer-based foundation models. Using language models that take advantage of GPU optimizations, we can quickly train a graph foundation model to predict missing tokens in random walks through a network of computers. The graph foundation model is then finetuned for link prediction and used as a network anomaly detector. This new approach allows us to combine the efficiency of random walk-based methods and the rich semantic representation of deep learning methods. This system, which we call CyberGFM, achieved state-of-the-art results on three widely used network anomaly detection datasets, delivering a up to 2$\\times$ improvement in average precision. We found that CyberGFM outperforms all prior works in unsupervised link prediction for network anomaly detection, using the same number of parameters, and with equal or better efficiency than the previous best approaches."}
