{"id": "2601.16249", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16249", "abs": "https://arxiv.org/abs/2601.16249", "authors": ["Vy Vo", "He Zhao", "Trung Le", "Edwin V. Bonilla", "Dinh Phung"], "title": "Ordering-based Causal Discovery via Generalized Score Matching", "comment": null, "summary": "Learning DAG structures from purely observational data remains a long-standing challenge across scientific domains. An emerging line of research leverages the score of the data distribution to initially identify a topological order of the underlying DAG via leaf node detection and subsequently performs edge pruning for graph recovery. This paper extends the score matching framework for causal discovery, which is originally designated for continuous data, and introduces a novel leaf discriminant criterion based on the discrete score function. Through simulated and real-world experiments, we demonstrate that our theory enables accurate inference of true causal orders from observed discrete data and the identified ordering can significantly boost the accuracy of existing causal discovery baselines on nearly all of the settings."}
{"id": "2601.16323", "categories": ["cs.NI", "eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16323", "abs": "https://arxiv.org/abs/2601.16323", "authors": ["Belal Korany", "Peerapol Tinnakornsrisuphap", "Saadallah Kassir", "Prashanth Hande", "Hyun Yong Lee", "Thomas Stockhammer", "Hemanth Sampath"], "title": "Multi-User Content Diversity in Wireless Networks", "comment": "arXiv admin note: text overlap with arXiv:2505.04114", "summary": "Immersive applications such as eXtended Reality (XR), cloud gaming, and real-time video streaming are central to the vision of 6G networks. These applications require not only low latency and high data rates, but also consistent and high-quality User Experience (UX). Traditional rate allocation and congestion control mechanisms in wireless networks treat users uniformly based on channel conditions, rely only on network-centric Key Performance Indicators (KPIs), and ignore the content diversity, which can lead to inefficient resource utilization and degraded UX. In this paper, we introduce the concept of Multi-User Content Diversity, which recognizes that different users concurrently consume media with varying complexity, and therefore have different bitrate requirements to achieve satisfactory UX. We propose multiple different frameworks that exploit multi-user content diversity and lead to overall network-wide gains in terms of UX. For each framework, we demonstrate the required information exchange between Application Servers (ASs), Application Clients (ACs), and the network, and the algorithms that run in each of these components to optimize a network-wide UXbased objective. Simulation results demonstrate that exploiting multi-user content diversity leads to significant gains in UX capacity, UX fairness, and network utilization, when compared to conventional rate control methods. These findings highlight the potential of content-aware networking as a key enabler for emerging wireless systems."}
{"id": "2601.16324", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16324", "abs": "https://arxiv.org/abs/2601.16324", "authors": ["Rebecca Lopez", "Avantika Shrestha", "ML Tlachac", "Kevin Hickey", "Xingtong Guo", "Shichao Liu", "Elke Rundensteiner"], "title": "Student Mental Health Screening via Fitbit Data Collected During the COVID-19 Pandemic", "comment": null, "summary": "College students experience many stressors, resulting in high levels of anxiety and depression. Wearable technology provides unobtrusive sensor data that can be used for the early detection of mental illness. However, current research is limited concerning the variety of psychological instruments administered, physiological modalities, and time series parameters. In this research, we collect the Student Mental and Environmental Health (StudentMEH) Fitbit dataset from students at our institution during the pandemic. We provide a comprehensive assessment of the ability of predictive machine learning models to screen for depression, anxiety, and stress using different Fitbit modalities. Our findings indicate potential in physiological modalities such as heart rate and sleep to screen for mental illness with the F1 scores as high as 0.79 for anxiety, the former modality reaching 0.77 for stress screening, and the latter modality achieving 0.78 for depression. This research highlights the potential of wearable devices to support continuous mental health monitoring, the importance of identifying best data aggregation levels and appropriate modalities for screening for different mental ailments."}
{"id": "2601.16533", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2601.16533", "abs": "https://arxiv.org/abs/2601.16533", "authors": ["Wen Zhang", "Aimin Wang", "Geng Sun", "Jiahui Li", "Jiacheng Wang", "Changyuan Zhao", "Dusit Niyato"], "title": "UAV-Assisted Joint Data Collection and Wireless Power Transfer for Batteryless Sensor Networks", "comment": "Accepted to IEEE WCNC 2026. 6 pages, 6 figures. arXiv admin note: text overlap with arXiv:2507.07481", "summary": "The development of wireless power transfer (WPT) and Internet of Things (IoT) offers significant potential but faces challenges such as limited energy supply, dynamic environmental changes, and unstable transmission links. This paper presents an unmanned aerial vehicle (UAV)-assisted data collection and WPT scheme to support batteryless sensor (BLS) networks in remote areas. In this system, BLSs harvest energy from the UAV and utilize the harvested energy to transmit the collected data back to the UAV. The goal is to maximize the collected data volume and fairness index while minimizing the UAV energy consumption. To achieve these objectives, an optimization problem is formulated to jointly optimize the transmit power and UAV trajectory. Due to the non-convexity and dynamic nature of the problem, a deep reinforcement learning (DRL)-based algorithm is proposed to solve the problem. Specifically, this algorithm integrates prioritized experience replay and the performer module to enhance system stability and accelerate convergence. Simulation results demonstrate that the proposed approach consistently outperforms benchmark schemes in terms of collected data volume, fairness, and UAV energy consumption."}
{"id": "2601.16332", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16332", "abs": "https://arxiv.org/abs/2601.16332", "authors": ["Felipe Tobar", "Elsa Cazelles"], "title": "Efficient Gaussian process learning via subspace projections", "comment": "Accepted at IEEE ICASSP 2026", "summary": "We propose a novel training objective for GPs constructed using lower-dimensional linear projections of the data, referred to as \\emph{projected likelihood} (PL). We provide a closed-form expression for the information loss related to the PL and empirically show that it can be reduced with random projections on the unit sphere. We show the superiority of the PL, in terms of accuracy and computational efficiency, over the exact GP training and the variational free energy approach to sparse GPs over different optimisers, kernels and datasets of moderately large sizes."}
{"id": "2601.16559", "categories": ["cs.NI"], "pdf": "https://arxiv.org/pdf/2601.16559", "abs": "https://arxiv.org/abs/2601.16559", "authors": ["Roberto Pegurri", "Habu Shintaro", "Francesco Linsalata", "Wang Kui", "Tao Yu", "Eugenio Moro", "Maiya Igarashi", "Antonio Capone", "Kei Sakaguchi"], "title": "Predicting Networks Before They Happen: Experimentation on a Real-Time V2X Digital Twin", "comment": null, "summary": "Emerging safety-critical Vehicle-to-Everything (V2X) applications require networks to proactively adapt to rapid environmental changes rather than merely reacting to them. While Network Digital Twins (NDTs) offer a pathway to such predictive capabilities, existing solutions typically struggle to reconcile high-fidelity physical modeling with strict real-time constraints. This paper presents a novel, end-to-end real-time V2X Digital Twin framework that integrates live mobility tracking with deterministic channel simulation. By coupling the Tokyo Mobility Digital Twin-which provides live sensing and trajectory forecasting-with VaN3Twin-a full-stack simulator with ray tracing-we enable the prediction of network performance before physical events occur. We validate this approach through an experimental proof-of-concept deployed in Tokyo, Japan, featuring connected vehicles operating on 60 GHz links. Our results demonstrate the system's ability to predict Received Signal Strength (RSSI) with a maximum average error of 1.01 dB and reliably forecast Line-of-Sight (LoS) transitions within a maximum average end-to-end system latency of 250 ms, depending on the ray tracing level of detail. Furthermore, we quantify the fundamental trade-offs between digital model fidelity, computational latency, and trajectory prediction horizons, proving that high-fidelity and predictive digital twins are feasible in real-world urban environments."}
{"id": "2601.16301", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16301", "abs": "https://arxiv.org/abs/2601.16301", "authors": ["Sahar Golipoor", "Richard T. Brophy", "Ying Liu", "Reza Ghazalian", "Stephan Sigg"], "title": "Gesture Recognition from body-Worn RFID under Missing Data", "comment": null, "summary": "We explore hand-gesture recognition through the use of passive body-worn reflective tags. A data processing pipeline is proposed to address the issue of missing data. Specifically, missing information is recovered through linear and exponential interpolation and extrapolation. Furthermore, imputation and proximity-based inference are employed. We represent tags as nodes in a temporal graph, with edges formed based on correlations between received signal strength (RSS) and phase values across successive timestamps, and we train a graph-based convolutional neural network that exploits graph-based self-attention. The system outperforms state-of-the-art methods with an accuracy of 98.13% for the recognition of 21 gestures. We achieve 89.28% accuracy under leave-one-person-out cross-validation. We further investigate the contribution of various body locations on the recognition accuracy. Removing tags from the arms reduces accuracy by more than 10%, while removing the wrist tag only reduces accuracy by around 2%. Therefore, tag placements on the arms are more expressive for gesture recognition than on the wrist."}
{"id": "2601.16283", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16283", "abs": "https://arxiv.org/abs/2601.16283", "authors": ["Zixin Jiang", "Ruizhi Song", "Guowen Li", "Yuhang Zhang", "Zheng O'Neill", "Xuezheng Wang", "Judah Goldfeder", "Bing Dong"], "title": "BESTOpt: A Modular, Physics-Informed Machine Learning based Building Modeling, Control and Optimization Framework", "comment": null, "summary": "Modern buildings are increasingly interconnected with occupancy, heating, ventilation, and air-conditioning (HVAC) systems, distributed energy resources (DERs), and power grids. Modeling, control, and optimization of such multi-domain systems play a critical role in achieving building-sector decarbonization. However, most existing tools lack scalability and physical consistency for addressing these complex, multi-scale ecosystem problems. To bridge this gap, this study presents BESTOpt, a modular, physics-informed machine learning (PIML) framework that unifies building applications, including benchmarking, evaluation, diagnostics, control, optimization, and performance simulation. The framework adopts a cluster-domain-system/building-component hierarchy and a standardized state-action-disturbance-observation data typology. By embedding physics priors into data-driven modules, BESTOpt improves model accuracy and physical consistency under unseen conditions. Case studies on single-building and cluster scenarios demonstrate its capability for multi-level centralized and decentralized control. Looking ahead, BESTOpt lays the foundation for an open, extensible platform that accelerates interdisciplinary research toward smart, resilient, and decarbonized building ecosystems."}
{"id": "2601.16382", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16382", "abs": "https://arxiv.org/abs/2601.16382", "authors": ["Zhiyuan Li", "Yi Yu", "Hongsen He", "Yuyu Zhu", "Rodrigo C. de Lamare"], "title": "Study of Switched Step-size Based Filtered-x NLMS Algorithm for Active Noise Cancellation", "comment": "14 pages, 22 figures", "summary": "While the filtered-x normalized least mean square (FxNLMS) algorithm is widely applied due to its simple structure and easy implementation for active noise control system, it faces two critical limitations: the fixed step-size causes a trade-off between convergence rate and steady-state residual error, and its performance deteriorates significantly in impulsive noise environments. To address the step-size constraint issue, we propose the switched \\mbox{step-size} FxNLMS (SSS-FxNLMS) algorithm. Specifically, we derive the \\mbox{mean-square} deviation (MSD) trend of the FxNLMS algorithm, and then by comparing the MSD trends corresponding to different \\mbox{step-sizes}, the optimal step-size for each iteration is selected. Furthermore, to enhance the algorithm's robustness in impulsive noise scenarios, we integrate a robust strategy into the SSS-FxNLMS algorithm, resulting in a robust variant of it. The effectiveness and superiority of the proposed algorithms has been confirmed through computer simulations in different noise scenarios."}
{"id": "2601.16366", "categories": ["cs.LG", "cs.SC"], "pdf": "https://arxiv.org/pdf/2601.16366", "abs": "https://arxiv.org/abs/2601.16366", "authors": ["Shuhang Tan", "Jayson Sia", "Paul Bogdan", "Radoslav Ivanov"], "title": "Analyzing Neural Network Information Flow Using Differential Geometry", "comment": null, "summary": "This paper provides a fresh view of the neural network (NN) data flow problem, i.e., identifying the NN connections that are most important for the performance of the full model, through the lens of graph theory. Understanding the NN data flow provides a tool for symbolic NN analysis, e.g.,~robustness analysis or model repair. Unlike the standard approach to NN data flow analysis, which is based on information theory, we employ the notion of graph curvature, specifically Ollivier-Ricci curvature (ORC). The ORC has been successfully used to identify important graph edges in various domains such as road traffic analysis, biological and social networks. In particular, edges with negative ORC are considered bottlenecks and as such are critical to the graph's overall connectivity, whereas positive-ORC edges are not essential. We use this intuition for the case of NNs as well: we 1)~construct a graph induced by the NN structure and introduce the notion of neural curvature (NC) based on the ORC; 2)~calculate curvatures based on activation patterns for a set of input examples; 3)~aim to demonstrate that NC can indeed be used to rank edges according to their importance for the overall NN functionality. We evaluate our method through pruning experiments and show that removing negative-ORC edges quickly degrades the overall NN performance, whereas positive-ORC edges have little impact. The proposed method is evaluated on a variety of models trained on three image datasets, namely MNIST, CIFAR-10 and CIFAR-100. The results indicate that our method can identify a larger number of unimportant edges as compared to state-of-the-art pruning methods."}
{"id": "2601.16848", "categories": ["cs.NI", "math.NA", "stat.AP"], "pdf": "https://arxiv.org/pdf/2601.16848", "abs": "https://arxiv.org/abs/2601.16848", "authors": ["Jaume Anguera Peris", "Joakim Jaldén"], "title": "Stochastic Modeling and Resource Dimensioning of Multi-Cellular Edge Intelligent Systems", "comment": null, "summary": "Edge intelligence enables AI inference at the network edge, co-located with or near the radio access network, rather than in centralized clouds or on mobile devices. It targets low-latency, resource-constrained applications with large data volumes, requiring tight integration of wireless access and on-site computing. Yet system performance and cost-efficiency hinge on joint pre-deployment dimensioning of radio and computational resources, especially under spatial and temporal uncertainty. Prior work largely emphasizes run-time allocation or relies on simplified models that decouple radio and computing, missing end-to-end correlations in large-scale deployments. This paper introduces a unified stochastic framework to dimension multi-cell edge-intelligent systems. We model network topology with Poisson point processes, capturing random user and base-station locations, inter-cell interference, distance-based fractional power control, and peak-power constraints. By combining this with queueing theory and empirical AI inference workload profiling, we derive tractable expressions for end-to-end offloading delay. These enable a non-convex joint optimization that minimizes deployment cost under statistical QoS guarantees, expressed through strict tail-latency and inference-accuracy constraints. We prove the problem decomposes into convex subproblems, yielding global optimality. Numerical results in noise- and interference-limited regimes identify cost-efficient design regions and configurations that cause under-utilization or user unfairness. Smaller cells reduce transmission delay but raise per-request computing cost due to weaker server multiplexing, whereas larger cells show the opposite trend. Densification reduces computational costs only when frequency reuse scales with base-station density; otherwise, sparser deployments improve fairness and efficiency in interference-limited settings."}
{"id": "2601.16303", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16303", "abs": "https://arxiv.org/abs/2601.16303", "authors": ["Sahar Golipoor", "Reza Ghazalian", "Ines Lobato Mesquita", "Stephan Sigg"], "title": "Angle of Arrival Estimation for Gesture Recognition from reflective body-worn tags", "comment": null, "summary": "We investigate hand gesture recognition by leveraging passive reflective tags worn on the body. Considering a large set of gestures, distinct patterns are difficult to be captured by learning algorithms using backscattered received signal strength (RSS) and phase signals. This is because these features often exhibit similarities across signals from different gestures. To address this limitation, we explore the estimation of Angle of Arrival (AoA) as a distinguishing feature, since AoA characteristically varies during body motion. To ensure reliable estimation in our system, which employs Smart Antenna Switching (SAS), we first validate AoA estimation using the Multiple SIgnal Classification (MUSIC) algorithm while the tags are fixed at specific angles. Building on this, we propose an AoA tracking method based on Kalman smoothing. Our analysis demonstrates that, while RSS and phase alone are insufficient for distinguishing certain gesture data, AoA tracking can effectively differentiate them. To evaluate the effectiveness of AoA tracking, we implement gesture recognition system benchmarks and show that incorporating AoA features significantly boosts their performance. Improvements of up to 15% confirm the value of AoA-based enhancement."}
{"id": "2601.16315", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16315", "abs": "https://arxiv.org/abs/2601.16315", "authors": ["Maria Vabson", "Muhy Eddin Zater", "Amir Sajadi", "Kyri Baker", "Bri-Mathias Hodge"], "title": "Optimal County-Level Siting of Data Centers in the United States", "comment": null, "summary": "Data centers are growing rapidly, creating the pressing need for the development of critical infrastructure build out to support these resource-intensive large loads. Their immense consumption of electricity and, often, freshwater, continues to stress an already constrained and aging power grid and water resources. This paper presents a comprehensive modeling approach to determine the optimal locations to construct such facilities by quantifying their resource use and minimizing associated costs. The interdisciplinary modeling approach incorporates a number of factors including the power grid, telecommunications, climate, water use, and collocated generation potential. This work establishes the base model whose functionality is shown through several test cases focusing on carbon-free generation collocation on a county-level in the United States. The results suggest that while capital costs are the biggest driver, having a longer future outlook and allowing more variable generation collocation influences the model to choose sites with higher renewable potential."}
{"id": "2601.16438", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16438", "abs": "https://arxiv.org/abs/2601.16438", "authors": ["Ziwei Zhao", "Xiaoni DU", "Xingbin Qiao"], "title": "Two classes of LCD codes derived from $(\\mathcal{L},\\mathcal{P})$-TGRS codes", "comment": null, "summary": "Twisted generalized Reed-Solomon (TGRS) codes, as a flexible extension of classical generalized Reed-Solomon (GRS) codes, have attracted significant attention in recent years. In this paper, we construct two classes of LCD codes from the $(\\mathcal{L},\\mathcal{P})$-TGRS code $\\mathcal{C}_h$ of length $n$ and dimension $k$, where $\\mathcal{L}=\\{0,1,\\ldots,l\\}$ for $l\\leq n-k-1$ and $\\mathcal{P}=\\{h\\}$ for $1\\leq h\\leq k-1$. First, we derive the parity check matrix of $\\mathcal{C}_h$ and provide a necessary and sufficient condition for $\\mathcal{C}_h$ to be an AMDS code. Then, we construct two classes of LCD codes from $\\mathcal{C}_h$ by suitably choosing the evaluation points together with certain restrictions on the coefficient of $x^{h-1}$ in the polynomial associated with the twisting term. From the constructed LCD codes we further obtain two classes of LCD MDS codes. Finally, several examples are presented."}
{"id": "2601.16234", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.16234", "abs": "https://arxiv.org/abs/2601.16234", "authors": ["Juliao Braga", "Percival Henriques", "Juliana C. Braga", "Itana Stiubiener"], "title": "Algorithmic Identity Based on Metaparameters: A Path to Reliability, Auditability, and Traceability", "comment": "6 pages, 1 figure", "summary": "The use of algorithms is increasing across various fields such as healthcare, justice, finance, and education. This growth has significantly accelerated with the advent of Artificial Intelligence (AI) technologies based on Large Language Models (LLMs) since 2022. This expansion presents substantial challenges related to accountability, ethics, and transparency. This article explores the potential of the Digital Object Identifier (DOI) to identify algorithms, aiming to enhance accountability, transparency, and reliability in their development and application, particularly in AI agents and multimodal LLMs. The use of DOIs facilitates tracking the origin of algorithms, enables audits, prevents biases, promotes research reproducibility, and strengthens ethical considerations. The discussion addresses the challenges and solutions associated with maintaining algorithms identified by DOI, their application in API security, and the proposal of a cryptographic authentication protocol."}
{"id": "2601.16399", "categories": ["cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.16399", "abs": "https://arxiv.org/abs/2601.16399", "authors": ["Sihan Zeng", "Sujay Bhatt", "Sumitra Ganesh", "Alec Koppel"], "title": "A Regularized Actor-Critic Algorithm for Bi-Level Reinforcement Learning", "comment": null, "summary": "We study a structured bi-level optimization problem where the upper-level objective is a smooth function and the lower-level problem is policy optimization in a Markov decision process (MDP). The upper-level decision variable parameterizes the reward of the lower-level MDP, and the upper-level objective depends on the optimal induced policy. Existing methods for bi-level optimization and RL often require second-order information, impose strong regularization at the lower level, or inefficiently use samples through nested-loop procedures. In this work, we propose a single-loop, first-order actor-critic algorithm that optimizes the bi-level objective via a penalty-based reformulation. We introduce into the lower-level RL objective an attenuating entropy regularization, which enables asymptotically unbiased upper-level hyper-gradient estimation without solving the unregularized RL problem exactly. We establish the finite-time and finite-sample convergence of the proposed algorithm to a stationary point of the original, unregularized bi-level optimization problem through a novel lower-level residual analysis under a special type of Polyak-Lojasiewicz condition. We validate the performance of our method through experiments on a GridWorld goal position problem and on happy tweet generation through reinforcement learning from human feedback (RLHF)."}
{"id": "2601.16950", "categories": ["cs.NI", "cs.MM", "eess.IV"], "pdf": "https://arxiv.org/pdf/2601.16950", "abs": "https://arxiv.org/abs/2601.16950", "authors": ["Ferran Maura", "Francesc Wilhelmi", "Boris Bellalta"], "title": "Evaluating Wi-Fi Performance for VR Streaming: A Study on Realistic HEVC Video Traffic", "comment": null, "summary": "Cloud-based Virtual Reality (VR) streaming presents significant challenges for 802.11 networks due to its high throughput and low latency requirements. When multiple VR users share a Wi-Fi network, the resulting uplink and downlink traffic can quickly saturate the channel. This paper investigates the capacity of 802.11 networks for supporting realistic VR streaming workloads across varying frame rates, bitrates, codec settings, and numbers of users. We develop an emulation framework that reproduces Air Light VR (ALVR) operation, where real HEVC video traffic is fed into an 802.11 simulation model. Our findings explore Wi-Fi's performance anomaly and demonstrate that Intra-refresh (IR) coding effectively reduces latency variability and improves QoS, supporting up to 4 concurrent VR users with Constant Bitrate (CBR) 100 Mbps before the channel is saturated."}
{"id": "2601.16421", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16421", "abs": "https://arxiv.org/abs/2601.16421", "authors": ["Gautham Reddy", "Ismail Guvenc", "Mihail L. Sichitiu", "Arupjyoti Bhuyan", "Bryton Petersen", "Jason Abrahamson"], "title": "TransfoREM: Transformer aided 3D Radio Environment Mapping", "comment": "This paper has been submitted to IEEE ICC 2026", "summary": "Providing reliable cellular connectivity to Unmanned Aerial Vehicles (UAV) is a key challenge, as existing terrestrial networks are deployed mainly for ground-level coverage. The cellular network coverage may be available for a limited range from the antenna side lobes, with poor connectivity further exacerbated by UAV flight dynamics. In this work, we propose TransfoREM, a 3D Radio Environment Map (REM) generation method that combines deterministic channel models and real-world data to map terrestrial network coverage at higher altitudes. At the core of our solution is a transformer model that translates radio propagation mapping into a sequence prediction task to construct REMs. Our results demonstrate that TransfoREM offers improved interpolation capability on real-world data compared against conventional Kriging and other machine learning (ML) techniques. Furthermore, TransfoREM is designed for holistic integration into cellular networks at the base station (BS) level, where it can build REMs, which can then be leveraged for enhanced resource allocation, interference management, and spatial spectrum utilization."}
{"id": "2601.16418", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16418", "abs": "https://arxiv.org/abs/2601.16418", "authors": ["Xueqing Gao", "Jun Zhang", "Tao Li", "Mingming Zhang"], "title": "Robust Grid-Forming Control Based on Virtual Flux Observer", "comment": "This is a six-page conference paper to be included in the proceedings of the 2026 IEEE Applied Power Electronics Conference and Exposition (APEC 2026)", "summary": "This paper investigates the design and analysis of a novel grid-forming (GFM) control method for grid-connected converters (GCCs). The core novelty lies in a virtual flux observer-based synchronization and load angle control method. The terminal voltage of the converter is directly regulated to provide voltage-source behavior. The control parameters are designed for decoupling and pole placement. The proposed method exhibits strong robustness in stability and dynamical performance across varying and uncertain grid strengths. The robust control performance of the proposed method is first demonstrated by small-signal analysis, then validated by experiments on a 20 kVA power conversion system."}
{"id": "2601.16455", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16455", "abs": "https://arxiv.org/abs/2601.16455", "authors": ["Qian Zhang", "Yufei Zhao", "Jiancheng An", "Zheng Dong", "Yong Liang Guan", "Ju Liu", "Chau Yuen"], "title": "Cramér-Rao Bound Minimization for Flexible Intelligent Metasurface-Enabled ISAC Systems", "comment": null, "summary": "Integrated sensing and communication (ISAC) have been widely recognized as a key enabler for future wireless networks, where the Cramér-Rao bound (CRB) plays a central role in quantifying sensing accuracy.In this paper, we present the first study on CRB minimization in flexible intelligent metasurface (FIM)-enabled ISAC systems.Specifically, we first derive an average CRB expression that explicitly depends on FIM surface shape and demonstrate that array reconfigurability can substantially reduce the CRB, thereby significantly enhancing sensing performance.Moreover, to tackle the challenging CRB minimization problem, we adopt average Fisher information maximization as a surrogate objective and use the Gauss-Hermite quadrature method to obtain an explicit approximation of the objective function.The resulting problem is then decoupled into three subproblem, i.e., beamforming optimization and transmit/receive FIM surface shape optimization.For beamforming optimization, we employ the Schur complement and penalty-based semi-definite relaxation (SDR) technique to solve it.Furthermore, we propose a fixed-point equation method and a projected gradient algorithm to optimize the surface shapes of the receive and transmit FIMs, respectively.Simulation results demonstrate that, compared to rigid arrays, surface shaping of both transmit and receive FIMs can significantly reduce the average sensing CRB while maintaining communication quality, and remains effective even in multi-target scenarios."}
{"id": "2601.16241", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16241", "abs": "https://arxiv.org/abs/2601.16241", "authors": ["Xinyu Li", "Jinyang Huang", "Feng-Qi Cui", "Meng Wang", "Peng Zhao", "Meng Li", "Dan Guo", "Meng Wang"], "title": "A New Paradigm for Trusted Respiratory Monitoring Via Consumer Electronics-grade Radar Signals", "comment": null, "summary": "Respiratory monitoring is an extremely important task in modern medical services. Due to its significant advantages, e.g., non-contact, radar-based respiratory monitoring has attracted widespread attention from both academia and industry. Unfortunately, though it can achieve high monitoring accuracy, consumer electronics-grade radar data inevitably contains User-sensitive Identity Information (USI), which may be maliciously used and further lead to privacy leakage. To track these challenges, by variational mode decomposition (VMD) and adversarial loss-based encryption, we propose a novel Trusted Respiratory Monitoring paradigm, Tru-RM, to perform automated respiratory monitoring through radio signals while effectively anonymizing USI. The key enablers of Tru-RM are Attribute Feature Decoupling (AFD), Flexible Perturbation Encryptor (FPE), and robust Perturbation Tolerable Network (PTN) used for attribute decomposition, identity encryption, and perturbed respiratory monitoring, respectively. Specifically, AFD is designed to decompose the raw radar signals into the universal respiratory component, the personal difference component, and other unrelated components. Then, by using large noise to drown out the other unrelated components, and the phase noise algorithm with a learning intensity parameter to eliminate USI in the personal difference component, FPE is designed to achieve complete user identity information encryption without affecting respiratory features. Finally, by designing the transferred generalized domain-independent network, PTN is employed to accurately detect respiration when waveforms change significantly. Extensive experiments based on various detection distances, respiratory patterns, and durations demonstrate the superior performance of Tru-RM on strong anonymity of USI, and high detection accuracy of perturbed respiratory waveforms."}
{"id": "2601.16403", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16403", "abs": "https://arxiv.org/abs/2601.16403", "authors": ["Zhaochun Li", "Mingyang Yi", "Yue Wang", "Shisheng Cui", "Yong Liu"], "title": "Towards a Theoretical Understanding to the Generalization of RLHF", "comment": "31 pages, 6 figures", "summary": "Reinforcement Learning from Human Feedback (RLHF) and its variants have emerged as the dominant approaches for aligning Large Language Models with human intent. While empirically effective, the theoretical generalization properties of these methods in high-dimensional settings remain to be explored. To this end, we build the generalization theory on RLHF of LLMs under the linear reward model, through the framework of algorithmic stability. In contrast to the existing works built upon the consistency of maximum likelihood estimations on reward model, our analysis is presented under an end-to-end learning framework, which is consistent with practice. Concretely, we prove that under a key \\textbf{feature coverage} condition, the empirical optima of policy model have a generalization bound of order $\\mathcal{O}(n^{-\\frac{1}{2}})$. Moreover, the results can be extrapolated to parameters obtained by gradient-based learning algorithms, i.e., Gradient Ascent (GA) and Stochastic Gradient Ascent (SGA). Thus, we argue that our results provide new theoretical evidence for the empirically observed generalization of LLMs after RLHF."}
{"id": "2601.16442", "categories": ["eess.SP", "cs.HC", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2601.16442", "abs": "https://arxiv.org/abs/2601.16442", "authors": ["Masahiro Yoshino", "Haruki Yokota", "Junya Hara", "Yuichi Tanaka", "Hiroshi Higashi"], "title": "Auditory Attention Decoding without Spatial Information: A Diotic EEG Study", "comment": null, "summary": "Auditory attention decoding (AAD) identifies the attended speech stream in multi-speaker environments by decoding brain signals such as electroencephalography (EEG). This technology is essential for realizing smart hearing aids that address the cocktail party problem and for facilitating objective audiometry systems. Existing AAD research mainly utilizes dichotic environments where different speech signals are presented to the left and right ears, enabling models to classify directional attention rather than speech content. However, this spatial reliance limits applicability to real-world scenarios, such as the \"cocktail party\" situation, where speakers overlap or move dynamically. To address this challenge, we propose an AAD framework for diotic environments where identical speech mixtures are presented to both ears, eliminating spatial cues. Our approach maps EEG and speech signals into a shared latent space using independent encoders. We extract speech features using wav2vec 2.0 and encode them with a 2-layer 1D convolutional neural network (CNN), while employing the BrainNetwork architecture for EEG encoding. The model identifies the attended speech by calculating the cosine similarity between EEG and speech representations. We evaluate our method on a diotic EEG dataset and achieve 72.70% accuracy, which is 22.58% higher than the state-of-the-art direction-based AAD method."}
{"id": "2601.16502", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16502", "abs": "https://arxiv.org/abs/2601.16502", "authors": ["Jian Xu", "Xinxiong Jiang", "Yi Bao", "Yuchen Zheng", "Xuhui Chen", "Qiang Xu", "Siyang Liao", "Deping Ke", "Xiaoqi Gao"], "title": "Sequential Operating Simulation of Solid State Transformer-Driven Next-Generation 800 VDC Data Center", "comment": null, "summary": "Artificial-intelligence (AI) workloads are driving rapid growth in data-center electricity use and rack power density, increasing demand for power-delivery systems that are efficient and robust to fast load transients. Conventional uninterruptible power supply (UPS) based AC distribution chains involve multiple conversion stages and line-frequency transformers, which compound losses and are less compatible with dynamic AI power profiles. Although solid-state transformers (SSTs) and 800 VDC distribution architecture are widely discussed, implementable topology/control details, and long-horizon validation with realistic operating profiles remain limited. This paper develops an SST-driven 800 VDC architecture that converts 10 kV MVAC to an 800V LVDC bus using a three-phase H-bridge AC/DC stage cascaded with a dual-active-bridge (DAB) DC/DC stage. A coordinated closed-loop control scheme, combining rectifier voltage/current regulation and DAB phase-shift control, is designed to maintain DC-bus voltage stability. The proposed system is implemented on the real-time digital simulation (RTDS) platform and evaluated via sequential simulations using real-world day- and month-scale operating profiles of data centers, benchmarked against a UPS supply chain. Numerical studies demonstrate tight 800 VDC regulation, reduced input-side energy consumption compared with the UPS baseline, and satisfactory power-quality performance. A capacitance sensitivity test quantifies tradeoffs between DC-bus ripple and low-frequency input-power oscillations, yielding a practical capacitance range for design. Overall, the work provides a reproducible evaluation workflow and actionable guidance for next-generation AI data centers."}
{"id": "2601.16461", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16461", "abs": "https://arxiv.org/abs/2601.16461", "authors": ["Anuj Kumar Yadav", "Dan Song", "Yanina Shkel", "Ayfer Özgür"], "title": "Log-Likelihood Loss for Semantic Compression", "comment": "18 pages, 4 figures", "summary": "We study lossy source coding under a distortion measure defined by the negative log-likelihood induced by a prescribed conditional distribution $P_{X|U}$. This \\emph{log-likelihood distortion} models compression settings in which the reconstruction is a semantic representation from which the source can be probabilistically generated, rather than a pointwise approximation. We formulate the corresponding rate-distortion problem and characterize fundamental properties of the resulting rate-distortion function, including its connections to lossy compression under log-loss, classical rate-distortion problems with arbitrary distortion measures, and rate-distortion with perfect perception."}
{"id": "2601.16298", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.16298", "abs": "https://arxiv.org/abs/2601.16298", "authors": ["Shaoyu Li", "Hexuan Yu", "Md Mohaimin Al Barat", "Yang Xiao", "Y. Thomas Hou", "Wenjing Lou"], "title": "FC-GUARD: Enabling Anonymous yet Compliant Fiat-to-Cryptocurrency Exchanges", "comment": "10 pages", "summary": "With the rise of decentralized finance, fiat-to-cryptocurrency exchange platforms have become popular entry points into the cryptocurrency ecosystem. However, these platforms frequently fail to ensure adequate privacy protection, as evidenced by real-world breaches that exposed personally identifiable information (PII) and crypto addresses. Such leaks enable adversaries to link real-world identities to cryptocurrency transactions, undermining the presumed anonymity of cryptocurrency use.\n  We propose FC-GUARD, a privacy-preserving exchange system designed to preserve user anonymity without compromising regulatory compliance in the exchange of fiat currency for cryptocurrencies. Leveraging verifiable credentials and zero-knowledge proof techniques, FC-GUARD enables fiat-to-cryptocurrency exchanges without revealing users' PII or fiat account details. This breaks the linkage between users' real-world identities and their cryptocurrency addresses, thereby upholding anonymity, a fundamental expectation in the cryptocurrency ecosystem. In addition, FC-GUARD complies with key regulations over cryptocurrency usage, such as know-your-customer requirements and auditability for tax reporting obligations by integrating a lawful de-anonymization mechanism that allows the auditing authority to identify misbehaving users. This ensures regulatory compliance while defaulting to privacy protection. We implement our system on both desktop and mobile platforms, and our evaluation shows its feasibility for practical deployment."}
{"id": "2601.16406", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16406", "abs": "https://arxiv.org/abs/2601.16406", "authors": ["Vitaly Bulgakov", "Alexander Turchin"], "title": "Reasoning-Enhanced Rare-Event Prediction with Balanced Outcome Correction", "comment": "28 pages, 12 figures, provisional patent", "summary": "Rare-event prediction is critical in domains such as healthcare, finance, reliability engineering, customer support, aviation safety, where positive outcomes are infrequent yet potentially catastrophic. Extreme class imbalance biases conventional models toward majority-class predictions, limiting recall, calibration, and operational usefulness. We propose LPCORP (Low-Prevalence CORrector for Prediction)*, a two-stage framework that combines reasoningenhanced prediction with confidence-based outcome correction. A reasoning model first produces enriched predictions from narrative inputs, after which a lightweight logistic-regression classifier evaluates and selectively corrects these outputs to mitigate prevalence-driven bias. We evaluate LPCORP on real-world datasets from medical and consumer service domains. The results show that this method transforms a highly imbalanced setting into a well-balanced one while preserving the original number of samples and without applying any resampling strategies. Test-set evaluation demonstrates substantially improved performance, particularly in precision, which is a known weakness in low-prevalence data. We further provide a costreduction analysis comparing the expenses associated with rare-event damage control without preventive measures to those incurred when low-cost, prediction-based preventive interventions are applied that showed more than 50% reduction in some cases. * Patent pending: U.S. Provisional 63/933,518, filed 8 December 2025."}
{"id": "2601.16543", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16543", "abs": "https://arxiv.org/abs/2601.16543", "authors": ["Xingxiang Peng", "Qingqing Wu", "Ziyuan Zheng", "Yanze Zhu", "Wen Chen", "Penghui Huang", "Ying Gao", "Honghao Wang"], "title": "Cell-Free MIMO with Rotatable Antennas: When Macro-Diversity Meets Antenna Directivity", "comment": "12 pages, 7 figures. Submitted to an IEEE journal for possible publication", "summary": "Cell-free networks leverage distributed access points (APs) to achieve macro-diversity, yet their performance is often constrained by large disparities in channel quality arising from user geometry and blockages. To address this, rotatable antennas (RAs) add a lightweight hardware degree of freedom by steering the antenna boresight toward dominant propagation directions to strengthen unfavorable links, thereby enabling the network to better exploit macro-diversity for higher and more uniform performance. This paper investigates an RA-enabled cell-free downlink network and formulates a max-min rate problem that jointly optimizes transmit beamforming and antenna orientations. To tackle this challenging problem, we develop an alternating-optimization-based algorithm that iteratively updates the beamformers via a second-order cone program (SOCP) and optimizes the antenna orientations using successive convex approximation. To reduce complexity, we further propose an efficient two-stage scheme that first designs orientations by maximizing a proportional-fair log-utility using manifold-aware Frank-Wolfe updates, and then computes the beamformers using an SOCP-based design. Simulation results demonstrate that the proposed orientation-aware designs achieve a substantially higher worst-user rate than conventional beamforming-only benchmarks. Furthermore, larger antenna directivity enhances fairness with proper orientation but can degrade the worst-user performance otherwise."}
{"id": "2601.16565", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16565", "abs": "https://arxiv.org/abs/2601.16565", "authors": ["Lingxiao Sun", "Zhaoyang Zhang", "Zihan Lin", "Zirui Chen", "Weijie Zhou", "Zhaohui Yang", "Tony Q. S. Quek"], "title": "Agentic AI-RAN Empowering Synergetic Sensing, Communication, Computing, and Control", "comment": null, "summary": "Future sixth-generation (6G) networks are expected to support low-altitude wireless networks (LAWNs), where unmanned aerial vehicles (UAVs) and aerial robots operate in highly dynamic three-dimensional environments under stringent latency, reliability, and autonomy requirements. In such scenarios, autonomous task execution at the network edge demands holistic coordination among sensing, communication, computing, and control (SC3) processes. Agentic Artificially Intelligent Radio Access Networks (Agentic AI-RAN) offer a promising paradigm by enabling the edge network to function as an autonomous decision-making entity for low-altitude agents with limited onboard resources. In this article, we propose and design a task-oriented Agentic AI-RAN architecture that enables SC3 task execution within a single edge node. This integrated design tackles the fundamental problem of coordinating heterogeneous workloads in resource-constrained edge environments. Furthermore, a representative low-altitude embodied intelligence system is prototyped based on a general-purpose Graphics Processing Unit (GPU) platform to demonstrate autonomous drone navigation in realistic settings. By leveraging the Multi-Instance GPU (MIG) partitioning technique and the containerized deployment, the demonstration system achieves physical resource isolation while supporting tightly coupled coordination between real-time communication and multimodal inference under a unified task framework. Experimental results demonstrate low closed-loop latency, robust bidirectional communication, and stable performance under dynamic runtime conditions, highlighting its viability for mission-critical low-altitude wireless networks in 6G."}
{"id": "2601.16495", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16495", "abs": "https://arxiv.org/abs/2601.16495", "authors": ["Shivani Singh", "Amudheesan Nakkeeran", "Prem Singh", "Ekant Sharma", "Jyotsna Bapat"], "title": "Load Balanced ISAC Systems for URLLC Users", "comment": null, "summary": "This paper presents an energy-efficient downlink cell-free massive multiple-input multiple-output (CF-mMIMO) integrated sensing and communication (ISAC) network that serves ultra-reliable low-latency communication (URLLC) users while simultaneously detecting a target. We propose a load-balancing algorithm that minimizes the total network power consumption; including transmit power, fixed static power, and traffic-dependent fronthaul power at the access points (APs) without degrading system performance. To this end, we formulate a mixed-integer non-convex optimization problem and introduce an iterative joint power allocation and AP load balancing (JPALB) algorithm. The algorithm aims to reduce total power usage while meeting both the communication quality-of-service (QoS) requirements of URLLC users and the sensing QoS needed for target detection. Proposed JPALB algorithm for ISAC systems was simulated with maximum-ratio transmission (MRT) and regularized zero-forcing (RZF) precoders. Simulation results show approximately 33% reduction in power consumption, using JPALB algorithm compared to a baseline with no load balancing, without compromising communication and sensing QoS requirements."}
{"id": "2601.16354", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16354", "abs": "https://arxiv.org/abs/2601.16354", "authors": ["Khoa Nguyen", "Khiem Ton", "NhatHai Phan", "Issa Khalil", "Khang Tran", "Cristian Borcea", "Ruoming Jin", "Abdallah Khreishah", "My T. Thai"], "title": "NOIR: Privacy-Preserving Generation of Code with Open-Source LLMs", "comment": "To appear at Usenix Security Symposium 2026", "summary": "Although boosting software development performance, large language model (LLM)-powered code generation introduces intellectual property and data security risks rooted in the fact that a service provider (cloud) observes a client's prompts and generated code, which can be proprietary in commercial systems. To mitigate this problem, we propose NOIR, the first framework to protect the client's prompts and generated code from the cloud. NOIR uses an encoder and a decoder at the client to encode and send the prompts' embeddings to the cloud to get enriched embeddings from the LLM, which are then decoded to generate the code locally at the client. Since the cloud can use the embeddings to infer the prompt and the generated code, NOIR introduces a new mechanism to achieve indistinguishability, a local differential privacy protection at the token embedding level, in the vocabulary used in the prompts and code, and a data-independent and randomized tokenizer on the client side. These components effectively defend against reconstruction and frequency analysis attacks by an honest-but-curious cloud. Extensive analysis and results using open-source LLMs show that NOIR significantly outperforms existing baselines on benchmarks, including the Evalplus (MBPP and HumanEval, Pass@1 of 76.7 and 77.4), and BigCodeBench (Pass@1 of 38.7, only a 1.77% drop from the original LLM) under strong privacy against attacks."}
{"id": "2601.16411", "categories": ["cs.LG", "math.CA", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.16411", "abs": "https://arxiv.org/abs/2601.16411", "authors": ["A. Iosevich", "A. Vagharshakyan", "E. Wyman"], "title": "A Refinement of Vapnik--Chervonenkis' Theorem", "comment": null, "summary": "Vapnik--Chervonenkis' theorem is a seminal result in machine learning. It establishes sufficient conditions for empirical probabilities to converge to theoretical probabilities, uniformly over families of events. It also provides an estimate for the rate of such uniform convergence.\n  We revisit the probabilistic component of the classical argument. Instead of applying Hoeffding's inequality at the final step, we use a normal approximation with explicit Berry--Esseen error control. This yields a moderate-deviation sharpening of the usual VC estimate, with an additional factor of order $(\\varepsilon\\sqrt{n})^{-1}$ in the leading exponential term when $\\varepsilon\\sqrt{n}$ is large."}
{"id": "2601.16550", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16550", "abs": "https://arxiv.org/abs/2601.16550", "authors": ["Eike-Manuel Edelmann"], "title": "Spiking Neural Networks for Communication Systems: Encoding Schemes, Learning Algorithms, and Equalization~Techniques", "comment": "PhD thesis (accepted, Karlsruhe Institute of Technology)", "summary": "Machine learning with artificial neural networks (ANNs), provides solutions for the growing complexity of modern communication systems. This complexity, however, increases power consumption, making the systems energy-intensive. Spiking neural networks (SNNs) represent a novel generation of neural networks inspired by the highly efficient human brain. By emulating its event-driven and energy-efficient mechanisms, SNNs enable low-power, real-time signal processing. They differ from ANNs in two key ways: they exhibit inherent temporal dynamics and process and transmit information as short binary signals called spikes. Despite their promise, major challenges remain, e.g., identifying optimal learning rules and effective neural encoding. This thesis investigates the design of SNN-based receivers for nonlinear time-invariant frequency-selective channels. Backpropagation through time with surrogate gradients is identified as a promising update rule and the novel quantization encoding (QE) as promising neural encoding. Given the model of the intensity modulation with direct detection link, we compare two different receiver architectures based on equalization performance and spike count. Using decision feedback and QE achieves both strong performance and low spike counts. Notably, SNN-based receivers significantly outperform ANN-based counterparts. We furthermore introduce policy gradient-based update (PGU), an reinforcement learning-based update algorithm that requires no backpropagation. Using PGU, encoding parameters are optimized, drastically reducing runtime, complexity, and spikes per inference while maintaining performance. This thesis contributes a successful design and optimization framework for SNN-based receivers. By addressing key challenges in SNN optimization, it facilitates future advances in the design and deployment of energy-efficient SNN receivers."}
{"id": "2601.16612", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16612", "abs": "https://arxiv.org/abs/2601.16612", "authors": ["Antonio Bracale", "Jakub Janowicz", "Piotr Kuwałek", "Grzegorz Wiczyński"], "title": "Challenges in the Proper Metrological Verification of Smart Energy Meters", "comment": "5 pages, 4 figures, submitted to IEEE conferences", "summary": "The most common instruments currently measuring active/reactive energy and power quality indicators are smart energy meters. Unfortunately, the verification of such meters is currently performed under ideal conditions or with simple signal models, which do not recreate actual states occurring in the power grid and do not ensure the verification of the properties of their signal chains. This paper presents challenges in the proper metrological verification of smart energy meters. It presents existing legal and normative requirements and scientific research directions regarding these meters. Selected test results are presented, which show that although the tested meters meet the normative and legal requirements because they have been approved for sale, numerous imperfections in the signal and measurement chains of the analyzed instruments are revealed for the selected test signal. On the basis of the presented research results, further directions of research in the field of smart energy meters have been determined."}
{"id": "2601.16518", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16518", "abs": "https://arxiv.org/abs/2601.16518", "authors": ["Zimu Li", "Bingyi Liu", "Lei Zhao", "Qian Zhang", "Yang Liu", "Jun Liu", "Ke Ke", "Huating Kong", "Xiaolei Zuo", "Chunhai Fan", "Fei Wang"], "title": "Noise-immune and AI-enhanced DNA storage via adaptive partition mapping of digital data", "comment": null, "summary": "Encoding digital information into DNA sequences offers an attractive potential solution for storing rapidly growing data under the information age and the rise of artificial intelligence. However, practical implementations of DNA storage are constrained by errors introduced during synthesis, preservation, and sequencing processes, and traditional error-correcting codes remain vulnerable to noise levels that exceed predefined thresholds. Here, we developed a Partitioning-mapping with Jump-rotating (PJ) encoding scheme, which exhibits exceptional noise resilience. PJ removes cross-strand information dependencies so that strand loss manifests as localized gaps rather than catastrophic file failure. It prioritizes file decodability under arbitrary noise conditions and leverages AI-based inference to enable controllable recovery of digital information. For the intra-strand encoding, we develop a jump-rotating strategy that relaxes sequence constraints relative to conventional rotating codes and provides tunable information density via an adjustable jump length. Based on this encoding architecture, the original file information can always be decoded and recovered under any strand loss ratio, with fidelity degrading smoothly as damage increases. We demonstrate that original files can be effectively recovered even with 10% strand loss, and machine learning datasets stored under these conditions retain their classification performance. Experiments further confirmed that PJ successfully decodes image files after extreme environmental disturbance using accelerated aging and high-intensity X-ray irradiation. By eliminating reliance on prior error probabilities, PJ establishes a general framework for robust, archival DNA storage capable of withstanding the rigorous conditions of real-world preservation."}
{"id": "2601.16448", "categories": ["cs.CR", "cs.OS"], "pdf": "https://arxiv.org/pdf/2601.16448", "abs": "https://arxiv.org/abs/2601.16448", "authors": ["Richard Habeeb", "Man-Ki Yoon", "Hao Chen Zhong Shao"], "title": "Ringmaster: How to juggle high-throughput host OS system calls from TrustZone TEEs", "comment": null, "summary": "Many safety-critical systems require timely processing of sensor inputs to avoid potential safety hazards. Additionally, to support useful application features, such systems increasingly have a large rich operating system (OS) at the cost of potential security bugs. Thus, if a malicious party gains supervisor privileges, they could cause real-world damage by denying service to time-sensitive programs. Many past approaches to this problem completely isolate time-sensitive programs with a hypervisor; however, this prevents the programs from accessing useful OS services\n  We introduce Ringmaster, a novel framework that enables enclaves or TEEs (Trusted Execution Environments) to asynchronously access rich, but potentially untrusted, OS services via Linux's io_uring. When service is denied by the untrusted OS, enclaves continue to operate on Ringmaster's minimal ARM TrustZone kernel with access to small, critical device drivers. This approach balances the need for secure, time-sensitive processing with the convenience of rich OS services. Additionally, Ringmaster supports large unmodified programs as enclaves, offering lower overhead compared to existing systems. We demonstrate how Ringmaster helps us build a working highly-secure system with minimal engineering. In our experiments with an unmanned aerial vehicle, Ringmaster achieved nearly 1GiB/sec of data into enclave on a Raspberry Pi4b, 0-3% throughput overhead compared to non-enclave tasks."}
{"id": "2601.16414", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16414", "abs": "https://arxiv.org/abs/2601.16414", "authors": ["John Wu", "Yongda Fan", "Zhenbang Wu", "Paul Landes", "Eric Schrock", "Sayeed Sajjad Razin", "Arjun Chatterjee", "Naveen Baskaran", "Joshua Steier", "Andrea Fitzpatrick", "Bilal Arif", "Rian Atri", "Jathurshan Pradeepkumar", "Siddhartha Laghuvarapu", "Junyi Gao", "Adam R. Cross", "Jimeng Sun"], "title": "PyHealth 2.0: A Comprehensive Open-Source Toolkit for Accessible and Reproducible Clinical Deep Learning", "comment": "Under Review", "summary": "Difficulty replicating baselines, high computational costs, and required domain expertise create persistent barriers to clinical AI research. To address these challenges, we introduce PyHealth 2.0, an enhanced clinical deep learning toolkit that enables predictive modeling in as few as 7 lines of code. PyHealth 2.0 offers three key contributions: (1) a comprehensive toolkit addressing reproducibility and compatibility challenges by unifying 15+ datasets, 20+ clinical tasks, 25+ models, 5+ interpretability methods, and uncertainty quantification including conformal prediction within a single framework that supports diverse clinical data modalities - signals, imaging, and electronic health records - with translation of 5+ medical coding standards; (2) accessibility-focused design accommodating multimodal data and diverse computational resources with up to 39x faster processing and 20x lower memory usage, enabling work from 16GB laptops to production systems; and (3) an active open-source community of 400+ members lowering domain expertise barriers through extensive documentation, reproducible research contributions, and collaborations with academic health systems and industry partners, including multi-language support via RHealth. PyHealth 2.0 establishes an open-source foundation and community advancing accessible, reproducible healthcare AI. Available at pip install pyhealth."}
{"id": "2601.16577", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16577", "abs": "https://arxiv.org/abs/2601.16577", "authors": ["Gaël Pages", "Priot Benoît", "Guillaume Beaugendre"], "title": "Real-Time Evaluation of an Ultra-Tight GNSS/INS Integration Based on Adaptive PLL Bandwidth", "comment": null, "summary": "In this contribution, we propose a GNSS/INS ultra-tight coupling in which the GNSS receiver architecture is based on a vector tracking loop type architecture. In the proposed approach, the phase lock loop bandwidth is adapted according to the inertial navigation system information. The latter has the advantage to be easily implementable on a System-on-Chip component such as an FPGA (Field-Programmable Gate Arrays), and can be implemented with minor modifications on an existing GNSS receiver platform. Moreover, compared to classical vector-based solutions, the proposed architecture decodes the navigation message in the loop, without the need to run scalar loops in parallel or having to store pre-downloaded ephemeris data. This architecture therefore does not increase the area occupied on the FPGA and does not use additional resources for storage. The proposed GNSS receiver architecture uses GPS L1/C and Galileo E1 signals and is composed of one acquisition module and 16 tracking channels (8 GPS and 8 Galileo) which are implemented within a FPGA (Zynq-Ultrascale)."}
{"id": "2601.16648", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16648", "abs": "https://arxiv.org/abs/2601.16648", "authors": ["Francesco Guidi", "Jingfeng Shan", "Mehrdad Saeidi", "Enrico Testi", "Elia Favarelli", "Andrea Giorgetti", "Davide Dardari", "Alberto Zanella", "Giorgio Li Pira", "Francesca Starita", "Anna Guerra"], "title": "A Cognitive Framework for Autonomous Agents: Toward Human-Inspired Design", "comment": null, "summary": "This work introduces a human-inspired reinforcement learning (RL) architecture that integrates Pavlovian and instrumental processes to enhance decision-making in autonomous systems. While existing engineering solutions rely almost exclusively on instrumental learning, neuroscience shows that humans use Pavlovian associations to leverage predictive cues to bias behavior before outcomes occur. We translate this dual-system mechanism into a cue-guided RL framework in which radio-frequency (RF) stimuli act as conditioned (Pavlovian) cues that modulate action selection. The proposed architecture combines Pavlovian values with instrumental policy optimization, improving navigation efficiency and cooperative behavior in unknown, partially observable environments. Simulation results demonstrate that cue-driven agents adapt faster, achieving superior performance compared to traditional instrumental-solo agents. This work highlights the potential of human learning principles to reshape digital agents intelligence."}
{"id": "2601.16594", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16594", "abs": "https://arxiv.org/abs/2601.16594", "authors": ["Neri Merhav"], "title": "Generalized Forms of the Kraft Inequality for Finite-State Encoders", "comment": "25 pages, 2 figures, to be submitted for publication", "summary": "We derive a few extended versions of the Kraft inequality for information lossless finite-state encoders. The main basic contribution is in defining a notion of a Kraft matrix and in establishing the fact that a necessary condition for information losslessness of a finite-state encoder is that none of the eigenvalues of this matrix have modulus larger than unity, or equivalently, the generalized Kraft inequality asserts that the spectral radius of the Kraft matrix cannot exceed one. For the important special case where the FS encoder is irreducible, we derive several equivalent forms of this inequality, which are based on well known formulas for spectral radius. It also turns out that in the irreducible case, Kraft sums are bounded by a constant, independent of the block length, and thus cannot grow even in any subexponential rate. Finally, two extensions are outlined - one concerns the case of side information available to both encoder and decoder, and the other is for lossy compression."}
{"id": "2601.16463", "categories": ["cs.CR", "cs.SE"], "pdf": "https://arxiv.org/pdf/2601.16463", "abs": "https://arxiv.org/abs/2601.16463", "authors": ["Wenbo Guo", "Chengwei Liu", "Ming Kang", "Yiran Zhang", "Jiahui Wu", "Zhengzi Xu", "Vinay Sachidananda", "Yang Liu"], "title": "Cutting the Gordian Knot: Detecting Malicious PyPI Packages via a Knowledge-Mining Framework", "comment": null, "summary": "The Python Package Index (PyPI) has become a target for malicious actors, yet existing detection tools generate false positive rates of 15-30%, incorrectly flagging one-third of legitimate packages as malicious. This problem arises because current tools rely on simple syntactic rules rather than semantic understanding, failing to distinguish between identical API calls serving legitimate versus malicious purposes. To address this challenge, we propose PyGuard, a knowledge-driven framework that converts detection failures into useful behavioral knowledge by extracting patterns from existing tools' false positives and negatives. Our method utilizes hierarchical pattern mining to identify behavioral sequences that distinguish malicious from benign code, employs Large Language Models to create semantic abstractions beyond syntactic variations, and combines this knowledge into a detection system that integrates exact pattern matching with contextual reasoning. PyGuard achieves 99.50% accuracy with only 2 false positives versus 1,927-2,117 in existing tools, maintains 98.28% accuracy on obfuscated code, and identified 219 previously unknown malicious packages in real-world deployment. The behavioral patterns show cross-ecosystem applicability with 98.07% accuracy on NPM packages, demonstrating that semantic understanding enables knowledge transfer across programming languages."}
{"id": "2601.16425", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16425", "abs": "https://arxiv.org/abs/2601.16425", "authors": ["Huchen Yang", "Xinghao Dong", "Jin-Long Wu"], "title": "Bayesian Experimental Design for Model Discrepancy Calibration: A Rivalry between Kullback--Leibler Divergence and Wasserstein Distance", "comment": null, "summary": "Designing experiments that systematically gather data from complex physical systems is central to accelerating scientific discovery. While Bayesian experimental design (BED) provides a principled, information-based framework that integrates experimental planning with probabilistic inference, the selection of utility functions in BED is a long-standing and active topic, where different criteria emphasize different notions of information. Although Kullback--Leibler (KL) divergence has been one of the most common choices, recent studies have proposed Wasserstein distance as an alternative. In this work, we first employ a toy example to illustrate an issue of Wasserstein distance - the value of Wasserstein distance of a fixed-shape posterior depends on the relative position of its main mass within the support and can exhibit false rewards unrelated to information gain, especially with a non-informative prior (e.g., uniform distribution). We then further provide a systematic comparison between these two criteria through a classical source inversion problem in the BED literature, revealing that the KL divergence tends to lead to faster convergence in the absence of model discrepancy, while Wasserstein metrics provide more robust sequential BED results if model discrepancy is non-negligible. These findings clarify the trade-offs between KL divergence and Wasserstein metrics for the utility function and provide guidelines for selecting suitable criteria in practical BED applications."}
{"id": "2601.16586", "categories": ["eess.SP", "cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16586", "abs": "https://arxiv.org/abs/2601.16586", "authors": ["Benedikt Fesl", "Fatih Capar"], "title": "Learning Successive Interference Cancellation for Low-Complexity Soft-Output MIMO Detection", "comment": null, "summary": "Low-complexity multiple-input multiple-output (MIMO) detection remains a key challenge in modern wireless systems, particularly for 5G reduced capability (RedCap) and internet-of-things (IoT) devices. In this context, the growing interest in deploying machine learning on edge devices must be balanced against stringent constraints on computational complexity and memory while supporting high-order modulation. Beyond accurate hard detection, reliable soft information is equally critical, as modern receivers rely on soft-input channel decoding, imposing additional requirements on the detector design. In this work, we propose recurSIC, a lightweight learning-based MIMO detection framework that is structurally inspired by successive interference cancellation (SIC) and incorporates learned processing stages. It generates reliable soft information via multi-path hypothesis tracking with a tunable complexity parameter while requiring only a single forward pass and a minimal parameter count. Numerical results in realistic wireless scenarios show that recurSIC achieves strong hard- and soft-detection performance at very low complexity, making it well suited for edge-constrained MIMO receivers."}
{"id": "2601.16682", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16682", "abs": "https://arxiv.org/abs/2601.16682", "authors": ["Hazem Ibrahim", "Julius Beerwerth", "Lorenz Dörschel", "Bassam Alrifaee"], "title": "Computation-Accuracy Trade-Off in Service-Oriented Model-Based Control", "comment": "9 pages, 9 figures", "summary": "Representing a control system as a Service-Oriented Architecture (SOA)-referred to as Service-Oriented Model-Based Control (SOMC)-enables runtime-flexible composition of control loop elements. This paper presents a framework that optimizes the computation-accuracy trade-off by formulating service orchestration as an A$^\\star$search problem, complemented by Contextual Bayesian Optimization (BO) to tune the multi-objective cost weights. A vehicle longitudinal-velocity control case study demonstrates online, performancedriven reconfiguration of the control architecture. We show that our framework not only combines control and software structure but also considers the real-time requirements of the control system during performance optimization."}
{"id": "2601.16599", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16599", "abs": "https://arxiv.org/abs/2601.16599", "authors": ["Huaning Liu", "Zilong Liu"], "title": "An Explicit Upper Bound of Generalized Quadratic Gauss Sums and Its Applications for Asymptotically Optimal Aperiodic Polyphase Sequence Design", "comment": "This work has been submitted to IEEE Transactions on Information Theory on 22 January 2026", "summary": "This work is motivated by the long-standing open problem of designing asymptotically order-optimal aperiodic polyphase sequence sets with respect to the celebrated Welch bound. Attempts were made by Mow over 30 years ago, but a comprehensive understanding to this problem is lacking. Our first key contribution is an explicit upper bound of generalized quadratic Gauss sums which is obtained by recursively applying Paris' asymptotic expansion and then bounding it by leveraging the fast convergence property of the Fibonacci zeta function. Building upon this major finding, our second key contribution includes four systematic constructions of order-optimal sequence sets with low aperiodic correlation and/or ambiguity properties via carefully selected Chu sequences and Alltop sequences. For the first time in the literature, we reveal that the full Alltop sequence set is asymptotically optimal for its low aperiodic correlation sidelobes. Besides, we introduce a novel subset of Alltop sequences possessing both order-optimal aperiodic correlation and ambiguity properties for the entire time-shift window."}
{"id": "2601.16472", "categories": ["cs.CR", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16472", "abs": "https://arxiv.org/abs/2601.16472", "authors": ["Rui Meng", "Song Gao", "Bingxuan Xu", "Xiaodong Xu", "Jianqiao Chen", "Nan Ma", "Pei Xiao", "Ping Zhang", "Rahim Tafazolli"], "title": "Secure Intellicise Wireless Network: Agentic AI for Coverless Semantic Steganography Communication", "comment": "13 pages, 11 figures", "summary": "Semantic Communication (SemCom), leveraging its significant advantages in transmission efficiency and reliability, has emerged as a core technology for constructing future intellicise (intelligent and concise) wireless networks. However, intelligent attacks represented by semantic eavesdropping pose severe challenges to the security of SemCom. To address this challenge, Semantic Steganographic Communication (SemSteCom) achieves ``invisible'' encryption by implicitly embedding private semantic information into cover modality carriers. The state-of-the-art study has further introduced generative diffusion models to directly generate stega images without relying on original cover images, effectively enhancing steganographic capacity. Nevertheless, the recovery process of private images is highly dependent on the guidance of private semantic keys, which may be inferred by intelligent eavesdroppers, thereby introducing new security threats. To address this issue, we propose an Agentic AI-driven SemSteCom (AgentSemSteCom) scheme, which includes semantic extraction, digital token controlled reference image generation, coverless steganography, semantic codec, and optional task-oriented enhancement modules. The proposed AgentSemSteCom scheme obviates the need for both cover images and private semantic keys, thereby boosting steganographic capacity while reinforcing transmission security. The simulation results on open-source datasets verify that, AgentSemSteCom achieves better transmission quality and higher security levels than the baseline scheme."}
{"id": "2601.16426", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16426", "abs": "https://arxiv.org/abs/2601.16426", "authors": ["Shuang Wu", "Meijie Wang", "Lun Yu"], "title": "Safe Multitask Molecular Graph Networks for Vapor Pressure and Odor Threshold Prediction", "comment": null, "summary": "We investigate two important tasks in odor-related property modeling: Vapor Pressure (VP) and Odor Threshold (OP). To evaluate the model's out-of-distribution (OOD) capability, we adopt the Bemis-Murcko scaffold split. In terms of features, we introduce the rich A20/E17 molecular graph features (20-dimensional atom features + 17-dimensional bond features) and systematically compare GINE and PNA backbones. The results show: for VP, PNA with a simple regression head achieves Val MSE $\\approx$ 0.21 (normalized space); for the OP single task under the same scaffold split, using A20/E17 with robust training (Huber/winsor) achieves Val MSE $\\approx$ 0.60-0.61. For multitask training, we propose a **\"safe multitask\"** approach: VP as the primary task and OP as the auxiliary task, using delayed activation + gradient clipping + small weight, which avoids harming the primary task and simultaneously yields the best VP generalization performance. This paper provides complete reproducible experiments, ablation studies, and error-similarity analysis while discussing the impact of data noise and method limitations."}
{"id": "2601.16606", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16606", "abs": "https://arxiv.org/abs/2601.16606", "authors": ["Antonio Bracale", "Pasquale De Falco", "Piotr Kuwałek", "Grzegorz Wiczyński"], "title": "Assessment of Errors of Fundamental Frequency Estimation Methods in the Presence of Voltage Fluctuations and Distortions", "comment": "5 pages, 7 figures, submitted to IEEE conferences", "summary": "The fundamental frequency is one of the parameters that define power quality. Correctly determining this parameter under the conditions that prevail in modern power grids is crucial. Diagnostic purposes often require an efficient estimation of this parameter within short time windows. Therefore, this article presents the results of numerical simulation studies that allow the assessment of errors in various fundamental frequency estimation methods, including the standard IEC 61000-4-30 method, when the analyzed signal has a form similar to that found in modern power grids. For the purposes of this study, a test signal was adopted recreating the states of the power grid, including the simultaneous occurrence of voltage fluctuations and distortions. Conclusions are presented based on conducted research."}
{"id": "2601.16719", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16719", "abs": "https://arxiv.org/abs/2601.16719", "authors": ["Martina Alutto", "Fabrizio Dabbene", "Angela Fontan", "Karl H. Johansson", "Chiara Ravazzi"], "title": "On a Coupled Adoption-Opinion Framework for Competing Innovations", "comment": "7 pages, 3 figures", "summary": "In this paper, we propose a two-layer adoption-opinion model to study the diffusion of two competing technologies within a population whose opinions evolve under social influence and adoption-driven feedback. After adopting one technology, individuals may become dissatisfied and switch to the alternative. We prove the existence and uniqueness of the adoption-diffused equilibrium, showing that both technologies coexist and that neither partial-adoption nor monopoly can arise. Numerical simulations show that while opinions shape the equilibrium adoption levels, the relative market share between the two technologies depends solely on their user-experience. As a consequence, interventions that symmetrically boost opinions or adoption can disproportionately favor the higher-quality technology, illustrating how symmetric control actions may generate asymmetric outcomes."}
{"id": "2601.16614", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16614", "abs": "https://arxiv.org/abs/2601.16614", "authors": ["Søren Riis"], "title": "Term Coding: An Entropic Framework for Extremal Combinatorics and the Guessing--Number Sandwich Theorem", "comment": null, "summary": "Term Coding asks: given a finite system of term identities $Γ$ in $v$ variables, how large can its solution set be on an $n$--element alphabet, when we are free to choose the interpretations of the function symbols? This turns familiar existence problems for quasigroups, designs, and related objects into quantitative extremal questions.\n  We prove a guessing-number sandwich theorem that connects term coding to graph guessing numbers (graph entropy). After explicit normalisation and diversification reductions, every instance yields a canonical directed dependency structure with guessing number $α$ such that the maximum code size satisfies $\\log_n \\Sn(Γ)=α+o(1)$ (equivalently, $\\Sn(Γ)=n^{α+o(1)}$), and $α$ can be bounded or computed using entropy and polymatroid methods.\n  We illustrate the framework with examples from extremal combinatorics (Steiner-type identities, self-orthogonal Latin squares) and from information-flow / network-coding style constraints (including a five-cycle instance with fractional exponent and small storage/relay maps)."}
{"id": "2601.16473", "categories": ["cs.CR", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.16473", "abs": "https://arxiv.org/abs/2601.16473", "authors": ["Wei Song", "Zhenchang Xing", "Liming Zhu", "Yulei Sui", "Jingling Xue"], "title": "DeMark: A Query-Free Black-Box Attack on Deepfake Watermarking Defenses", "comment": null, "summary": "The rapid proliferation of realistic deepfakes has raised urgent concerns over their misuse, motivating the use of defensive watermarks in synthetic images for reliable detection and provenance tracking. However, this defense paradigm assumes such watermarks are inherently resistant to removal. We challenge this assumption with DeMark, a query-free black-box attack framework that targets defensive image watermarking schemes for deepfakes. DeMark exploits latent-space vulnerabilities in encoder-decoder watermarking models through a compressive sensing based sparsification process, suppressing watermark signals while preserving perceptual and structural realism appropriate for deepfakes. Across eight state-of-the-art watermarking schemes, DeMark reduces watermark detection accuracy from 100% to 32.9% on average while maintaining natural visual quality, outperforming existing attacks. We further evaluate three defense strategies, including image super resolution, sparse watermarking, and adversarial training, and find them largely ineffective. These results demonstrate that current encoder decoder watermarking schemes remain vulnerable to latent-space manipulations, underscoring the need for more robust watermarking methods to safeguard against deepfakes."}
{"id": "2601.16443", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.16443", "abs": "https://arxiv.org/abs/2601.16443", "authors": ["Kanishk Gandhi", "Shivam Garg", "Noah D. Goodman", "Dimitris Papailiopoulos"], "title": "Endless Terminals: Scaling RL Environments for Terminal Agents", "comment": null, "summary": "Environments are the bottleneck for self-improving agents. Current terminal benchmarks were built for evaluation, not training; reinforcement learning requires a scalable pipeline, not just a dataset. We introduce Endless Terminals, a fully autonomous pipeline that procedurally generates terminal-use tasks without human annotation. The pipeline has four stages: generating diverse task descriptions, building and validating containerized environments, producing completion tests, and filtering for solvability. From this pipeline we obtain 3255 tasks spanning file operations, log management, data processing, scripting, and database operations. We train agents using vanilla PPO with binary episode level rewards and a minimal interaction loop: no retrieval, multi-agent coordination, or specialized tools. Despite this simplicity, models trained on Endless Terminals show substantial gains: on our held-out dev set, Llama-3.2-3B improves from 4.0% to 18.2%, Qwen2.5-7B from 10.7% to 53.3%, and Qwen3-8B-openthinker-sft from 42.6% to 59.0%. These improvements transfer to human-curated benchmarks: models trained on Endless Terminals show substantial gains on held out human curated benchmarks: on TerminalBench 2.0, Llama-3.2-3B improves from 0.0% to 2.2%, Qwen2.5-7B from 2.2% to 3.4%, and Qwen3-8B-openthinker-sft from 1.1% to 6.7%, in each case outperforming alternative approaches including models with more complex agentic scaffolds. These results demonstrate that simple RL succeeds when environments scale."}
{"id": "2601.16662", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16662", "abs": "https://arxiv.org/abs/2601.16662", "authors": ["Sahar Golipoor", "Lingyun Yao", "Martin Andraud", "Stephan Sigg"], "title": "Low-Power On-Device Gesture Recognition with Einsum Networks", "comment": null, "summary": "We design a gesture-recognition pipeline for networks of distributed, resource constrained devices utilising Einsum Networks. Einsum Networks are probabilistic circuits that feature a tractable inference, explainability, and energy efficiency. The system is validated in a scenario of low-power, body-worn, passive Radio Frequency Identification-based gesture recognition. Each constrained device includes task-specific processing units responsible for Received Signal Strength (RSS) and phase processing or Angle of Arrival (AoA) estimation, along with feature extraction, as well as dedicated Einsum hardware that processes the extracted features. The output of all constrained devices is then fused in a decision aggregation module to predict gestures. Experimental results demonstrate that the method outperforms the benchmark models."}
{"id": "2601.16722", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16722", "abs": "https://arxiv.org/abs/2601.16722", "authors": ["Martina Alutto", "Qiulin Xu", "Fabrizio Dabbene", "Hideaki Ishii", "Chiara Ravazzi"], "title": "Model Predictive Control for Coupled Adoption-Opinion Dynamics", "comment": "6 pages, 4 figures", "summary": "This paper investigates an optimal control problem for an adoption-opinion model that couples opinion dynamics with a compartmental adoption framework on a multilayer network to study the diffusion of sustainable behaviors. Adoption evolves through social contagion and perceived benefits, while opinions are shaped by social interactions and feedback from adoption levels. Individuals may also stop adopting virtuous behavior due to external constraints or shifting perceptions, affecting overall diffusion. After the stability analysis of equilibria, both in the presence and absence of adopters, we introduce a Model Predictive Control (MPC) framework that optimizes interventions by shaping opinions rather than directly enforcing adoption. This nudge-based control strategy allows policymakers to influence diffusion indirectly, making interventions more effective and scalable. Numerical simulations demonstrate that, in the absence of control, adoption stagnates, whereas MPC-driven interventions sustain and enhance adoption across communities."}
{"id": "2601.16624", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16624", "abs": "https://arxiv.org/abs/2601.16624", "authors": ["Aimin Li", "Yiğit İnce", "Elif Uysal"], "title": "Taming the Heavy Tail: Age-Optimal Preemption", "comment": "11 pages", "summary": "This paper studies a continuous-time joint sampling-and-preemption problem, incorporating sampling and preemption penalties under general service-time distributions. We formulate the system as an impulse-controlled piecewise-deterministic Markov process (PDMP) and derive coupled integral average-cost optimality equations via the dynamic programming principle, thereby avoiding the smoothness assumptions typically required for an average-cost Hamilton-Jacobi-Bellman quasi-variational inequality (HJB-QVI) characterization. A key invariance in the busy phase collapses the dynamics onto a one-dimensional busy-start boundary, reducing preemption control to an optimal stopping problem. Building on this structure, we develop an efficient policy iteration algorithm with heavy-tail acceleration, employing a hybrid (uniform/log-spaced) action grid and a far-field linear closure. Simulations under Pareto and log-normal service times demonstrate substantial improvements over AoI-optimal non-preemptive sampling and zero-wait baselines, achieving up to a 30x reduction in average cost in heavy-tailed regimes. Finally, simulations uncover a counterintuitive insight: under preemption, delay variance, despite typically being a liability, can become a strategic advantage for information freshness."}
{"id": "2601.16500", "categories": ["cs.CR", "cs.AR"], "pdf": "https://arxiv.org/pdf/2601.16500", "abs": "https://arxiv.org/abs/2601.16500", "authors": ["Kai Li", "Jiahao Lu", "Fu Yao", "Guang Zeng", "Dongsheng Liu", "Shengfei Gu", "Zhengpeng Zhao", "Jiachen Wang"], "title": "A High Performance and Efficient Post-Quantum Crypto-Processor for FrodoKEM", "comment": "13 pages, 11 figures", "summary": "FrodoKEM is a lattice-based post-quantum key encapsulation mechanism (KEM). It has been considered for standardization by the International Organization for Standardization (ISO) due to its robust security profile. However, its hardware implementation exhibits a weakness of high latency and heavy resource burden, hindering its practical application. Moreover, diverse usage scenarios call for comprehensive functionality. To address these challenges, this paper presents a high-performance and efficient crypto-processor for FrodoKEM. A multiple-instruction overlapped execution scheme is introduced to enable efficient multi-module scheduling and minimize operational latency. Furthermore, a high-speed, reconfigurable parallel multiplier array is integrated to handle intensive matrix computations under diverse computation patterns, significantly enhancing hardware efficiency. In addition, a compact memory scheduling strategy shortens the lifespan of intermediate matrices, thereby reducing overall storage requirements. The proposed design provides full support for all FrodoKEM security levels and protocol phases. It consumes 13467 LUTs, 6042 FFs, and 14 BRAMs on an Artix-7 FPGA and achieves the fastest reported execution time. Compared with state-of-the-art hardware implementations, our design improves the area-time product (ATP) by 1.75-2.00 times."}
{"id": "2601.16446", "categories": ["cs.LG", "q-fin.CP"], "pdf": "https://arxiv.org/pdf/2601.16446", "abs": "https://arxiv.org/abs/2601.16446", "authors": ["George Awiakye-Marfo", "Elijah Agbosu", "Victoria Mawuena Barns", "Samuel Asante Gyamerah"], "title": "Brownian ReLU(Br-ReLU): A New Activation Function for a Long-Short Term Memory (LSTM) Network", "comment": "13 pages, 7 figures, 6 tables", "summary": "Deep learning models are effective for sequential data modeling, yet commonly used activation functions such as ReLU, LeakyReLU, and PReLU often exhibit gradient instability when applied to noisy, non-stationary financial time series. This study introduces BrownianReLU, a stochastic activation function induced by Brownian motion that enhances gradient propagation and learning stability in Long Short-Term Memory (LSTM) networks. Using Monte Carlo simulation, BrownianReLU provides a smooth, adaptive response for negative inputs, mitigating the dying ReLU problem. The proposed activation is evaluated on financial time series from Apple, GCB, and the S&P 500, as well as LendingClub loan data for classification. Results show consistently lower Mean Squared Error and higher $R^2$ values, indicating improved predictive accuracy and generalization. Although ROC-AUC metric is limited in classification tasks, activation choice significantly affects the trade-off between accuracy and sensitivity, with Brownian ReLU and the selected activation functions yielding practically meaningful performance."}
{"id": "2601.16664", "categories": ["eess.SP", "eess.IV"], "pdf": "https://arxiv.org/pdf/2601.16664", "abs": "https://arxiv.org/abs/2601.16664", "authors": ["Michael Negosanti", "Lorenzo Pucci", "Andrea Giorgetti"], "title": "OFDM-Based ISAC Imaging of Extended Targets via Inverse Virtual Aperture Processing", "comment": "6 pages; This paper was presented at the IEEE JC&S Symposium 2026", "summary": "This work investigates the performance of an integrated sensing and communication (ISAC) system exploiting inverse virtual aperture (IVA) for imaging moving extended targets in vehicular scenarios. A base station (BS) operates as a monostatic sensor using MIMO-OFDM waveforms. Echoes reflected by the target are processed through motion-compensation techniques to form an IVA range-Doppler (cross-range) image. A case study considers a 5G NR waveform in the upper mid-band, with the target model defined in 3GPP Release 19, representing a vehicle as a set of spatially distributed scatterers. Performance is evaluated in terms of image contrast (IC) and the root mean squared error (RMSE) of the estimated target-centroid range. Finally, the trade-off between sensing accuracy and communication efficiency is examined by varying the subcarrier allocation for IVA imaging. The results provide insights for designing effective sensing strategies in next-generation radio networks."}
{"id": "2601.16764", "categories": ["eess.SY", "cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.16764", "abs": "https://arxiv.org/abs/2601.16764", "authors": ["Xingchen Li", "Keyou You"], "title": "ReLU Networks for Model Predictive Control: Network Complexity and Performance Guarantees", "comment": null, "summary": "Recent years have witnessed a resurgence in using ReLU neural networks (NNs) to represent model predictive control (MPC) policies. However, determining the required network complexity to ensure closed-loop performance remains a fundamental open problem. This involves a critical precision-complexity trade-off: undersized networks may fail to capture the MPC policy, while oversized ones may outweigh the benefits of ReLU network approximation. In this work, we propose a projection-based method to enforce hard constraints and establish a state-dependent Lipschitz continuity property for the optimal MPC cost function, which enables sharp convergence analysis of the closed-loop system. For the first time, we derive explicit bounds on ReLU network width and depth for approximating MPC policies with guaranteed closed-loop performance. To further reduce network complexity and enhance closed-loop performance, we propose a non-uniform error framework with a state-aware scaling function to adaptively adjust both the input and output of the ReLU network. Our contributions provide a foundational step toward certifiable ReLU NN-based MPC."}
{"id": "2601.16628", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16628", "abs": "https://arxiv.org/abs/2601.16628", "authors": ["Andrea Di Giusto", "Alberto Ravagnani", "Emina Soljanin"], "title": "The Oval Strikes Back", "comment": null, "summary": "We investigate the applications of ovals in projective planes to distributed storage, with a focus on the Service Rate Region problem. Leveraging the incidence relations between lines and ovals, we describe a class of non-systematic MDS matrices with a large number of small and disjoint recovery sets. For certain parameter choices, the service-rate region of these matrices contains the region of a systematic generator matrix for the same code, yielding better service performance. We further apply our construction to analyze the PIR properties of the considered MDS matrices and present a one-step majority-logic decoding algorithm with strong error-correcting capability. These results highlight how ovals, a classical object in finite geometry, re-emerge as a useful tool in modern coding theory."}
{"id": "2601.16506", "categories": ["cs.CR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16506", "abs": "https://arxiv.org/abs/2601.16506", "authors": ["Xianya Fang", "Xianying Luo", "Yadong Wang", "Xiang Chen", "Yu Tian", "Zequn Sun", "Rui Liu", "Jun Fang", "Naiqiang Tan", "Yuanning Cui", "Sheng-Jun Huang"], "title": "SafeThinker: Reasoning about Risk to Deepen Safety Beyond Shallow Alignment", "comment": null, "summary": "Despite the intrinsic risk-awareness of Large Language Models (LLMs), current defenses often result in shallow safety alignment, rendering models vulnerable to disguised attacks (e.g., prefilling) while degrading utility. To bridge this gap, we propose SafeThinker, an adaptive framework that dynamically allocates defensive resources via a lightweight gateway classifier. Based on the gateway's risk assessment, inputs are routed through three distinct mechanisms: (i) a Standardized Refusal Mechanism for explicit threats to maximize efficiency; (ii) a Safety-Aware Twin Expert (SATE) module to intercept deceptive attacks masquerading as benign queries; and (iii) a Distribution-Guided Think (DDGT) component that adaptively intervenes during uncertain generation. Experiments show that SafeThinker significantly lowers attack success rates across diverse jailbreak strategies without compromising utility, demonstrating that coordinating intrinsic judgment throughout the generation process effectively balances robustness and practicality."}
{"id": "2601.16450", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16450", "abs": "https://arxiv.org/abs/2601.16450", "authors": ["Sejun Park", "Yeachan Park", "Geonho Hwang"], "title": "On the Expressive Power of Floating-Point Transformers", "comment": null, "summary": "The study on the expressive power of transformers shows that transformers are permutation equivariant, and they can approximate all permutation-equivariant continuous functions on a compact domain. However, these results are derived under real parameters and exact operations, while real implementations on computers can only use a finite set of numbers and inexact machine operations with round-off errors. In this work, we investigate the representability of floating-point transformers that use floating-point parameters and floating-point operations. Unlike existing results under exact operations, we first show that floating-point transformers can represent a class of non-permutation-equivariant functions even without positional encoding. Furthermore, we prove that floating-point transformers can represent all permutation-equivariant functions when the sequence length is bounded, but they cannot when the sequence length is large. We also found the minimal equivariance structure in floating-point transformers, and show that all non-trivial additive positional encoding can harm the representability of floating-point transformers."}
{"id": "2601.16727", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16727", "abs": "https://arxiv.org/abs/2601.16727", "authors": ["Julian Block", "Andreas Könsgen", "Jens Dede", "Anna Förster"], "title": "Precise Low-Current Measurement Techniques for IoT Devices: A Case Study on MoleNet", "comment": null, "summary": "Power consumption is a crucial aspect of IoT devices which often have to run on a battery for an extended period of time. Therefore, supply current measurements are crucial before deploying a device in the field. Multimeters and oscilloscopes are not well suited when it comes to measuring very small currents which occur e.g. when an IoT device is in sleep mode. In this report, we compare dedicated source measurement units (SMUs) which allow to measure very small currents with high precision. As an application example, we demonstrate current measurements on our MoleNet IoT sensor board."}
{"id": "2601.16827", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16827", "abs": "https://arxiv.org/abs/2601.16827", "authors": ["N. Hagelaars", "G. J. E. van Otterdijk", "S. Moradi", "R. Tóth", "N. O. Jaensson", "M. Schoukens"], "title": "Identification of Port-Hamiltonian Differential-Algebraic Equations from Input-Output Data", "comment": "Preprint submitted to IFAC World Congress 2026", "summary": "Many models of physical systems, such as mechanical and electrical networks, exhibit algebraic constraints that arise from subsystem interconnections and underlying physical laws. Such systems are commonly formulated as differential-algebraic equations (DAEs), which describe both the dynamic evolution of system states and the algebraic relations that must hold among them. Within this class, port-Hamiltonian differential-algebraic equations (pH-DAEs) offer a structured, energy-based representation that preserves interconnection and passivity properties. This work introduces a data-driven identification method that combines port-Hamiltonian neural networks (pHNNs) with a differential-algebraic solver to model such constrained systems directly from noisy input-output data. The approach preserves the passivity and interconnection structure of port-Hamiltonian systems while employing a backward Euler discretization with Newton's method to solve the coupled differential and algebraic equations consistently. The performance of the proposed approach is demonstrated on a DC power network, where the identified model accurately captures system behaviour and maintains errors proportional to the noise amplitude, while providing reliable parameter estimates."}
{"id": "2601.16680", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16680", "abs": "https://arxiv.org/abs/2601.16680", "authors": ["Zhenduo Wen", "Amin Gohari"], "title": "Stable Source Coding", "comment": null, "summary": "A source encoder is stable if a small change in the source sequence (e.g., changing a few symbols) results in a small (or bounded) change in the output codeword. By this definition, the common technique of random binning is unstable; because the mapping is random, two nearly identical source sequences can be assigned to completely unrelated bin indices. We study compression rates of stable lossless source codes. Using combinatorial arguments, we derive information-theoretic limits on the achievable rate as a function of the stability parameters."}
{"id": "2601.16560", "categories": ["cs.CR"], "pdf": "https://arxiv.org/pdf/2601.16560", "abs": "https://arxiv.org/abs/2601.16560", "authors": ["Ruisheng Shi", "Yuxuan Liang", "Zijun Guo", "Qin Wang", "Lina Lan", "Chenfeng Wang", "Zhuoyi Zheng"], "title": "Eclipse Attacks on Ethereum's Peer-to-Peer Network", "comment": "Accepted by WWW'26", "summary": "Eclipse attacks isolate blockchain nodes by monopolizing their peer-to-peer connections. The attacks were extensively studied in Bitcoin (SP'15, SP'20, CCS'21, SP'23) and Monero (NDSS'25), but their practicality against Ethereum nodes remains underexplored, particularly in the post-Merge settings.\n  We present the first end-to-end implementation of an eclipse attack targeting Ethereum (2.0 version) execution-layer nodes. Our attack exploits the bootstrapping and peer management logic of Ethereum to fully isolate a node upon restart. We introduce a multi-stage strategy that majorly includes (i) poisoning the node's discovery table via unsolicited messages, (ii) infiltrating Ethereum's DNS-based peerlist by identifying and manipulating the official DNS crawler, and (iii) hijacking idle incoming connection slots across the network to block benign connections. Our DNS list poisoning is the first in the cryptocurrency context and requires only 28 IP addresses over 100 days. Slots hijacking raises outgoing redirection success from 45\\% to 95\\%. We validate our approach through controlled experiments on Ethereum's Sepolia testnet and broad measurements on the mainnet. Our findings demonstrate that over 80\\% of public nodes do not leave sufficient idle capacity for effective slots occupation, highlighting the feasibility and severity of the threat. We further propose concrete countermeasures and responsibly disclosed all findings to Ethereum's security team."}
{"id": "2601.16464", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16464", "abs": "https://arxiv.org/abs/2601.16464", "authors": ["Yipei Wang", "Zhaoying Pan", "Xiaoqian Wang"], "title": "On the Effects of Adversarial Perturbations on Distribution Robustness", "comment": null, "summary": "Adversarial robustness refers to a model's ability to resist perturbation of inputs, while distribution robustness evaluates the performance of the model under data shifts. Although both aim to ensure reliable performance, prior work has revealed a tradeoff in distribution and adversarial robustness. Specifically, adversarial training might increase reliance on spurious features, which can harm distribution robustness, especially the performance on some underrepresented subgroups. We present a theoretical analysis of adversarial and distribution robustness that provides a tractable surrogate for per-step adversarial training by studying models trained on perturbed data. In addition to the tradeoff, our work further identified a nuanced phenomenon that $\\ell_\\infty$ perturbations on data with moderate bias can yield an increase in distribution robustness. Moreover, the gain in distribution robustness remains on highly skewed data when simplicity bias induces reliance on the core feature, characterized as greater feature separability. Our theoretical analysis extends the understanding of the tradeoff by highlighting the interplay of the tradeoff and the feature separability. Despite the tradeoff that persists in many cases, overlooking the role of feature separability may lead to misleading conclusions about robustness."}
{"id": "2601.16792", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16792", "abs": "https://arxiv.org/abs/2601.16792", "authors": ["Yingtong Zhou", "Yiang Zhou", "Zhengxian Qu", "Kang Liu", "Ting Tan"], "title": "A Dynamic Parametric Simulator for Fetal Heart Sounds", "comment": null, "summary": "Research on fetal phonocardiogram (fPCG) is challenged by the limited number of abdominal recordings, substantial maternal interference, and marked transmissioninduced signal attenuation that complicate reproducible benchmarking. We present a reproducible dynamic parametric simulator that generates long abdominal fPCG sequences by combining cycle-level fetal S1/S2 event synthesis with a convolutional transmission module and configurable interference and background noise. Model parameters are calibrated cyclewise from real abdominal recordings to capture beat-to-beat variability and to define data-driven admissible ranges for controllable synthesis. The generated signals are validated against real recordings in terms of envelope-based temporal structure and frequency-domain characteristics. The simulator is released as open software to support rapid, reproducible evaluation of fPCG processing methods under controlled acquisition conditions."}
{"id": "2601.16876", "categories": ["eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16876", "abs": "https://arxiv.org/abs/2601.16876", "authors": ["Moisés J. B. B. Davi", "Felipe V. Lopes", "Vinícius A. Lacerda", "Mário Oleskovicz", "Oriol Gomis-Bellmunt"], "title": "Performance of Differential Protection Applied to Collector Cables of Offshore Wind Farms with MMC-HVDC Transmission", "comment": "Submitted to DPSP Global 2026", "summary": "The ongoing global transition towards low-carbon energy has propelled the integration of offshore wind farms, which, when combined with Modular Multilevel Converter-based High-Voltage Direct Current (MMC-HVDC) transmission, present unique challenges for power system protection. In collector cables connecting wind turbines to offshore MMC, both ends are supplied by Inverter-Based Resources (IBRs), which modify the magnitude and characteristics of fault currents. In this context, this paper investigates the limitations of conventional differential protection schemes under such conditions and compares them with enhanced strategies that account for sequence components. Using electromagnetic transient simulations of a representative offshore wind farm modeled in PSCAD/EMTDC software, internal and external fault scenarios are assessed, varying fault types and resistances. The comparative evaluation provides insights into the sensitivity and selectivity of differential protection and guides a deeper conceptual understanding of the evolving protection challenges inherent to future converter-dominated grids."}
{"id": "2601.16799", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16799", "abs": "https://arxiv.org/abs/2601.16799", "authors": ["Chunsong Sun", "Lin Zhou"], "title": "Adaptive Beam Alignment using Noisy Twenty Questions Estimation with Trained Questioner", "comment": null, "summary": "The 6G communication systems use mmWave and MIMO technologies to achieve wide bandwidth and high throughout, leading to indispensable need for beam alignment to overcome severe signal attenuation. Traditional sector-search-based beam alignment algorithms rely on sequential sampling to identify the best sector, resulting in a significant latency burden on 6G communication systems. Recently proposed adaptive beam alignment algorithms based on the active learning framework address the problem, aiming to identify the optimal sector with the fewest possible samples under an identical sector partition. Nevertheless, these algorithms either lack feasibility (Chiu, Ronquillo and Javidi, JSAC 2019) due to ideal assumptions or lack interpretability (Sohrabi, Chen and Yu, JSAC 2021) due to the use of end-to-end black-box neural networks. To avoid ideal assumptions and maintain interpretability, we address all above problems by proposing an adaptive beam alignment algorithm using the framework of noisy twenty questions estimation with a trained questioner. Specifically, we use two methods for training the questioner to eliminate reliance on ideal assumptions. The first method maps queries of twenty questions estimation to beamforming vectors via weighted summation of steering vectors, as an initial attempt to address the feasibility problem encountered in prior pioneering study by Chiu, Ronquillo and Javidi (JSAC 2019). The second method uses multi-layer fully connected neural networks to achieve improved performance while only employing them to train the questioner, which can effectively mitigate the interpretability issues in prior study by Sohrabi, Chen and Yu (JSAC 2021). Furthermore, we provide numerical simulations to illustrate the effectiveness of our proposed adaptive beam alignment algorithms and demonstrate that our algorithms outperform all benchmark algorithms."}
{"id": "2601.16589", "categories": ["cs.CR", "cs.AI", "cs.ET"], "pdf": "https://arxiv.org/pdf/2601.16589", "abs": "https://arxiv.org/abs/2601.16589", "authors": ["Pablo Sorrentino", "Stjepan Picek", "Ihsen Alouani", "Nikolaos Athanasios Anagnostopoulos", "Francesco Regazzoni", "Lejla Batina", "Tamalika Banerjee", "Fatih Turkmen"], "title": "Emerging Threats and Countermeasures in Neuromorphic Systems: A Survey", "comment": "Survey paper on security and privacy in neuromorphic and in-memory computing systems (35 pages, 11 figures, 6 tables)", "summary": "Neuromorphic computing mimics brain-inspired mechanisms through spiking neurons and energy-efficient processing, offering a pathway to efficient in-memory computing (IMC). However, these advancements raise critical security and privacy concerns. As the adoption of bio-inspired architectures and memristive devices increases, so does the urgency to assess the vulnerability of these emerging technologies to hardware and software attacks. Emerging architectures introduce new attack surfaces, particularly due to asynchronous, event-driven processing and stochastic device behavior. The integration of memristors into neuromorphic hardware and software implementations in spiking neural networks offers diverse possibilities for advanced computing architectures, including their role in security-aware applications. This survey systematically analyzes the security landscape of neuromorphic systems, covering attack methodologies, side-channel vulnerabilities, and countermeasures. We focus on both hardware and software concerns relevant to spiking neural networks (SNNs) and hardware primitives, such as Physical Unclonable Functions (PUFs) and True Random Number Generators (TRNGs) for cryptographic and secure computation applications. We approach this analysis from diverse perspectives, from attack methodologies to countermeasure strategies that integrate efficiency and protection in brain-inspired hardware. This review not only maps the current landscape of security threats but provides a foundation for developing secure and trustworthy neuromorphic architectures."}
{"id": "2601.16467", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16467", "abs": "https://arxiv.org/abs/2601.16467", "authors": ["Maxwell Reynolds", "Chaitanya Srinivasan", "Vijay Cherupally", "Michael Leone", "Ke Yu", "Li Sun", "Tigmanshu Chaudhary", "Andreas Pfenning", "Kayhan Batmanghelich"], "title": "A Cautionary Tale of Self-Supervised Learning for Imaging Biomarkers: Alzheimer's Disease Case Study", "comment": null, "summary": "Discovery of sensitive and biologically grounded biomarkers is essential for early detection and monitoring of Alzheimer's disease (AD). Structural MRI is widely available but typically relies on hand-crafted features such as cortical thickness or volume. We ask whether self-supervised learning (SSL) can uncover more powerful biomarkers from the same data. Existing SSL methods underperform FreeSurfer-derived features in disease classification, conversion prediction, and amyloid status prediction. We introduce Residual Noise Contrastive Estimation (R-NCE), a new SSL framework that integrates auxiliary FreeSurfer features while maximizing additional augmentation-invariant information. R-NCE outperforms traditional features and existing SSL methods across multiple benchmarks, including AD conversion prediction. To assess biological relevance, we derive Brain Age Gap (BAG) measures and perform genome-wide association studies. R-NCE-BAG shows high heritability and associations with MAPT and IRAG1, with enrichment in astrocytes and oligodendrocytes, indicating sensitivity to neurodegenerative and cerebrovascular processes."}
{"id": "2601.16847", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16847", "abs": "https://arxiv.org/abs/2601.16847", "authors": ["Pantea Nadimi Goki", "Luca Potì"], "title": "Hierarchical Distribution Matcher Design for Probabilistic Constellation Shaping Based on a Novel Semi-Analytical Optimization Approach", "comment": "The manuscript has been submitted for publication in the Journal of Lightwave Technologies (JLT)", "summary": "A novel design procedure for practical hierarchical distribution matchers (HiDMs) in probabilistically shaped constellation systems is presented. The proposed approach enables the determination of optimal parameters for any target distribution matcher rate. Specifically, lower bounds on energy loss, rate loss, and memory requirements are analytically estimated for HiDM architectures approximating the Maxwell Boltzmann (MB) distribution. A semi analytical optimization framework is employed to jointly optimize rate and energy loss, allowing the selection of the number of hierarchical layers, memory size, and block length required to optimize channel capacity. The accuracy of the proposed model is validated through probabilistic amplitude shaping of 16QAM (PAS 16QAM), showing good agreement between analytical predictions and simulated results. The proposed analytical tool facilitates the design of HiDM structures that are compatible with practical hardware and implementation constraints, such as those imposed by state-of-the-art application-specific integrated circuits (ASICs) and field-programmable gate arrays (FPGAs). Furthermore, the performance of the optimized HiDM structure, incorporating layer selection based on lower-bound energy loss, is evaluated over the AWGN channel in terms of normalized generalized mutual information (NGMI) as a function of the optical signal-to-noise ratio (OSNR). At a net data rate of 200 Gbps with 25% forward error correction (FEC) overhead, the proposed scheme achieves a shaping gain improvement of 2.8% compared to previously reported solutions."}
{"id": "2601.16323", "categories": ["cs.NI", "eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16323", "abs": "https://arxiv.org/abs/2601.16323", "authors": ["Belal Korany", "Peerapol Tinnakornsrisuphap", "Saadallah Kassir", "Prashanth Hande", "Hyun Yong Lee", "Thomas Stockhammer", "Hemanth Sampath"], "title": "Multi-User Content Diversity in Wireless Networks", "comment": "arXiv admin note: text overlap with arXiv:2505.04114", "summary": "Immersive applications such as eXtended Reality (XR), cloud gaming, and real-time video streaming are central to the vision of 6G networks. These applications require not only low latency and high data rates, but also consistent and high-quality User Experience (UX). Traditional rate allocation and congestion control mechanisms in wireless networks treat users uniformly based on channel conditions, rely only on network-centric Key Performance Indicators (KPIs), and ignore the content diversity, which can lead to inefficient resource utilization and degraded UX. In this paper, we introduce the concept of Multi-User Content Diversity, which recognizes that different users concurrently consume media with varying complexity, and therefore have different bitrate requirements to achieve satisfactory UX. We propose multiple different frameworks that exploit multi-user content diversity and lead to overall network-wide gains in terms of UX. For each framework, we demonstrate the required information exchange between Application Servers (ASs), Application Clients (ACs), and the network, and the algorithms that run in each of these components to optimize a network-wide UXbased objective. Simulation results demonstrate that exploiting multi-user content diversity leads to significant gains in UX capacity, UX fairness, and network utilization, when compared to conventional rate control methods. These findings highlight the potential of content-aware networking as a key enabler for emerging wireless systems."}
{"id": "2601.16825", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16825", "abs": "https://arxiv.org/abs/2601.16825", "authors": ["Chunsong Sun", "Lin Zhou"], "title": "Privacy-Resolution Tradeoff for Adaptive Noisy Twenty Questions Estimation", "comment": null, "summary": "We revisit noisy twenty questions estimation and study the privacy-resolution tradeoff for adaptive query procedures. Specifically, in twenty questions estimation, there are two players: an oracle and a questioner. The questioner aims to estimate target variables by posing queries to the oracle that knows the variables and using noisy responses to form reliable estimates. Typically, there are adaptive and non-adaptive query procedures. In adaptive querying, one designs the current query using previous queries and their noisy responses while in non-adaptive querying, all queries are posed simultaneously. Generally speaking, adaptive query procedures yield better performance. However, adaptive querying leads to privacy concerns, which were first studied by Tsitsiklis, Xu and Xu (COLT 2018) and by Xu, Xu and Yang (AISTATS 2021) for the noiseless case, where the oracle always provides correct answers to queries. In this paper, we generalize the above results to the more practical noisy case, by proposing a two-stage private query procedure, analyzing its non-asymptotic and second-order asymptotic achievable performance and discussing the impact of privacy concerns. Furthermore, when specialized to the noiseless case, our private query procedure achieves better performance than above-mentioned query procedures (COLT 2018, AISTATS 2021)."}
{"id": "2601.16681", "categories": ["cs.CR", "cs.SE"], "pdf": "https://arxiv.org/pdf/2601.16681", "abs": "https://arxiv.org/abs/2601.16681", "authors": ["Xing Su", "Hao Wu", "Hanzhong Liang", "Yunlin Jiang", "Yuxi Cheng", "Yating Liu", "Fengyuan Xu"], "title": "From Transactions to Exploits: Automated PoC Synthesis for Real-World DeFi Attacks", "comment": "14 pages, 10 figures", "summary": "Blockchain systems are increasingly targeted by on-chain attacks that exploit contract vulnerabilities to extract value rapidly and stealthily, making systematic analysis and reproduction highly challenging. In practice, reproducing such attacks requires manually crafting proofs-of-concept (PoCs), a labor-intensive process that demands substantial expertise and scales poorly. In this work, we present the first automated framework for synthesizing verifiable PoCs directly from on-chain attack executions. Our key insight is that attacker logic can be recovered from low-level transaction traces via trace-driven reverse engineering, and then translated into executable exploits by leveraging the code-generation capabilities of large language models (LLMs). To this end, we propose TracExp, which localizes attack-relevant execution contexts from noisy, multi-contract traces and introduces a novel dual-decompiler to transform concrete executions into semantically enriched exploit pseudocode. Guided by this representation, TracExp synthesizes PoCs and refines them to preserve exploitability-relevant semantics. We evaluate TracExp on 321 real-world attacks over the past 20 months. TracExp successfully synthesizes PoCs for 93% of incidents, with 58.78% being directly verifiable, at an average cost of only \\$0.07 per case. Moreover, TracExp enabled the release of a large number of previously unavailable PoCs to the community, earning a $900 bounty and demonstrating strong practical impact."}
{"id": "2601.16491", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16491", "abs": "https://arxiv.org/abs/2601.16491", "authors": ["Shenghong Cai", "Yiqun Zhang", "Xiaopeng Luo", "Yiu-Ming Cheung", "Hong Jia", "Peng Liu"], "title": "Robust Categorical Data Clustering Guided by Multi-Granular Competitive Learning", "comment": "This paper has been published in the IEEE International Conference on Distributed Computing Systems (ICDCS 2024)", "summary": "Data set composed of categorical features is very common in big data analysis tasks. Since categorical features are usually with a limited number of qualitative possible values, the nested granular cluster effect is prevalent in the implicit discrete distance space of categorical data. That is, data objects frequently overlap in space or subspace to form small compact clusters, and similar small clusters often form larger clusters. However, the distance space cannot be well-defined like the Euclidean distance due to the qualitative categorical data values, which brings great challenges to the cluster analysis of categorical data. In view of this, we design a Multi-Granular Competitive Penalization Learning (MGCPL) algorithm to allow potential clusters to interactively tune themselves and converge in stages with different numbers of naturally compact clusters. To leverage MGCPL, we also propose a Cluster Aggregation strategy based on MGCPL Encoding (CAME) to first encode the data objects according to the learned multi-granular distributions, and then perform final clustering on the embeddings. It turns out that the proposed MGCPL-guided Categorical Data Clustering (MCDC) approach is competent in automatically exploring the nested distribution of multi-granular clusters and highly robust to categorical data sets from various domains. Benefiting from its linear time complexity, MCDC is scalable to large-scale data sets and promising in pre-partitioning data sets or compute nodes for boosting distributed computing. Extensive experiments with statistical evidence demonstrate its superiority compared to state-of-the-art counterparts on various real public data sets."}
{"id": "2601.16915", "categories": ["eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16915", "abs": "https://arxiv.org/abs/2601.16915", "authors": ["Aleksey S. Gvozdarev"], "title": "IRS Compensation of Hyper-Rayleigh Fading: How Many Elements Are Needed?", "comment": null, "summary": "The letter introduces and studies the problem of defining the minimum number of Intelligent Reflecting Surface (IRS) elements needed to compensate for heavy fading conditions in multipath fading channels. The fading severity is quantified in terms of Hyper-Rayleigh Regimes (HRRs) (i.e., full-HRR (worst-case conditions), strong-, weak-, and no-HRR), and the channel model used (Inverse Power Lomax (IPL)) was chosen since it can account for all HRRs. The research presents the derived closed-form channel coefficient envelope statistics for the single IRS-element channel with IPL statistics in both subchannels and total IRS-assisted channel, as well as tight approximations for the channel coefficient and instantaneous signal-to-noise ratio (SNR) statistics for the latter. The derived expressions helped estimate channel parameters corresponding to the specific HRRs of the total channel and demonstrate that while both single links (i.e., ''source-IRS'' and ''IRS-destination'') are in full-HRR, the minimum number of IRS elements needed to bring the total IRS-assisted link (''source-IRS-destination'') out of full-HRR is no less than $6$ (for the whole range on the IPL scale parameter corresponding full-HRR). Furthermore, the minimum number of IRS elements required to bring the total IRS-assisted link into no-HRR is $14$ (under the same conditions)."}
{"id": "2601.16845", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16845", "abs": "https://arxiv.org/abs/2601.16845", "authors": ["Theshani Nuradha", "Ian George", "Christoph Hirche"], "title": "Information Contraction under $(\\varepsilon,δ)$-Differentially Private Mechanisms", "comment": "6 pages, 3 figures; classical results from the paper arXiv:2512.16778 [quant-ph] that studies related quantum results", "summary": "The distinguishability quantified by information measures after being processed by a private mechanism has been a useful tool in studying various statistical and operational tasks while ensuring privacy. To this end, standard data-processing inequalities and strong data-processing inequalities (SDPI) are employed. Most of the previously known and even tight characterizations of contraction of information measures, including total variation distance, hockey-stick divergences, and $f$-divergences, are applicable for $(\\varepsilon,0)$-local differential private (LDP) mechanisms. In this work, we derive both linear and non-linear strong data-processing inequalities for hockey-stick divergence and $f$-divergences that are valid for all $(\\varepsilon,δ)$-LDP mechanisms even when $δ\\neq 0$. Our results either generalize or improve the previously known bounds on the contraction of these distinguishability measures."}
{"id": "2601.16795", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16795", "abs": "https://arxiv.org/abs/2601.16795", "authors": ["Kenan Begovic", "Abdulaziz Al-Ali", "Qutaibah Malluhi"], "title": "Building a Robust Risk-Based Access Control System to Combat Ransomware's Capability to Encrypt: A Machine Learning Approach", "comment": "This work has been submitted to the IEEE for possible publication", "summary": "Ransomware core capability, unauthorized encryption, demands controls that identify and block malicious cryptographic activity without disrupting legitimate use. We present a probabilistic, risk-based access control architecture that couples machine learning inference with mandatory access control to regulate encryption on Linux in real time. The system builds a specialized dataset from the native ftrace framework using the function_graph tracer, yielding high-resolution kernel-function execution traces augmented with resource and I/O counters. These traces support both a supervised classifier and interpretable rules that drive an SELinux policy via lightweight booleans, enabling context-sensitive permit/deny decisions at the moment encryption begins. Compared to approaches centered on sandboxing, hypervisor introspection, or coarse system-call telemetry, the function-level tracing we adopt provides finer behavioral granularity than syscall-only telemetry while avoiding the virtualization/VMI overhead of sandbox-based approaches. Our current user-space prototype has a non-trivial footprint under burst I/O; we quantify it and recognize that a production kernel-space solution should aim to address this. We detail dataset construction, model training and rule extraction, and the run-time integration that gates file writes for suspect encryption while preserving benign cryptographic workflows. During evaluation, the two-layer composition retains model-level detection quality while delivering rule-like responsiveness; we also quantify operational footprint and outline engineering steps to reduce CPU and memory overhead for enterprise deployment. The result is a practical path from behavioral tracing and learning to enforceable, explainable, and risk-proportionate encryption control on production Linux systems."}
{"id": "2601.16496", "categories": ["cs.LG", "cs.CY"], "pdf": "https://arxiv.org/pdf/2601.16496", "abs": "https://arxiv.org/abs/2601.16496", "authors": ["Zekai Chen", "Kairui Yang", "Xunkai Li", "Henan Sun", "Zhihan Zhang", "Jia Li", "Qiangqiang Dai", "Rong-Hua Li", "Guoren Wang"], "title": "BoostFGL: Boosting Fairness in Federated Graph Learning", "comment": null, "summary": "Federated graph learning (FGL) enables collaborative training of graph neural networks (GNNs) across decentralized subgraphs without exposing raw data. While existing FGL methods often achieve high overall accuracy, we show that this average performance can conceal severe degradation on disadvantaged node groups. From a fairness perspective, these disparities arise systematically from three coupled sources: label skew toward majority patterns, topology confounding in message propagation, and aggregation dilution of updates from hard clients. To address this, we propose \\textbf{BoostFGL}, a boosting-style framework for fairness-aware FGL. BoostFGL introduces three coordinated mechanisms: \\ding{182} \\emph{Client-side node boosting}, which reshapes local training signals to emphasize systematically under-served nodes; \\ding{183} \\emph{Client-side topology boosting}, which reallocates propagation emphasis toward reliable yet underused structures and attenuates misleading neighborhoods; and \\ding{184} \\emph{Server-side model boosting}, which performs difficulty- and reliability-aware aggregation to preserve informative updates from hard clients while stabilizing the global model. Extensive experiments on 9 datasets show that BoostFGL delivers substantial fairness gains, improving Overall-F1 by 8.43\\%, while preserving competitive overall performance against strong FGL baselines."}
{"id": "2601.16323", "categories": ["cs.NI", "eess.SP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2601.16323", "abs": "https://arxiv.org/abs/2601.16323", "authors": ["Belal Korany", "Peerapol Tinnakornsrisuphap", "Saadallah Kassir", "Prashanth Hande", "Hyun Yong Lee", "Thomas Stockhammer", "Hemanth Sampath"], "title": "Multi-User Content Diversity in Wireless Networks", "comment": "arXiv admin note: text overlap with arXiv:2505.04114", "summary": "Immersive applications such as eXtended Reality (XR), cloud gaming, and real-time video streaming are central to the vision of 6G networks. These applications require not only low latency and high data rates, but also consistent and high-quality User Experience (UX). Traditional rate allocation and congestion control mechanisms in wireless networks treat users uniformly based on channel conditions, rely only on network-centric Key Performance Indicators (KPIs), and ignore the content diversity, which can lead to inefficient resource utilization and degraded UX. In this paper, we introduce the concept of Multi-User Content Diversity, which recognizes that different users concurrently consume media with varying complexity, and therefore have different bitrate requirements to achieve satisfactory UX. We propose multiple different frameworks that exploit multi-user content diversity and lead to overall network-wide gains in terms of UX. For each framework, we demonstrate the required information exchange between Application Servers (ASs), Application Clients (ACs), and the network, and the algorithms that run in each of these components to optimize a network-wide UXbased objective. Simulation results demonstrate that exploiting multi-user content diversity leads to significant gains in UX capacity, UX fairness, and network utilization, when compared to conventional rate control methods. These findings highlight the potential of content-aware networking as a key enabler for emerging wireless systems."}
{"id": "2601.16857", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16857", "abs": "https://arxiv.org/abs/2601.16857", "authors": ["Fangwei Ye", "Zonghong Liu", "Parimal Parag", "Salim El Rouayheb"], "title": "Perfect Privacy and Strong Stationary Times for Markovian Sources", "comment": "11 pages", "summary": "We consider the problem of sharing correlated data under a perfect information-theoretic privacy constraint. We focus on redaction (erasure) mechanisms, in which data are either withheld or released unchanged, and measure utility by the average cardinality of the released set, equivalently, the expected Hamming distortion. Assuming the data are generated by a finite time-homogeneous Markov chain, we study the protection of the initial state while maximizing the amount of shared data. We establish a connection between perfect privacy and window-based redaction schemes, showing that erasing data up to a strong stationary time preserves privacy under suitable conditions. We further study an optimal sequential redaction mechanism and prove that it admits an equivalent window interpretation. Interestingly, we show that both mechanisms achieve the optimal distortion while redacting only a constant average number of data points, independent of the data length~$N$."}
{"id": "2601.16805", "categories": ["cs.CR", "cs.GT", "cs.SI", "q-fin.RM"], "pdf": "https://arxiv.org/pdf/2601.16805", "abs": "https://arxiv.org/abs/2601.16805", "authors": ["Elisa Botteghi", "Martino S. Centonze", "Davide Pastorello", "Daniele Tantari"], "title": "Network Security under Heterogeneous Cyber-Risk Profiles and Contagion", "comment": "27 pages, 9 figures", "summary": "Cyber risk has become a critical financial threat in today's interconnected digital economy. This paper introduces a cyber-risk management framework for networked digital systems that combines the strategic behavior of players with contagion dynamics within a security game. We address the problem of optimally allocating cybersecurity resources across a network, focusing on the heterogeneous valuations of nodes by attackers and defenders, some areas may be of high interest to the attacker, while others are prioritized by the defender. We explore how this asymmetry drives attack and defense strategies and shapes the system's overall resilience. We extend a method to determine optimal resource allocation based on simple network metrics weighted by the defender's and attacker's risk profiles. We further propose risk measures based on contagion paths and analyze how propagation dynamics influence optimal defense strategies. Numerical experiments explore risk versus cost efficient frontiers varying network topologies and risk profiles, revealing patterns of resource allocation and cyber deception effects. These findings provide actionable insights for designing resilient digital infrastructures and mitigating systemic cyber risk."}
{"id": "2601.16509", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16509", "abs": "https://arxiv.org/abs/2601.16509", "authors": ["Jiaye Li", "Gang Chen", "Hang Xu", "Shichao Zhang"], "title": "kNN-Graph: An adaptive graph model for $k$-nearest neighbors", "comment": "25 pages, 6 figures", "summary": "The k-nearest neighbors (kNN) algorithm is a cornerstone of non-parametric classification in artificial intelligence, yet its deployment in large-scale applications is persistently constrained by the computational trade-off between inference speed and accuracy. Existing approximate nearest neighbor solutions accelerate retrieval but often degrade classification precision and lack adaptability in selecting the optimal neighborhood size (k). Here, we present an adaptive graph model that decouples inference latency from computational complexity. By integrating a Hierarchical Navigable Small World (HNSW) graph with a pre-computed voting mechanism, our framework completely transfers the computational burden of neighbor selection and weighting to the training phase. Within this topological structure, higher graph layers enable rapid navigation, while lower layers encode precise, node-specific decision boundaries with adaptive neighbor counts. Benchmarking against eight state-of-the-art baselines across six diverse datasets, we demonstrate that this architecture significantly accelerates inference speeds, achieving real-time performance, without compromising classification accuracy. These findings offer a scalable, robust solution to the long-standing inference bottleneck of kNN, establishing a new structural paradigm for graph-based nonparametric learning."}
{"id": "2601.16332", "categories": ["cs.LG", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16332", "abs": "https://arxiv.org/abs/2601.16332", "authors": ["Felipe Tobar", "Elsa Cazelles"], "title": "Efficient Gaussian process learning via subspace projections", "comment": "Accepted at IEEE ICASSP 2026", "summary": "We propose a novel training objective for GPs constructed using lower-dimensional linear projections of the data, referred to as \\emph{projected likelihood} (PL). We provide a closed-form expression for the information loss related to the PL and empirically show that it can be reduced with random projections on the unit sphere. We show the superiority of the PL, in terms of accuracy and computational efficiency, over the exact GP training and the variational free energy approach to sparse GPs over different optimisers, kernels and datasets of moderately large sizes."}
{"id": "2601.16586", "categories": ["eess.SP", "cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16586", "abs": "https://arxiv.org/abs/2601.16586", "authors": ["Benedikt Fesl", "Fatih Capar"], "title": "Learning Successive Interference Cancellation for Low-Complexity Soft-Output MIMO Detection", "comment": null, "summary": "Low-complexity multiple-input multiple-output (MIMO) detection remains a key challenge in modern wireless systems, particularly for 5G reduced capability (RedCap) and internet-of-things (IoT) devices. In this context, the growing interest in deploying machine learning on edge devices must be balanced against stringent constraints on computational complexity and memory while supporting high-order modulation. Beyond accurate hard detection, reliable soft information is equally critical, as modern receivers rely on soft-input channel decoding, imposing additional requirements on the detector design. In this work, we propose recurSIC, a lightweight learning-based MIMO detection framework that is structurally inspired by successive interference cancellation (SIC) and incorporates learned processing stages. It generates reliable soft information via multi-path hypothesis tracking with a tunable complexity parameter while requiring only a single forward pass and a minimal parameter count. Numerical results in realistic wireless scenarios show that recurSIC achieves strong hard- and soft-detection performance at very low complexity, making it well suited for edge-constrained MIMO receivers."}
{"id": "2601.16514", "categories": ["cs.LG", "cs.AI", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.16514", "abs": "https://arxiv.org/abs/2601.16514", "authors": ["Enes Arda", "Semih Cayci", "Atilla Eryilmaz"], "title": "Finite-Time Analysis of Gradient Descent for Shallow Transformers", "comment": "Accepted to AISTATS 2026", "summary": "Understanding why Transformers perform so well remains challenging due to their non-convex optimization landscape. In this work, we analyze a shallow Transformer with $m$ independent heads trained by projected gradient descent in the kernel regime. Our analysis reveals two main findings: (i) the width required for nonasymptotic guarantees scales only logarithmically with the sample size $n$, and (ii) the optimization error is independent of the sequence length $T$. This contrasts sharply with recurrent architectures, where the optimization error can grow exponentially with $T$. The trade-off is memory: to keep the full context, the Transformer's memory requirement grows with the sequence length. We validate our theoretical results numerically in a teacher-student setting and confirm the predicted scaling laws for Transformers."}
{"id": "2601.16472", "categories": ["cs.CR", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16472", "abs": "https://arxiv.org/abs/2601.16472", "authors": ["Rui Meng", "Song Gao", "Bingxuan Xu", "Xiaodong Xu", "Jianqiao Chen", "Nan Ma", "Pei Xiao", "Ping Zhang", "Rahim Tafazolli"], "title": "Secure Intellicise Wireless Network: Agentic AI for Coverless Semantic Steganography Communication", "comment": "13 pages, 11 figures", "summary": "Semantic Communication (SemCom), leveraging its significant advantages in transmission efficiency and reliability, has emerged as a core technology for constructing future intellicise (intelligent and concise) wireless networks. However, intelligent attacks represented by semantic eavesdropping pose severe challenges to the security of SemCom. To address this challenge, Semantic Steganographic Communication (SemSteCom) achieves ``invisible'' encryption by implicitly embedding private semantic information into cover modality carriers. The state-of-the-art study has further introduced generative diffusion models to directly generate stega images without relying on original cover images, effectively enhancing steganographic capacity. Nevertheless, the recovery process of private images is highly dependent on the guidance of private semantic keys, which may be inferred by intelligent eavesdroppers, thereby introducing new security threats. To address this issue, we propose an Agentic AI-driven SemSteCom (AgentSemSteCom) scheme, which includes semantic extraction, digital token controlled reference image generation, coverless steganography, semantic codec, and optional task-oriented enhancement modules. The proposed AgentSemSteCom scheme obviates the need for both cover images and private semantic keys, thereby boosting steganographic capacity while reinforcing transmission security. The simulation results on open-source datasets verify that, AgentSemSteCom achieves better transmission quality and higher security levels than the baseline scheme."}
{"id": "2601.16880", "categories": ["cs.LG", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16880", "abs": "https://arxiv.org/abs/2601.16880", "authors": ["Bethan Evans", "Jared Tanner"], "title": "Theory of Minimal Weight Perturbations in Deep Networks and its Applications for Low-Rank Activated Backdoor Attacks", "comment": null, "summary": "The minimal norm weight perturbations of DNNs required to achieve a specified change in output are derived and the factors determining its size are discussed. These single-layer exact formulae are contrasted with more generic multi-layer Lipschitz constant based robustness guarantees; both are observed to be of the same order which indicates similar efficacy in their guarantees. These results are applied to precision-modification-activated backdoor attacks, establishing provable compression thresholds below which such attacks cannot succeed, and show empirically that low-rank compression can reliably activate latent backdoors while preserving full-precision accuracy. These expressions reveal how back-propagated margins govern layer-wise sensitivity and provide certifiable guarantees on the smallest parameter updates consistent with a desired output shift."}
{"id": "2601.16516", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16516", "abs": "https://arxiv.org/abs/2601.16516", "authors": ["Feixiang Zheng", "Yu Wu", "Cecilia Mascolo", "Ting Dang"], "title": "Rethinking Large Language Models For Irregular Time Series Classification In Critical Care", "comment": "5 pages, 3 figures", "summary": "Time series data from the Intensive Care Unit (ICU) provides critical information for patient monitoring. While recent advancements in applying Large Language Models (LLMs) to time series modeling (TSM) have shown great promise, their effectiveness on the irregular ICU data, characterized by particularly high rates of missing values, remains largely unexplored. This work investigates two key components underlying the success of LLMs for TSM: the time series encoder and the multimodal alignment strategy. To this end, we establish a systematic testbed to evaluate their impact across various state-of-the-art LLM-based methods on benchmark ICU datasets against strong supervised and self-supervised baselines. Results reveal that the encoder design is more critical than the alignment strategy. Encoders that explicitly model irregularity achieve substantial performance gains, yielding an average AUPRC increase of $12.8\\%$ over the vanilla Transformer. While less impactful, the alignment strategy is also noteworthy, with the best-performing semantically rich, fusion-based strategy achieving a modest $2.9\\%$ improvement over cross-attention. However, LLM-based methods require at least 10$\\times$ longer training than the best-performing irregular supervised models, while delivering only comparable performance. They also underperform in data-scarce few-shot learning settings. These findings highlight both the promise and current limitations of LLMs for irregular ICU time series. The code is available at https://github.com/mHealthUnimelb/LLMTS."}
{"id": "2601.16495", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2601.16495", "abs": "https://arxiv.org/abs/2601.16495", "authors": ["Shivani Singh", "Amudheesan Nakkeeran", "Prem Singh", "Ekant Sharma", "Jyotsna Bapat"], "title": "Load Balanced ISAC Systems for URLLC Users", "comment": null, "summary": "This paper presents an energy-efficient downlink cell-free massive multiple-input multiple-output (CF-mMIMO) integrated sensing and communication (ISAC) network that serves ultra-reliable low-latency communication (URLLC) users while simultaneously detecting a target. We propose a load-balancing algorithm that minimizes the total network power consumption; including transmit power, fixed static power, and traffic-dependent fronthaul power at the access points (APs) without degrading system performance. To this end, we formulate a mixed-integer non-convex optimization problem and introduce an iterative joint power allocation and AP load balancing (JPALB) algorithm. The algorithm aims to reduce total power usage while meeting both the communication quality-of-service (QoS) requirements of URLLC users and the sensing QoS needed for target detection. Proposed JPALB algorithm for ISAC systems was simulated with maximum-ratio transmission (MRT) and regularized zero-forcing (RZF) precoders. Simulation results show approximately 33% reduction in power consumption, using JPALB algorithm compared to a baseline with no load balancing, without compromising communication and sensing QoS requirements."}
{"id": "2601.16519", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16519", "abs": "https://arxiv.org/abs/2601.16519", "authors": ["Zekai Chen", "Haodong Lu", "Xunkai Li", "Henan Sun", "Jia Li", "Hongchao Qin", "Rong-Hua Li", "Guoren Wang"], "title": "DANCE: Dynamic, Available, Neighbor-gated Condensation for Federated Text-Attributed Graphs", "comment": null, "summary": "Federated graph learning (FGL) enables collaborative training on graph data across multiple clients. With the rise of large language models (LLMs), textual attributes in FGL graphs are gaining attention. Text-attributed graph federated learning (TAG-FGL) improves FGL by explicitly leveraging LLMs to process and integrate these textual features. However, current TAG-FGL methods face three main challenges: \\textbf{(1) Overhead.} LLMs for processing long texts incur high token and computation costs. To make TAG-FGL practical, we introduce graph condensation (GC) to reduce computation load, but this choice also brings new issues. \\textbf{(2) Suboptimal.} To reduce LLM overhead, we introduce GC into TAG-FGL by compressing multi-hop texts/neighborhoods into a condensed core with fixed LLM surrogates. However, this one-shot condensation is often not client-adaptive, leading to suboptimal performance. \\textbf{(3) Interpretability.} LLM-based condensation further introduces a black-box bottleneck: summaries lack faithful attribution and clear grounding to specific source spans, making local inspection and auditing difficult. To address the above issues, we propose \\textbf{DANCE}, a new TAG-FGL paradigm with GC. To improve \\textbf{suboptimal} performance, DANCE performs round-wise, model-in-the-loop condensation refresh using the latest global model. To enhance \\textbf{interpretability}, DANCE preserves provenance by storing locally inspectable evidence packs that trace predictions to selected neighbors and source text spans. Across 8 TAG datasets, DANCE improves accuracy by \\textbf{2.33\\%} at an \\textbf{8\\%} condensation ratio, with \\textbf{33.42\\%} fewer tokens than baselines."}
{"id": "2601.16527", "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.16527", "abs": "https://arxiv.org/abs/2601.16527", "authors": ["Xianya Fang", "Feiyang Ren", "Xiang Chen", "Yu Tian", "Zhen Bi", "Haiyang Yu", "Sheng-Jun Huang"], "title": "Beyond Superficial Unlearning: Sharpness-Aware Robust Erasure of Hallucinations in Multimodal LLMs", "comment": null, "summary": "Multimodal LLMs are powerful but prone to object hallucinations, which describe non-existent entities and harm reliability. While recent unlearning methods attempt to mitigate this, we identify a critical flaw: structural fragility. We empirically demonstrate that standard erasure achieves only superficial suppression, trapping the model in sharp minima where hallucinations catastrophically resurge after lightweight relearning. To ensure geometric stability, we propose SARE, which casts unlearning as a targeted min-max optimization problem and uses a Targeted-SAM mechanism to explicitly flatten the loss landscape around hallucinated concepts. By suppressing hallucinations under simulated worst-case parameter perturbations, our framework ensures robust removal stable against weight shifts. Extensive experiments demonstrate that SARE significantly outperforms baselines in erasure efficacy while preserving general generation quality. Crucially, it maintains persistent hallucination suppression against relearning and parameter updates, validating the effectiveness of geometric stabilization."}
{"id": "2601.16531", "categories": ["cs.LG", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2601.16531", "abs": "https://arxiv.org/abs/2601.16531", "authors": ["Tao Lin"], "title": "A Collision-Free Hot-Tier Extension for Engram-Style Conditional Memory: A Controlled Study of Training Dynamics", "comment": null, "summary": "We investigate whether high-frequency key collisions are a primary bottleneck in Engram-style conditional memory. To isolate the effect of collisions, we introduce Engram-Nine, a collision-free hot-tier extension that maps the most frequent n-grams through a Minimal Perfect Hash Function (MPHF) while retaining the original multi-head hashed lookup as a cold tier. Under a strictly iso-parameter setup, the collision-free design does not consistently improve validation loss.\n  Through route-stratified evaluation (decomposing per-token loss into hot/cold contributions), we uncover a consistent \"hot-to-cold advantage flip\" during training: hot (high-frequency) positions initially have lower loss, but cold positions eventually surpass them. Crucially, collision-free configurations flip earlier than collision-prone baselines, suggesting that collisions act as implicit regularization. We also identify a gating mismatch: the gate learns to favor hot positions early in training, but this preference persists even after the flip, assigning higher weights to positions with higher loss.\n  Our findings suggest that improving lookup precision alone does not guarantee better training outcomes. The dominant limitation may lie in gating credit assignment rather than index accuracy, and collision-induced noise may provide beneficial regularization that should not be naively eliminated."}
{"id": "2601.16552", "categories": ["cs.LG", "cs.CV", "math.GT"], "pdf": "https://arxiv.org/pdf/2601.16552", "abs": "https://arxiv.org/abs/2601.16552", "authors": ["Xiaobin Li", "Run Zhang"], "title": "Understanding and Improving UMAP with Geometric and Topological Priors: The JORC-UMAP Algorithm", "comment": "22 pages, 8 figures. Comments are welcome", "summary": "Nonlinear dimensionality reduction techniques, particularly UMAP, are widely used for visualizing high-dimensional data. However, UMAP's local Euclidean distance assumption often fails to capture intrinsic manifold geometry, leading to topological tearing and structural collapse. We identify UMAP's sensitivity to the k-nearest neighbor graph as a key cause. To address this, we introduce Ollivier-Ricci curvature as a geometric prior, reinforcing edges at geometric bottlenecks and reducing redundant links. Since curvature estimation is noise-sensitive, we also incorporate a topological prior using Jaccard similarity to ensure neighborhood consistency. The resulting method, JORC-UMAP, better distinguishes true manifold structure from spurious connections. Experiments on synthetic and real-world datasets show that JORC-UMAP reduces tearing and collapse more effectively than standard UMAP and other DR methods, as measured by SVM accuracy and triplet preservation scores, while maintaining computational efficiency. This work offers a geometry-aware enhancement to UMAP for more faithful data visualization."}
{"id": "2601.16563", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16563", "abs": "https://arxiv.org/abs/2601.16563", "authors": ["Vasileios Sevetlidis", "George Pavlidis"], "title": "Process-Tensor Tomography of SGD: Measuring Non-Markovian Memory via Back-Flow of Distinguishability", "comment": "to be published in the 29th International Conference on Artificial Intelligence and Statistics, in Proceedings of Machine Learning Research", "summary": "This work proposes neural training as a \\emph{process tensor}: a multi-time map that takes a sequence of controllable instruments (batch choices, augmentations, optimizer micro-steps) and returns an observable of the trained model. Building on this operational lens, we introduce a simple, model-agnostic witness of training memory based on \\emph{back-flow of distinguishability}. In a controlled two-step protocol, we compare outcome distributions after one intervention versus two; the increase $Δ_{\\mathrm{BF}} = D_2 - D_1>0$ (with $D\\in\\{\\mathrm{TV}, \\mathrm{JS}, \\mathrm{H}\\}$ measured on softmax predictions over a fixed probe set) certifies non-Markovianity. We observe consistent positive back-flow with tight bootstrap confidence intervals, amplification under higher momentum, larger batch overlap, and more micro-steps, and collapse under a \\emph{causal break} (resetting optimizer state), directly attributing the effect to optimizer/data-state memory. The witness is robust across TV/JS/Hellinger, inexpensive to compute, and requires no architectural changes. We position this as a \\emph{measurement} contribution: a principled diagnostic and empirical evidence that practical SGD deviates from the Markov idealization. An exploratory case study illustrates how the micro-level signal can inform curriculum orderings. \"Data order matters\" turns into a testable operator with confidence bounds, our framework offers a common stage to compare optimizers, curricula, and schedules through their induced training memory."}
{"id": "2601.16568", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16568", "abs": "https://arxiv.org/abs/2601.16568", "authors": ["Abdurahman Maarouf", "Alket Bakiaj", "Stefan Feuerriegel"], "title": "Predicting Startup Success Using Large Language Models: A Novel In-Context Learning Approach", "comment": null, "summary": "Venture capital (VC) investments in early-stage startups that end up being successful can yield high returns. However, predicting early-stage startup success remains challenging due to data scarcity (e.g., many VC firms have information about only a few dozen of early-stage startups and whether they were successful). This limits the effectiveness of traditional machine learning methods that rely on large labeled datasets for model training. To address this challenge, we propose an in-context learning framework for startup success prediction using large language models (LLMs) that requires no model training and leverages only a small set of labeled startups as demonstration examples. Specifically, we propose a novel k-nearest-neighbor-based in-context learning framework, called kNN-ICL, which selects the most relevant past startups as examples based on similarity. Using real-world profiles from Crunchbase, we find that the kNN-ICL approach achieves higher prediction accuracy than supervised machine learning baselines and vanilla in-context learning. Further, we study how performance varies with the number of in-context examples and find that a high balanced accuracy can be achieved with as few as 50 examples. Together, we demonstrate that in-context learning can serve as a decision-making tool for VC firms operating in data-scarce environments."}
{"id": "2601.16592", "categories": ["cs.LG", "cs.AI", "cs.DB"], "pdf": "https://arxiv.org/pdf/2601.16592", "abs": "https://arxiv.org/abs/2601.16592", "authors": ["Vinicius Pozzobon Borin", "Jean Michel de Souza Sant'Ana", "Usama Raheel", "Nurul Huda Mahmood"], "title": "Integrating Meteorological and Operational Data: A Novel Approach to Understanding Railway Delays in Finland", "comment": "12 pages, 8 figures, database: https://www.kaggle.com/datasets/viniborin/finland-integrated-train-weather-dataset-fi-tw", "summary": "Train delays result from complex interactions between operational, technical, and environmental factors. While weather impacts railway reliability, particularly in Nordic regions, existing datasets rarely integrate meteorological information with operational train data. This study presents the first publicly available dataset combining Finnish railway operations with synchronized meteorological observations from 2018-2024. The dataset integrates operational metrics from Finland Digitraffic Railway Traffic Service with weather measurements from 209 environmental monitoring stations, using spatial-temporal alignment via Haversine distance. It encompasses 28 engineered features across operational variables and meteorological measurements, covering approximately 38.5 million observations from Finland's 5,915-kilometer rail network. Preprocessing includes strategic missing data handling through spatial fallback algorithms, cyclical encoding of temporal features, and robust scaling of weather data to address sensor outliers. Analysis reveals distinct seasonal patterns, with winter months exhibiting delay rates exceeding 25\\% and geographic clustering of high-delay corridors in central and northern Finland. Furthermore, the work demonstrates applications of the data set in analysing the reliability of railway traffic in Finland. A baseline experiment using XGBoost regression achieved a Mean Absolute Error of 2.73 minutes for predicting station-specific delays, demonstrating the dataset's utility for machine learning applications. The dataset enables diverse applications, including train delay prediction, weather impact assessment, and infrastructure vulnerability mapping, providing researchers with a flexible resource for machine learning applications in railway operations research."}
{"id": "2601.16622", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16622", "abs": "https://arxiv.org/abs/2601.16622", "authors": ["Lin Huang", "Chengxiang Huang", "Ziang Wang", "Yiyue Du", "Chu Wang", "Haocheng Lu", "Yunyang Li", "Xiaoli Liu", "Arthur Jiang", "Jia Zhang"], "title": "E2Former-V2: On-the-Fly Equivariant Attention with Linear Activation Memory", "comment": null, "summary": "Equivariant Graph Neural Networks (EGNNs) have become a widely used approach for modeling 3D atomistic systems. However, mainstream architectures face critical scalability bottlenecks due to the explicit construction of geometric features or dense tensor products on \\textit{every} edge. To overcome this, we introduce \\textbf{E2Former-V2}, a scalable architecture that integrates algebraic sparsity with hardware-aware execution. We first propose \\textbf{E}quivariant \\textbf{A}xis-\\textbf{A}ligned \\textbf{S}parsification (EAAS). EAAS builds on Wigner-$6j$ convolution by exploiting an $\\mathrm{SO}(3) \\rightarrow \\mathrm{SO}(2)$ change of basis to transform computationally expensive dense tensor contractions into efficient, sparse parity re-indexing operations. Building on this representation, we introduce \\textbf{On-the-Fly Equivariant Attention}, a fully node-centric mechanism implemented via a custom fused Triton kernel. By eliminating materialized edge tensors and maximizing SRAM utilization, our kernel achieves a \\textbf{20$\\times$ improvement in TFLOPS} compared to standard implementations. Extensive experiments on the SPICE and OMol25 datasets demonstrate that E2Former-V2 maintains comparable predictive performance while notably accelerating inference. This work demonstrates that large equivariant transformers can be trained efficiently using widely accessible GPU platforms. The code is avalible at https://github.com/IQuestLab/UBio-MolFM/tree/e2formerv2."}
{"id": "2601.16632", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16632", "abs": "https://arxiv.org/abs/2601.16632", "authors": ["Haonan Yang", "Jianchao Tang", "Zhuo Li"], "title": "Dual-Prototype Disentanglement: A Context-Aware Enhancement Framework for Time Series Forecasting", "comment": null, "summary": "Time series forecasting has witnessed significant progress with deep learning. While prevailing approaches enhance forecasting performance by modifying architectures or introducing novel enhancement strategies, they often fail to dynamically disentangle and leverage the complex, intertwined temporal patterns inherent in time series, thus resulting in the learning of static, averaged representations that lack context-aware capabilities. To address this, we propose the Dual-Prototype Adaptive Disentanglement framework (DPAD), a model-agnostic auxiliary method that equips forecasting models with the ability of pattern disentanglement and context-aware adaptation. Specifically, we construct a Dynamic Dual-Prototype bank (DDP), comprising a common pattern bank with strong temporal priors to capture prevailing trend or seasonal patterns, and a rare pattern bank dynamically memorizing critical yet infrequent events, and then an Dual-Path Context-aware routing (DPC) mechanism is proposed to enhance outputs with selectively retrieved context-specific pattern representations from the DDP. Additionally, we introduce a Disentanglement-Guided Loss (DGLoss) to ensure that each prototype bank specializes in its designated role while maintaining comprehensive coverage. Comprehensive experiments demonstrate that DPAD consistently improves forecasting performance and reliability of state-of-the-art models across diverse real-world benchmarks."}
{"id": "2601.16659", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16659", "abs": "https://arxiv.org/abs/2601.16659", "authors": ["Jamie Duell", "Xiuyi Fan"], "title": "Provably Robust Bayesian Counterfactual Explanations under Model Changes", "comment": null, "summary": "Counterfactual explanations (CEs) offer interpretable insights into machine learning predictions by answering ``what if?\" questions. However, in real-world settings where models are frequently updated, existing counterfactual explanations can quickly become invalid or unreliable. In this paper, we introduce Probabilistically Safe CEs (PSCE), a method for generating counterfactual explanations that are $δ$-safe, to ensure high predictive confidence, and $ε$-robust to ensure low predictive variance. Based on Bayesian principles, PSCE provides formal probabilistic guarantees for CEs under model changes which are adhered to in what we refer to as the $\\langle δ, ε\\rangle$-set. Uncertainty-aware constraints are integrated into our optimization framework and we validate our method empirically across diverse datasets. We compare our approach against state-of-the-art Bayesian CE methods, where PSCE produces counterfactual explanations that are not only more plausible and discriminative, but also provably robust under model change."}
{"id": "2601.16715", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16715", "abs": "https://arxiv.org/abs/2601.16715", "authors": ["Adrick Tench", "Thomas Demeester"], "title": "Dynamic Expert-Guided Model Averaging for Causal Discovery", "comment": null, "summary": "Understanding causal relationships is critical for healthcare. Accurate causal models provide a means to enhance the interpretability of predictive models, and furthermore a basis for counterfactual and interventional reasoning and the estimation of treatment effects. However, would-be practitioners of causal discovery face a dizzying array of algorithms without a clear best choice. This abundance of competitive algorithms makes ensembling a natural choice for practical applications. At the same time, real-world use cases frequently face challenges that violate the assumptions of common causal discovery algorithms, forcing heavy reliance on expert knowledge. Inspired by recent work on dynamically requested expert knowledge and LLMs as experts, we present a flexible model averaging method leveraging dynamically requested expert knowledge to ensemble a diverse array of causal discovery algorithms. Experiments demonstrate the efficacy of our method with imperfect experts such as LLMs on both clean and noisy data. We also analyze the impact of different degrees of expert correctness and assess the capabilities of LLMs for clinical causal discovery, providing valuable insights for practitioners."}
{"id": "2601.16812", "categories": ["cs.LG", "eess.IV", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.16812", "abs": "https://arxiv.org/abs/2601.16812", "authors": ["Francesca Lanzillotta", "Chiara Albisani", "Davide Pucci", "Daniele Baracchi", "Alessandro Piva", "Matteo Lapucci"], "title": "Sample-wise Constrained Learning via a Sequential Penalty Approach with Applications in Image Processing", "comment": null, "summary": "In many learning tasks, certain requirements on the processing of individual data samples should arguably be formalized as strict constraints in the underlying optimization problem, rather than by means of arbitrary penalties. We show that, in these scenarios, learning can be carried out exploiting a sequential penalty method that allows to properly deal with constraints. The proposed algorithm is shown to possess convergence guarantees under assumptions that are reasonable in deep learning scenarios. Moreover, the results of experiments on image processing tasks show that the method is indeed viable to be used in practice."}
{"id": "2601.16830", "categories": ["cs.LG", "cs.AI", "cs.NE", "math.ST"], "pdf": "https://arxiv.org/pdf/2601.16830", "abs": "https://arxiv.org/abs/2601.16830", "authors": ["Andrew Thompson", "Miles McCrory"], "title": "Uncertainty propagation through trained multi-layer perceptrons: Exact analytical results", "comment": null, "summary": "We give analytical results for propagation of uncertainty through trained multi-layer perceptrons (MLPs) with a single hidden layer and ReLU activation functions. More precisely, we give expressions for the mean and variance of the output when the input is multivariate Gaussian. In contrast to previous results, we obtain exact expressions without resort to a series expansion."}
{"id": "2601.16834", "categories": ["cs.LG", "cs.CE", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.16834", "abs": "https://arxiv.org/abs/2601.16834", "authors": ["Robin Young", "Srinivasan Keshav"], "title": "Calibrated Probabilistic Interpolation for GEDI Biomass", "comment": null, "summary": "Reliable wall-to-wall biomass mapping from NASA's GEDI mission requires interpolating sparse LiDAR observations across heterogeneous landscapes. While machine learning approaches like Random Forest and XGBoost are standard for this task, they treat spatial predictions of GEDI observations from multispectral or SAR remote sensing data as independent without adapting to the varying difficulty of heterogeneous landscapes. We demonstrate these approaches generally fail to produce calibrated prediction intervals. We identify that this stems from conflating ensemble variance with aleatoric uncertainty and ignoring local spatial context.\n  To resolve this, we introduce Attentive Neural Processes (ANPs), a probabilistic meta-learning framework that explicitly conditions predictions on local observation sets and geospatial foundation model embeddings. Unlike static ensembles, ANPs learn a flexible spatial covariance function, allowing uncertainty estimates to expand in complex landscapes and contract in homogeneous areas. We validate this approach across five distinct biomes ranging from Tropical Amazonian forests to Boreal and Alpine ecosystems, demonstrating that ANPs achieve competitive accuracy while maintaining near-ideal uncertainty calibration. We demonstrate the operational utility of the method through few-shot adaptation, where the model recovers most of the performance gap in cross-region transfer using minimal local data. This work provides a scalable, theoretically rigorous alternative to ensemble variance for continental scale earth observation."}
{"id": "2601.16849", "categories": ["cs.LG", "cs.DS"], "pdf": "https://arxiv.org/pdf/2601.16849", "abs": "https://arxiv.org/abs/2601.16849", "authors": ["Henri Nikoleit", "Ankit Anand", "Anurag Murty Naredla", "Heiko Röglin"], "title": "The Art of Being Difficult: Combining Human and AI Strengths to Find Adversarial Instances for Heuristics", "comment": null, "summary": "We demonstrate the power of human-LLM collaboration in tackling open problems in theoretical computer science. Focusing on combinatorial optimization, we refine outputs from the FunSearch algorithm [Romera-Paredes et al., Nature 2023] to derive state-of-the-art lower bounds for standard heuristics. Specifically, we target the generation of adversarial instances where these heuristics perform poorly. By iterating on FunSearch's outputs, we identify improved constructions for hierarchical $k$-median clustering, bin packing, the knapsack problem, and a generalization of Lovász's gasoline problem - some of these have not seen much improvement for over a decade, despite intermittent attention. These results illustrate how expert oversight can effectively extrapolate algorithmic insights from LLM-based evolutionary methods to break long-standing barriers.\n  Our findings demonstrate that while LLMs provide critical initial patterns, human expertise is essential for transforming these patterns into mathematically rigorous and insightful constructions. This work highlights that LLMs are a strong collaborative tool in mathematics and computer science research."}
{"id": "2601.16873", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16873", "abs": "https://arxiv.org/abs/2601.16873", "authors": ["Satwik Bhattamishra", "Kulin Shah", "Michael Hahn", "Varun Kanade"], "title": "Provably Learning Attention with Queries", "comment": "Preprint", "summary": "We study the problem of learning Transformer-based sequence models with black-box access to their outputs. In this setting, a learner may adaptively query the oracle with any sequence of vectors and observe the corresponding real-valued output. We begin with the simplest case, a single-head softmax-attention regressor. We show that for a model with width $d$, there is an elementary algorithm to learn the parameters of single-head attention exactly with $O(d^2)$ queries. Further, we show that if there exists an algorithm to learn ReLU feedforward networks (FFNs), then the single-head algorithm can be easily adapted to learn one-layer Transformers with single-head attention. Next, motivated by the regime where the head dimension $r \\ll d$, we provide a randomised algorithm that learns single-head attention-based models with $O(rd)$ queries via compressed sensing arguments. We also study robustness to noisy oracle access, proving that under mild norm and margin conditions, the parameters can be estimated to $\\varepsilon$ accuracy with a polynomial number of queries even when outputs are only provided up to additive tolerance. Finally, we show that multi-head attention parameters are not identifiable from value queries in general -- distinct parameterisations can induce the same input-output map. Hence, guarantees analogous to the single-head setting are impossible without additional structural assumptions."}
{"id": "2601.16880", "categories": ["cs.LG", "cs.IT"], "pdf": "https://arxiv.org/pdf/2601.16880", "abs": "https://arxiv.org/abs/2601.16880", "authors": ["Bethan Evans", "Jared Tanner"], "title": "Theory of Minimal Weight Perturbations in Deep Networks and its Applications for Low-Rank Activated Backdoor Attacks", "comment": null, "summary": "The minimal norm weight perturbations of DNNs required to achieve a specified change in output are derived and the factors determining its size are discussed. These single-layer exact formulae are contrasted with more generic multi-layer Lipschitz constant based robustness guarantees; both are observed to be of the same order which indicates similar efficacy in their guarantees. These results are applied to precision-modification-activated backdoor attacks, establishing provable compression thresholds below which such attacks cannot succeed, and show empirically that low-rank compression can reliably activate latent backdoors while preserving full-precision accuracy. These expressions reveal how back-propagated margins govern layer-wise sensitivity and provide certifiable guarantees on the smallest parameter updates consistent with a desired output shift."}
{"id": "2601.16884", "categories": ["cs.LG", "math.NA", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.16884", "abs": "https://arxiv.org/abs/2601.16884", "authors": ["Shijun Zhang", "Zuowei Shen", "Yuesheng Xu"], "title": "Multigrade Neural Network Approximation", "comment": null, "summary": "We study multigrade deep learning (MGDL) as a principled framework for structured error refinement in deep neural networks. While the approximation power of neural networks is now relatively well understood, training very deep architectures remains challenging due to highly non-convex and often ill-conditioned optimization landscapes. In contrast, for relatively shallow networks, most notably one-hidden-layer $\\texttt{ReLU}$ models, training admits convex reformulations with global guarantees, motivating learning paradigms that improve stability while scaling to depth. MGDL builds upon this insight by training deep networks grade by grade: previously learned grades are frozen, and each new residual block is trained solely to reduce the remaining approximation error, yielding an interpretable and stable hierarchical refinement process. We develop an operator-theoretic foundation for MGDL and prove that, for any continuous target function, there exists a fixed-width multigrade $\\texttt{ReLU}$ scheme whose residuals decrease strictly across grades and converge uniformly to zero. To the best of our knowledge, this work provides the first rigorous theoretical guarantee that grade-wise training yields provable vanishing approximation error in deep networks. Numerical experiments further illustrate the theoretical results."}
{"id": "2601.16897", "categories": ["cs.LG", "math.OC", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.16897", "abs": "https://arxiv.org/abs/2601.16897", "authors": ["Antesh Upadhyay", "Sang Bin Moon", "Abolfazl Hashemi"], "title": "FedSGM: A Unified Framework for Constraint Aware, Bidirectionally Compressed, Multi-Step Federated Optimization", "comment": null, "summary": "We introduce FedSGM, a unified framework for federated constrained optimization that addresses four major challenges in federated learning (FL): functional constraints, communication bottlenecks, local updates, and partial client participation. Building on the switching gradient method, FedSGM provides projection-free, primal-only updates, avoiding expensive dual-variable tuning or inner solvers. To handle communication limits, FedSGM incorporates bi-directional error feedback, correcting the bias introduced by compression while explicitly understanding the interaction between compression noise and multi-step local updates. We derive convergence guarantees showing that the averaged iterate achieves the canonical $\\boldsymbol{\\mathcal{O}}(1/\\sqrt{T})$ rate, with additional high-probability bounds that decouple optimization progress from sampling noise due to partial participation. Additionally, we introduce a soft switching version of FedSGM to stabilize updates near the feasibility boundary. To our knowledge, FedSGM is the first framework to unify functional constraints, compression, multiple local updates, and partial client participation, establishing a theoretically grounded foundation for constrained federated learning. Finally, we validate the theoretical guarantees of FedSGM via experimentation on Neyman-Pearson classification and constrained Markov decision process (CMDP) tasks."}
{"id": "2601.16900", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2601.16900", "abs": "https://arxiv.org/abs/2601.16900", "authors": ["Madeline C. Lisaius", "Srinivasan Keshav", "Andrew Blake", "Clement Atzberger"], "title": "Embedding -based Crop Type Classification in the Groundnut Basin of Senegal", "comment": null, "summary": "Crop type maps from satellite remote sensing are important tools for food security, local livelihood support and climate change mitigation in smallholder regions of the world, but most satellite-based methods are not well suited to smallholder conditions. To address this gap, we establish a four-part criteria for a useful embedding-based approach consisting of 1) performance, 2) plausibility, 3) transferability and 4) accessibility and evaluate geospatial foundation model (FM) embeddings -based approaches using TESSERA and AlphaEarth against current baseline methods for a region in the groundnut basin of Senegal. We find that the TESSERA -based approach to land cover and crop type mapping fulfills the selection criteria best, and in one temporal transfer example shows 28% higher accuracy compared to the next best method. These results indicate that TESSERA embeddings are an effective approach for crop type classification and mapping tasks in Senegal."}
{"id": "2601.16905", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.16905", "abs": "https://arxiv.org/abs/2601.16905", "authors": ["Andy Zhu", "Rongzhe Wei", "Yupu Gu", "Pan Li"], "title": "GRIP: Algorithm-Agnostic Machine Unlearning for Mixture-of-Experts via Geometric Router Constraints", "comment": null, "summary": "Machine unlearning (MU) for large language models has become critical for AI safety, yet existing methods fail to generalize to Mixture-of-Experts (MoE) architectures. We identify that traditional unlearning methods exploit MoE's architectural vulnerability: they manipulate routers to redirect queries away from knowledgeable experts rather than erasing knowledge, causing a loss of model utility and superficial forgetting. We propose Geometric Routing Invariance Preservation (GRIP), an algorithm-agnostic framework for unlearning for MoE. Our core contribution is a geometric constraint, implemented by projecting router gradient updates into an expert-specific null-space. Crucially, this decouples routing stability from parameter rigidity: while discrete expert selections remain stable for retained knowledge, the continuous router parameters remain plastic within the null space, allowing the model to undergo necessary internal reconfiguration to satisfy unlearning objectives. This forces the unlearning optimization to erase knowledge directly from expert parameters rather than exploiting the superficial router manipulation shortcut. GRIP functions as an adapter, constraining router parameter updates without modifying the underlying unlearning algorithm. Extensive experiments on large-scale MoE models demonstrate that our adapter eliminates expert selection shift (achieving over 95% routing stability) across all tested unlearning methods while preserving their utility. By preventing existing algorithms from exploiting MoE model's router vulnerability, GRIP adapts existing unlearning research from dense architectures to MoEs."}
{"id": "2601.16906", "categories": ["cs.LG", "cs.HC"], "pdf": "https://arxiv.org/pdf/2601.16906", "abs": "https://arxiv.org/abs/2601.16906", "authors": ["Calarina Muslimani", "Yunshu Du", "Kenta Kawamoto", "Kaushik Subramanian", "Peter Stone", "Peter Wurman"], "title": "The Trajectory Alignment Coefficient in Two Acts: From Reward Tuning to Reward Learning", "comment": null, "summary": "The success of reinforcement learning (RL) is fundamentally tied to having a reward function that accurately reflects the task objective. Yet, designing reward functions is notoriously time-consuming and prone to misspecification. To address this issue, our first goal is to understand how to support RL practitioners in specifying appropriate weights for a reward function. We leverage the Trajectory Alignment Coefficient (TAC), a metric that evaluates how closely a reward function's induced preferences match those of a domain expert. To evaluate whether TAC provides effective support in practice, we conducted a human-subject study in which RL practitioners tuned reward weights for Lunar Lander. We found that providing TAC during reward tuning led participants to produce more performant reward functions and report lower cognitive workload relative to standard tuning without TAC. However, the study also underscored that manual reward design, even with TAC, remains labor-intensive. This limitation motivated our second goal: to learn a reward model that maximizes TAC directly. Specifically, we propose Soft-TAC, a differentiable approximation of TAC that can be used as a loss function to train reward models from human preference data. Validated in the racing simulator Gran Turismo 7, reward models trained using Soft-TAC successfully captured preference-specific objectives, resulting in policies with qualitatively more distinct behaviors than models trained with standard Cross-Entropy loss. This work demonstrates that TAC can serve as both a practical tool for guiding reward tuning and a reward learning objective in complex domains."}
{"id": "2601.16907", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16907", "abs": "https://arxiv.org/abs/2601.16907", "authors": ["Nicolas Tacheny"], "title": "Calibrated Similarity for Reliable Geometric Analysis of Embedding Spaces", "comment": "arXiv admin note: substantial text overlap with arXiv:2512.10350", "summary": "While raw cosine similarity in pretrained embedding spaces exhibits strong rank correlation with human judgments, anisotropy induces systematic miscalibration of absolute values: scores concentrate in a narrow high-similarity band regardless of actual semantic relatedness, limiting interpretability as a quantitative measure. Prior work addresses this by modifying the embedding space (whitening, contrastive fine tuning), but such transformations alter geometric structure and require recomputing all embeddings.\n  Using isotonic regression trained on human similarity judgments, we construct a monotonic transformation that achieves near-perfect calibration while preserving rank correlation and local stability(98% across seven perturbation types). Our contribution is not to replace cosine similarity, but to restore interpretability of its absolute values through monotone calibration, without altering its ranking properties.\n  We characterize isotonic calibration as an order-preserving reparameterization and prove that all order-based constructions (angular ordering, nearest neighbors, threshold graphs and quantile-based decisions) are invariant under this transformation."}
{"id": "2601.16922", "categories": ["cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.16922", "abs": "https://arxiv.org/abs/2601.16922", "authors": ["Navid Ardeshir", "Samuel Deng", "Daniel Hsu", "Jingwen Liu"], "title": "Group-realizable multi-group learning by minimizing empirical risk", "comment": null, "summary": "The sample complexity of multi-group learning is shown to improve in the group-realizable setting over the agnostic setting, even when the family of groups is infinite so long as it has finite VC dimension. The improved sample complexity is obtained by empirical risk minimization over the class of group-realizable concepts, which itself could have infinite VC dimension. Implementing this approach is also shown to be computationally intractable, and an alternative approach is suggested based on improper learning."}
{"id": "2601.16936", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16936", "abs": "https://arxiv.org/abs/2601.16936", "authors": ["Anton Zamyatin", "Patrick Indri", "Sagar Malhotra", "Thomas Gärtner"], "title": "Is BatchEnsemble a Single Model? On Calibration and Diversity of Efficient Ensembles", "comment": "Accepted at the 1st workshop on Epistemic Intelligence in Machine Learning at EurIPS 2025", "summary": "In resource-constrained and low-latency settings, uncertainty estimates must be efficiently obtained. Deep Ensembles provide robust epistemic uncertainty (EU) but require training multiple full-size models. BatchEnsemble aims to deliver ensemble-like EU at far lower parameter and memory cost by applying learned rank-1 perturbations to a shared base network. We show that BatchEnsemble not only underperforms Deep Ensembles but closely tracks a single model baseline in terms of accuracy, calibration and out-of-distribution (OOD) detection on CIFAR10/10C/SVHN. A controlled study on MNIST finds members are near-identical in function and parameter space, indicating limited capacity to realize distinct predictive modes. Thus, BatchEnsemble behaves more like a single model than a true ensemble."}
{"id": "2601.16955", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16955", "abs": "https://arxiv.org/abs/2601.16955", "authors": ["Roman Poletukhin", "Marcel Kollovieh", "Eike Eberhard", "Stephan Günnemann"], "title": "3D Molecule Generation from Rigid Motifs via SE(3) Flows", "comment": null, "summary": "Three-dimensional molecular structure generation is typically performed at the level of individual atoms, yet molecular graph generation techniques often consider fragments as their structural units. Building on the advances in frame-based protein structure generation, we extend these fragmentation ideas to 3D, treating general molecules as sets of rigid-body motifs. Utilising this representation, we employ SE(3)-equivariant generative modelling for de novo 3D molecule generation from rigid motifs. In our evaluations, we observe comparable or superior results to state-of-the-art across benchmarks, surpassing it in atom stability on GEOM-Drugs, while yielding a 2x to 10x reduction in generation steps and offering 3.5x compression in molecular representations compared to the standard atom-based methods."}
{"id": "2601.16971", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16971", "abs": "https://arxiv.org/abs/2601.16971", "authors": ["Mahdi Karami", "Ali Ghodsi"], "title": "Auto-Regressive Masked Diffusion Models", "comment": null, "summary": "Masked diffusion models (MDMs) have emerged as a promising approach for language modeling, yet they face a performance gap compared to autoregressive models (ARMs) and require more training iterations. In this work, we present the Auto-Regressive Masked Diffusion (ARMD) model, an architecture designed to close this gap by unifying the training efficiency of autoregressive models with the parallel generation capabilities of diffusion-based models. Our key insight is to reframe the masked diffusion process as a block-wise causal model. This perspective allows us to design a strictly causal, permutation-equivariant architecture that computes all conditional probabilities across multiple denoising steps in a single, parallel forward pass. The resulting architecture supports efficient, autoregressive-style decoding and a progressive permutation training scheme, allowing the model to learn both canonical left-to-right and random token orderings. Leveraging this flexibility, we introduce a novel strided parallel generation strategy that accelerates inference by generating tokens in parallel streams while maintaining global coherence. Empirical results demonstrate that ARMD achieves state-of-the-art performance on standard language modeling benchmarks, outperforming established diffusion baselines while requiring significantly fewer training steps. Furthermore, it establishes a new benchmark for parallel text generation, effectively bridging the performance gap between parallel and sequential decoding."}
{"id": "2601.16976", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16976", "abs": "https://arxiv.org/abs/2601.16976", "authors": ["Estela Sánchez-Carballo", "Francisco M. Melgarejo-Meseguer", "José Luis Rojo-Álvarez"], "title": "Latent Diffusion for Internet of Things Attack Data Generation in Intrusion Detection", "comment": "Submitted to IEEE. 15 pages, 2 figures", "summary": "Intrusion Detection Systems (IDSs) are a key component for protecting Internet of Things (IoT) environments. However, in Machine Learning-based (ML-based) IDSs, performance is often degraded by the strong class imbalance between benign and attack traffic. Although data augmentation has been widely explored to mitigate this issue, existing approaches typically rely on simple oversampling techniques or generative models that struggle to simultaneously achieve high sample fidelity, diversity, and computational efficiency. To address these limitations, we propose the use of a Latent Diffusion Model (LDM) for attack data augmentation in IoT intrusion detection and provide a comprehensive comparison against state-of-the-art baselines. Experiments were conducted on three representative IoT attack types, specifically Distributed Denial-of-Service (DDoS), Mirai, and Man-in-the-Middle, evaluating both downstream IDS performance and intrinsic generative quality using distributional, dependency-based, and diversity metrics. Results show that balancing the training data with LDM-generated samples substantially improves IDS performance, achieving F1-scores of up to 0.99 for DDoS and Mirai attacks and consistently outperforming competing methods. Additionally, quantitative and qualitative analyses demonstrate that LDMs effectively preserve feature dependencies while generating diverse samples and reduce sampling time by approximately 25\\% compared to diffusion models operating directly in data space. These findings highlight latent diffusion as an effective and scalable solution for synthetic IoT attack data generation, substantially mitigating the impact of class imbalance in ML-based IDSs for IoT scenarios."}
{"id": "2601.16979", "categories": ["cs.LG", "cond-mat.dis-nn", "cs.AI", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.16979", "abs": "https://arxiv.org/abs/2601.16979", "authors": ["Dayal Singh Kalra", "Jean-Christophe Gagnon-Audet", "Andrey Gromov", "Ishita Mediratta", "Kelvin Niu", "Alexander H Miller", "Michael Shvartsman"], "title": "A Scalable Measure of Loss Landscape Curvature for Analyzing the Training Dynamics of LLMs", "comment": "9 pages, 6 figures", "summary": "Understanding the curvature evolution of the loss landscape is fundamental to analyzing the training dynamics of neural networks. The most commonly studied measure, Hessian sharpness ($λ_{\\max}^H$) -- the largest eigenvalue of the loss Hessian -- determines local training stability and interacts with the learning rate throughout training. Despite its significance in analyzing training dynamics, direct measurement of Hessian sharpness remains prohibitive for Large Language Models (LLMs) due to high computational cost. We analyze $\\textit{critical sharpness}$ ($λ_c$), a computationally efficient measure requiring fewer than $10$ forward passes given the update direction $Δ\\mathbfθ$. Critically, this measure captures well-documented Hessian sharpness phenomena, including progressive sharpening and Edge of Stability. Using this measure, we provide the first demonstration of these sharpness phenomena at scale, up to $7$B parameters, spanning both pre-training and mid-training of OLMo-2 models. We further introduce $\\textit{relative critical sharpness}$ ($λ_c^{1\\to 2}$), which quantifies the curvature of one loss landscape while optimizing another, to analyze the transition from pre-training to fine-tuning and guide data mixing strategies. Critical sharpness provides practitioners with a practical tool for diagnosing curvature dynamics and informing data composition choices at scale. More broadly, our work shows that scalable curvature measures can provide actionable insights for large-scale training."}
{"id": "2601.16586", "categories": ["eess.SP", "cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16586", "abs": "https://arxiv.org/abs/2601.16586", "authors": ["Benedikt Fesl", "Fatih Capar"], "title": "Learning Successive Interference Cancellation for Low-Complexity Soft-Output MIMO Detection", "comment": null, "summary": "Low-complexity multiple-input multiple-output (MIMO) detection remains a key challenge in modern wireless systems, particularly for 5G reduced capability (RedCap) and internet-of-things (IoT) devices. In this context, the growing interest in deploying machine learning on edge devices must be balanced against stringent constraints on computational complexity and memory while supporting high-order modulation. Beyond accurate hard detection, reliable soft information is equally critical, as modern receivers rely on soft-input channel decoding, imposing additional requirements on the detector design. In this work, we propose recurSIC, a lightweight learning-based MIMO detection framework that is structurally inspired by successive interference cancellation (SIC) and incorporates learned processing stages. It generates reliable soft information via multi-path hypothesis tracking with a tunable complexity parameter while requiring only a single forward pass and a minimal parameter count. Numerical results in realistic wireless scenarios show that recurSIC achieves strong hard- and soft-detection performance at very low complexity, making it well suited for edge-constrained MIMO receivers."}
{"id": "2601.16764", "categories": ["eess.SY", "cs.LG", "math.OC"], "pdf": "https://arxiv.org/pdf/2601.16764", "abs": "https://arxiv.org/abs/2601.16764", "authors": ["Xingchen Li", "Keyou You"], "title": "ReLU Networks for Model Predictive Control: Network Complexity and Performance Guarantees", "comment": null, "summary": "Recent years have witnessed a resurgence in using ReLU neural networks (NNs) to represent model predictive control (MPC) policies. However, determining the required network complexity to ensure closed-loop performance remains a fundamental open problem. This involves a critical precision-complexity trade-off: undersized networks may fail to capture the MPC policy, while oversized ones may outweigh the benefits of ReLU network approximation. In this work, we propose a projection-based method to enforce hard constraints and establish a state-dependent Lipschitz continuity property for the optimal MPC cost function, which enables sharp convergence analysis of the closed-loop system. For the first time, we derive explicit bounds on ReLU network width and depth for approximating MPC policies with guaranteed closed-loop performance. To further reduce network complexity and enhance closed-loop performance, we propose a non-uniform error framework with a state-aware scaling function to adaptively adjust both the input and output of the ReLU network. Our contributions provide a foundational step toward certifiable ReLU NN-based MPC."}
{"id": "2601.16795", "categories": ["cs.CR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.16795", "abs": "https://arxiv.org/abs/2601.16795", "authors": ["Kenan Begovic", "Abdulaziz Al-Ali", "Qutaibah Malluhi"], "title": "Building a Robust Risk-Based Access Control System to Combat Ransomware's Capability to Encrypt: A Machine Learning Approach", "comment": "This work has been submitted to the IEEE for possible publication", "summary": "Ransomware core capability, unauthorized encryption, demands controls that identify and block malicious cryptographic activity without disrupting legitimate use. We present a probabilistic, risk-based access control architecture that couples machine learning inference with mandatory access control to regulate encryption on Linux in real time. The system builds a specialized dataset from the native ftrace framework using the function_graph tracer, yielding high-resolution kernel-function execution traces augmented with resource and I/O counters. These traces support both a supervised classifier and interpretable rules that drive an SELinux policy via lightweight booleans, enabling context-sensitive permit/deny decisions at the moment encryption begins. Compared to approaches centered on sandboxing, hypervisor introspection, or coarse system-call telemetry, the function-level tracing we adopt provides finer behavioral granularity than syscall-only telemetry while avoiding the virtualization/VMI overhead of sandbox-based approaches. Our current user-space prototype has a non-trivial footprint under burst I/O; we quantify it and recognize that a production kernel-space solution should aim to address this. We detail dataset construction, model training and rule extraction, and the run-time integration that gates file writes for suspect encryption while preserving benign cryptographic workflows. During evaluation, the two-layer composition retains model-level detection quality while delivering rule-like responsiveness; we also quantify operational footprint and outline engineering steps to reduce CPU and memory overhead for enterprise deployment. The result is a practical path from behavioral tracing and learning to enforceable, explainable, and risk-proportionate encryption control on production Linux systems."}
